[
    {
        "page": 51,
        "text": "FIXTURES, FAUCETS AND FIXTURE FITTINGS\n\nare supplied with water according to the manufacturer’s\ndesign conditions. The opening of the overflow pipe shall\nbe located above the flood level rim of the water closet or\nurinal or above a secondary overflow in the flush tank.\n\n415.3.3 Sheet copper. Sheet copper utilized for flush\ntank linings shall conform to ASTM B152 and shall not\nweigh less than 10 ounces per square foot (0.03 kg/m”).\n\n415.3.4 Access required. All parts ina flush tank shall be\nprovided with access for repair and replacement.\n\n415.4 Flush pipes and fittings. Flush pipes and fittings shall\nbe of nonferrous material and shall conform to ASME\nA112.19.5/CSA B45.15.\n\nSECTION 416\nFOOD WASTE DISPOSER UNITS\n\n416.1 Approval. Domestic food waste disposers shall\nconform to ASSE 1008 and shall be listed and labeled in\naccordance with UL 430. Commercial food waste disposers\nshall be listed and labeled in accordance with UL 430. Food\nwaste disposers shall not increase the drainage fixture unit\nload on the sanitary drainage system.\n\n416.2 Domestic food waste disposer waste outlets. Domes-\ntic food waste disposers shall be connected to a drain of not\nless than 1'/, inches (38 mm) in diameter.\n\n416.3 Commercial food waste disposer waste outlets.\nCommercial food waste disposers shall be connected to a\ndrain not less than 1'/, inches (38 mm) in diameter.\nCommercial food waste disposers shall be connected and\ntrapped separately from any other fixtures or sink\ncompartments.\n\n416.4 Water supply required. Food waste disposers shall\nbe provided with a supply of cold water. The water supply\nshall be protected against backflow by an air gap or back-\nflow preventer in accordance with Section 608.\n\nSECTION 417\nGARBAGE CAN WASHERS\n\n417.1 Water connection. The water supply to a garbage can\nwasher shall be protected against backflow by an air gap or a\nbackflow preventer in accordance with Section 608.14.1,\n608.14.2, 608.14.3, 608.14.5, 608.14.6 or 608.14.8.\n\n417.2 Waste connection. Garbage can washers shall be\ntrapped separately. The receptacle receiving the waste from\nthe washer shall have a removable basket or strainer to\nprevent the discharge of large particles into the drainage\nsystem.\n\nSECTION 418\nLAUNDRY TRAYS\n\n418.1 Approval. Laundry trays shall conform to ASME\nA112.19.1/CSA B45.2, ASME A112.19.2/CSA B45.1,\nASME A112.19.3/CSA B45.4 or CSA B45.5/IAPMO Z124.\n\n4-10\n\n418.2 Waste outlet. Each compartment of a laundry tray\nshall be provided with a waste outlet not less than 1'/, inches\n(38 mm) in diameter and a strainer or crossbar to restrict the\nclear opening of the waste outlet.\n\nSECTION 419\nLAVATORIES\n\n419.1 Approval. Lavatories shall conform to ASME\nA112.19.1/CSA B45.2, ASME A112.19.2/CSA B45.1,\nASME A112.19.3/CSA B45.4 or CSA B45.5/IAPMO Z124.\nGroup wash fixtures shall conform to the requirements of\nSection 402. For determining the number of lavatories\nrequired by Table 403.1, every 20 inches (508 mm) of rim\nspace of a group wash fixture shall be considered as one\nlavatory.\n\n419.2 Cultured marble lavatories. Cultured marble vanity\ntops with an integral lavatory shall conform to CSA\nB45.5/IAPMO Z124.\n\n419.3 Lavatory waste outlets. Lavatories and group wash\nfixtures shall have a waste outlet not less than 1'/, inches (32\nmm) in diameter. A strainer, pop-up stopper, crossbar or\nother device shall be provided to restrict the clear opening of\nthe waste outlet.\n\n419.4 Movable lavatory systems. Movable\nsystems shall comply with ASME A112.19.12.\n\n419.5 Tempered water for public hand-washing facilities.\nTempered water shall be delivered from lavatories and group\nwash fixtures located in public toilet facilities provided for\ncustomers, patrons and visitors. Tempered water shall be\ndelivered through an approved water-temperature limiting\ndevice that conforms to ASSE 1070/ASME A112.1070/CSA\nB125.70.\n\nlavatory\n\nSECTION 420\nMANUAL FOOD AND\nBEVERAGE DISPENSING EQUIPMENT\n\n420.1 Approval. Manual food and beverage dispensing\nequipment shall conform to the requirements of NSF 18.\n\nSECTION 421\nSHOWERS\n\n421.1 Approval. Prefabricated showers and shower\ncompartments shall conform to ASME A112.19.1/CSA\nB45.2, ASME A112.19.2/CSA  _B45.1, | ASME\nA112.19.3/CSA_ B45.4 or CSA B45.5/IAPMO_ Z124.\nShower valves for individual showers shall conform to the\nrequirements of Section 412.3.\n\n421.2 Water supply riser. Water supply risers from the\nshower valve to the shower head outlet, whether exposed or\nconcealed, shall be attached to the structure. The attachment\nto the structure shall be made by the use of support devices\ndesigned for use with the specific piping material or by\nfittings anchored with screws.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 52,
        "text": "421.3 Shower waste outlet. Waste outlets serving showers\nshall be not less than 1'/, inches (38 mm) in diameter and,\nfor other than waste outlets in bathtubs, shall have remov-\nable strainers not less than 3 inches (76 mm) in diameter\nwith strainer openings not less than '/, inch (6.4 mm) in least\ndimension. Where each shower space is not provided with an\nindividual waste outlet, the waste outlet shall be located and\nthe floor pitched so that waste from one shower does not\nflow over the floor area serving another shower. Waste\noutlets shall be fastened to the waste pipe in an approved\nmanner.\n\n421.3.1 Waste fittings. Waste fittings shall conform to\nASME A112.18.2/CSA B125.2.\n\n421.4 Shower compartments. Shower compartments shall\nbe not less than 900 square inches (0.58 m’) in interior cross-\nsectional area. Shower compartments shall be not less than\n30 inches (762 mm) in least dimension as measured from the\nfinished interior dimension of the compartment, exclusive of\nfixture valves, showerheads, soap dishes and safety grab bars\nor rails. Except as required in Section 404, the minimum\nrequired area and dimension shall be measured from the\nfinished interior dimension at a height equal to the top of the\nthreshold and at a point tangent to its centerline and shall be\ncontinued to a height not less than 70 inches (1778 mm)\nabove the shower drain outlet.\n\nException: Shower compartments having not less than\n25 inches (635 mm) in minimum dimension measured\nfrom the finished interior dimension of the compartment,\nprovided that the shower compartment has not less than\n1,300 square inches (0.838 m°) of cross-sectional area.\n\n421.4.1 Floor and wall area. Bathtub floors, shower\nfloors, wall areas above built-in tubs that have installed\nshower heads and walls in shower compartments shall be\nconstructed of smooth, corrosion-resistant and nonabsor-\nbent waterproof materials. Wall materials shall extend to\na height of not less than 6 feet (1829 mm) above the room\nfloor level, and not less than 70 inches (1778 mm) above\nthe drain of the tub or shower. Such walls shall form a\nwatertight joint with each other and with either the tub or\nshower floor.\n\n421.4.2 Access. The shower compartment access and\negress opening shall have a clear and unobstructed\nfinished width of not less than 22 inches (559 mm).\nShower compartments required to be designed in confor-\nmance to accessibility provisions shall comply with\nSection 404.1.\n\n421.5 Shower floors or receptors. Floor surfaces shall be\nconstructed of impervious, noncorrosive, nonabsorbent and\nwaterproof materials.\n\n421.5.1 Support. Floors or receptors under shower\ncompartments shall be laid on, and supported by, a\nsmooth and structurally sound base.\n\n421.5.2 Shower lining. Floors under shower compart-\nments, except where prefabricated receptors have been\nprovided, shall be lined and made watertight utilizing\nmaterial complying with Sections 421.5.2.1 through\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nFIXTURES, FAUCETS AND FIXTURE FITTINGS\n\n421.5.2.6. Such liners shall turn up on all sides not less\nthan 2 inches (51 mm) above the finished threshold level.\nLiners shall be recessed and fastened to an approved\nbacking so as not to occupy the space required for wall\ncovering, and shall not be nailed or perforated at any\npoint less than 1 inch (25 mm) above the finished thresh-\nold. Liners shall be pitched one-fourth unit vertical in 12\nunits horizontal (2-percent slope) and shall be sloped\ntoward the fixture drains and be securely fastened to the\nwaste outlet at the seepage entrance, making a watertight\njoint between the liner and the outlet. The completed liner\nshall be tested in accordance with Section 312.9.\n\nExceptions:\n\n1. Floor surfaces under shower heads provided for\nrinsing laid directly on the ground are not\nrequired to comply with this section.\n\n2. Where a sheet-applied, load-bearing, bonded,\nwaterproof membrane is installed as the shower\nlining, the membrane shall not be required to be\nrecessed.\n\n421.5.2.1 PVC sheets. Plasticized polyvinyl chloride\n(PVC) sheets shall meet the requirements of ASTM\nD4551. Sheets shall be joined by solvent welding in\naccordance with the manufacturer’s installation\ninstructions.\n\n421.5.2.2 Chlorinated polyethylene (CPE) sheets.\nNonplasticized chlorinated polyethylene sheet shall\nmeet the requirements of ASTM D4068. The liner\nshall be joined in accordance with the manufacturer’s\ninstallation instructions.\n\n421.5.2.3 Sheet lead. Sheet lead shall weigh not less\nthan 4 pounds per square foot (19.5 kg/m’) and shall be\ncoated with an asphalt paint or other approved coating.\nThe lead sheet shall be insulated from conducting\nsubstances other than the connecting drain by 15-\npound (6.80 kg) asphalt felt or an equivalent. Sheet\nlead shall be joined by burning.\n\n421.5.2.4 Sheet copper. Sheet copper shall conform to\nASTM B152 and shall weigh not less than 12 ounces\nper square foot (3.7 kg/m’). The copper sheet shall be\ninsulated from conducting substances other than the\nconnecting drain by 15-pound (6.80 kg) asphalt felt or\nan equivalent. Sheet copper shall be joined by brazing\nor soldering.\n\n421.5.2.5 Sheet-applied, load-bearing, bonded,\nwaterproof membranes. Sheet-applied, load-bear-\ning, bonded, waterproof membranes shall meet the\nrequirements of ANSI A118.10 and shall be applied in\naccordance with the manufacturer’s installation\ninstructions.\n\n421.5.2.6 Liquid-type, trowel-applied, load-bearing,\nbonded waterproof materials. Liquid-type, trowel-\napplied, load-bearing, bonded waterproof materials\nshall meet the requirements of ANSI A118.10 and\nshall be applied in accordance with the manufacturer’s\ninstructions.\n"
    },
    {
        "page": 53,
        "text": "FIXTURES, FAUCETS AND FIXTURE FITTINGS\n\n421.6 Glazing. Windows and doors within a shower enclo-\nsure shall conform to the safety glazing requirements of the\nInternational Building Code.\n\nSECTION 422\nSINKS\n\n422.1 Approval. Sinks shall conform to ASME\nA112.19.1/CSA B45.2, ASME A112.19.2/CSA_ B45.1,\nASME A112.19.3/CSA B45.4 or CSA B45.5/IAPMO Z124.\n\n422.2 Sink waste outlets. Sinks shall be provided with\nwaste outlets having a diameter not less than 1'/, inches (38\nmm). A strainer or crossbar shall be provided to restrict the\nclear opening of the waste outlet.\n\n422.3 Movable sink systems. Movable sink systems shall\ncomply with ASME A112.19.12.\n\nSECTION 423\nSPECIALTY PLUMBING FIXTURES\n\n423.1 Water connections. Baptisteries, ormamental and lily\npools, aquariums, ornamental fountain basins, swimming\npools, and similar constructions, where provided with water\nsupplies, shall be protected against backflow in accordance\nwith Section 608.\n\n423.2 Approval. Specialties requiring water and waste\nconnections shall be submitted for approval.\n\n423.3 Footbaths and pedicure baths. The water supplied to\nspecialty plumbing fixtures, such as pedicure chairs having\nan integral foot bathtub and footbaths, shall be limited to not\ngreater than 120°F (49°C) by a water-temperature-limiting\ndevice that conforms to ASSE 1070/ASME A112.1070/CSA\nB125.70 or by a water heater complying with ASSE 1082.\n\nSECTION 424\nURINALS\n\n424.1 Approval. Urinals shall conform to ASME\nA112.19.2/CSA B45.1, ASME A112.19.19 or CSA\nB45.5/IAPMO Z124. Urinals shall conform to the water\nconsumption requirements of Section 604.4. Water-supplied\nurinals shall conform to the hydraulic performance require-\nments of ASME AI1I1I2.19.2/CSA B45.1. or CSA\nB45.5/IAPMO Z124.\n\n424.2 Substitution for water closets. In each bathroom or\ntoilet room, urinals shall not be substituted for more than 67\npercent of the required water closets in assembly and educa-\ntional occupancies. Urinals shall not be substituted for more\nthan 50 percent of the required water closets in all other\noccupancies.\n\nSECTION 425\nWATER CLOSETS\n\n425.1 Approval. Water closets shall conform to the water\nconsumption requirements of Section 604.4 and_ shall\n\nconform to ASME _ AI112.19.2/CSA_ B45.1,\nA112.19.3/CSA B45.4 or CSA B45.5/IAPMO Z124.\n\n425.1.1 Hydraulic performance. Water closets shall\nconform to the hydraulic performance requirements of\nASME A112.19.2/CSA B45.1.\n\n425.1.2 Water closet tanks. Water closet tanks shall\nconform to ASME A112.19.2/CSA B45.1, ASME\nA112.19.3/CSA B45.4 or CSA B45.5/IAPMO Z124.\n\n425.1.3 Dual flush water closets. Water closets equipped\nwith a dual flushing device shall comply with ASME\nA112.19.14.\n\n425.2 Water closets for public or employee toilet facili-\nties. Water closet bowls for public or employee toilet\nfacilities shall be of the elongated type.\n\nASME\n\n425.3 Water closet seats. Water closets shall be equipped\nwith seats of smooth, nonabsorbent material. Seats of water\nclosets provided for public or employee toilet facilities shall\nbe of the hinged open-front type. Integral water closet seats\nshall be of the same material as the fixture. Water closet\nseats shall be sized for the water closet bowl type.\n\n425.4 Water closet connections. A 4-inch by 3-inch (102\nmm by 76 mm) closet bend shall be acceptable. Where a 3-\ninch (76 mm) bend is utilized on water closets, a 4-inch by 3-\ninch (102 mm by 76 mm) flange shall be installed to receive\nthe fixture horn.\n\nSECTION 426\nWHIRLPOOL BATHTUBS\n\n426.1 Approval. Whirlpool bathtubs shall comply with\nASME A112.19.7/CSA B45.10 and shall be listed and\nlabeled in accordance with UL 1795.\n\n426.2 Installation. Whirlpool bathtubs shall be installed and\ntested in accordance with the manufacturer’s instructions.\nThe pump shall be located above the weir of the fixture trap.\n\n426.3 Drain. The pump drain and circulation piping shall be\nsloped to drain the water in the volute and the circulation\npiping when the whirlpool bathtub is empty.\n\n426.4 Suction fittings. Suction fittings for whirlpool bath-\ntubs shall comply with ASME A112.19.7/CSA B45.10.\n\n426.5 Access to pump. Access shall be provided to circula-\ntion pumps in accordance with the fixture or pump\nmanufacturer’s installation instructions. Where the manufac-\nturer’s instructions do not specify the location and minimum\nsize of field-fabricated access openings, an opening not less\nthan 12 inches by 12 inches (305 mm by 305 mm) shall be\ninstalled to provide access to the circulation pump. Where\npumps are located more than 2 feet (609 mm) from the\naccess opening, an opening not less than 18 inches by 18\ninches (457 mm by 457 mm) shall be installed. A door or\npanel shall be permitted to close the opening. In all cases, the\naccess opening shall be unobstructed and of the size neces-\nsary to permit the removal and replacement of the circulation\npump.\n426.6 Whirlpool enclosure. Doors within a whirlpool\nenclosure shall conform to ASME A112.19.15.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 54,
        "text": "CHAPTER 5\nWATER HEATERS\n\nUser note:\n\nAbout this chapter: Chapter 5 contains regulations concerning the safety of water heating units and hot water storage tanks. Heated (hot\nor tempered) potable water is needed for plumbing fixtures that are associated with handwashing, bathing, culinary activities and building\nmaintenance. Heated water is commonly stored in large pressurized storage tanks that must be protected against explosion by pressure\nand temperature relief valves specified in this chapter. This chapter also covers the access requirements to water heaters and hot water\nstorage tanks to allow for the maintenance and replacement of that equipment.\n\nSECTION 501\nGENERAL\n\n501.1 Scope. The provisions of this chapter shall govern the\nmaterials, design and installation of water heaters and the\nrelated safety devices and appurtenances.\n\n501.2 Water heater as space heater. Where a combination\npotable water heating and space heating system requires\nwater for space heating at temperatures greater than 140°F\n(60°C), a temperature-actuated mixing valve complying with\nASSE 1017 shall be provided to limit the water supplied to\nthe potable hot water distribution system to a temperature of\n140°F (60°C) or less. The potability of the water shall be\nmaintained throughout the system. Requirements for combi-\nnation potable water heating and space heating systems shall\nbe in accordance with the /nternational Mechanical Code.\n\n501.3 Drain valves. Drain valves for emptying shall be\ninstalled at the bottom of each tank-type water heater and hot\nwater storage tank. The drain valve inlet shall be not less\nthan */,-inch (19 mm) nominal iron pipe size and the outlet\nshall be provided with male garden hose threads.\n\n501.4 Location. Water heaters and storage tanks shall be\nlocated and connected so as to provide access for observa-\ntion, maintenance, servicing and replacement.\n\n501.5 Water heater labeling. Water heaters shall be third-\nparty certified.\n\n501.6 Water temperature control in piping from tankless\nheaters. The temperature of water from tankless water heat-\ners shall be not greater than 140°F (60°C) where intended for\ndomestic uses. This provision shall not supersede the\nrequirement for protective shower valves in accordance with\nSection 412.3.\n\n501.7 Pressure marking of storage tanks. Storage tanks\nand water heaters installed for domestic hot water shall have\nthe maximum allowable working pressure clearly and indeli-\nbly stamped in the metal or marked on a plate welded thereto\nor otherwise permanently attached. Such markings shall be\nin a position with access on the outside of the tank so as to\nmake inspection or reinspection readily possible.\n\n501.8 Temperature controls. Hot water supply systems\nshall be equipped with automatic temperature controls capa-\nble of adjustments from the lowest to the highest acceptable\ntemperature settings for the intended temperature operating\nrange.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nSECTION 502\nINSTALLATION\n\n502.1 General. Water heaters shall be installed in accor-\ndance with the manufacturer’s instructions. Oil-fired water\nheaters shall conform to the requirements of this code and\nthe International Mechanical Code. Electric water heaters\nshall conform to the requirements of this code and provisions\nof NFPA 70. Gas-fired water heaters shall conform to the\nrequirements of the /nternational Fuel Gas Code. Solar ther-\nmal water heating systems shall conform to the requirements\nof the /nternational Mechanical Code and ICC 900/SRCC\n300.\n\n502.1.1 Elevation and protection. Elevation of water\nheater ignition sources and mechanical damage protection\nrequirements for water heaters shall be in accordance\nwith the International Mechanical Code and the Interna-\ntional Fuel Gas Code.\n\n502.2 Rooms used as a plenum. Water heaters using solid,\nliquid or gas fuel shall not be installed in a room containing\nair-handling machinery where such room is used as a\nplenum.\n\n502.3 Water heaters installed in attics. Attics containing a\nwater heater shall be provided with an opening and unob-\nstructed passageway large enough to allow removal of the\nwater heater. The passageway shall be not less than 30\ninches (762 mm) in height and 22 inches (559 mm) in width\nand not more than 20 feet (6096 mm) in length when\nmeasured along the centerline of the passageway from the\nopening to the water heater. The passageway shall have\ncontinuous solid flooring not less than 24 inches (610 mm)\nin width. A level service space not less than 30 inches (762\nmm) in length and 30 inches (762 mm) in width shall be\npresent at the front or service side of the water heater. The\nclear access opening dimensions shall be not less than 20\ninches by 30 inches (508 mm by 762 mm) where such\ndimensions are large enough to allow removal of the water\nheater.\n\n502.4 Seismic supports. Where earthquake loads are appli-\ncable in accordance with the /nternational Building Code,\nwater heater supports shall be designed and installed for the\nseismic forces in accordance with the /nternational Building\nCode.\n\n502.5 Clearances for maintenance and replacement.\nAppliances shall be provided with access for inspection,\n\n5-1\n"
    },
    {
        "page": 55,
        "text": "WATER HEATERS.\n\nservice, repair and replacement without disabling the func-\ntion of a fire-resistance-rated assembly or removing\npermanent construction, other appliances or any other piping\nor ducts not connected to the appliance being inspected,\nserviced, repaired or replaced. A level working space not\nless than 30 inches in length and 30 inches in width (762 mm\nby 762 mm) shall be provided in front of the control side to\nservice an appliance.\n\nSECTION 503\nCONNECTIONS\n\n503.1 Cold water line valve. The cold water branch line\nfrom the main water supply line to each hot water storage\ntank or water heater shall be provided with a valve, located\nnear the equipment and serving only the hot water storage\ntank or water heater. The valve shall not interfere or cause a\ndisruption of the cold water supply to the remainder of the\ncold water system. The valve shall be provided with access\non the same floor level as the water heater served.\n\n503.2 Water circulation. The method of connecting a circu-\nlating water heater to the tank shall provide proper\ncirculation of water through the water heater. The pipe or\ntubes required for the installation of appliances that will\ndraw from the water heater or storage tank shall comply with\nthe provisions of this code for material and installation.\n\nSECTION 504\nSAFETY DEVICES\n\n504.1 Antisiphon devices. An approved means, such as a\ncold water “dip” tube with a hole at the top or a vacuum\nrelief valve installed in the cold water supply line above the\ntop of the heater or tank, shall be provided to prevent siphon-\ning of any storage water heater or tank.\n\n504.2 Vacuum relief valve. Bottom fed water heaters and\nbottom fed tanks connected to water heaters shall have a\nvacuum relief valve installed. The vacuum relief valve shall\ncomply with ANSI Z21.22.\n\n504.3 Shutdown. A means for disconnecting an electric hot\nwater supply system from its energy supply shall be\nprovided in accordance with NFPA 70. A separate valve\nshall be provided to shut off the energy fuel supply to all\nother types of hot water supply systems.\n\n504.4 Relief valve. Storage water heaters operating above\natmospheric pressure shall be provided with an approved,\nself-closing (levered) pressure relief valve and temperature\nrelief valve or combination thereof. The relief valve shall\nconform to ANSI Z21.22. The relief valve shall not be used\nas a means of controlling thermal expansion.\n\n504.4.1 Installation. Such valves shall be installed in the\nshell of the water heater tank. Temperature relief valves\nshall be located in the tank so as to be actuated by the\nwater in the top 6 inches (152 mm) of the tank served. For\ninstallations with separate storage tanks, the approved,\nself-closing (levered) pressure relief valve and tempera-\nture relief valve or combination thereof conforming to\nANSI Z21.22 valves shall be installed on both the storage\n\nwater heater and storage tank. There shall not be a check\nvalve or shutoff valve between a relief valve and the\nheater or tank served.\n\n504.5 Relief valve approval. Temperature and pressure\nrelief valves, or combinations thereof, and energy cutoff\ndevices shall bear the label of an approved agency and shall\nhave a temperature setting of not more than 210°F (99°C)\nand a pressure setting not exceeding the tank or water heater\nmanufacturer’s rated working pressure or 150 psi (1035\nkPa), whichever is less. The relieving capacity of each pres-\nsure relief valve and each temperature relief valve shall\nequal or exceed the heat input to the water heater or storage\ntank.\n\n504.6 Requirements for discharge piping. The discharge\npiping serving a pressure relief valve, temperature relief\nvalve or combination thereof shall:\n\n1. Not be directly connected to the drainage system.\n\n2. Discharge through an air gap located in the same\nroom as the water heater.\n\n3. Not be smaller than the diameter of the outlet of the\nvalve served and shall discharge full size to the air\ngap.\n\n4. Serve a single relief device and shall not connect to\npiping serving any other relief device or equipment.\n\n5. Discharge to the floor, to the pan serving the water\nheater or storage tank, to a waste receptor or to the\noutdoors.\n\n6. Discharge in a manner that does not cause personal\ninjury or structural damage.\n\n7. Discharge to a termination point that is readily\nobservable by the building occupants.\n\n8. Not be trapped.\n\n9. Be installed so as to flow by gravity.\n\n0. Terminate not more than 6 inches (152 mm) above\nand not less than two times the discharge pipe diame-\nter above the floor or flood level rim of the waste\nreceptor.\n\n1. Not have a threaded connection at the end of such\npiping.\n\n2. Not have valves or tee fittings.\n\n3. Be constructed of those materials listed in Section\n605.4 or materials tested, rated and approved for such\nuse in accordance with ASME A112.4.1.\n\n4. Be one nominal size larger than the size of the relief\nvalve outlet, where the relief valve discharge piping\n\nis installed with insert fittings. The outlet end of such\ntubing shall be fastened in place.\n\n504.7 Required pan. Where a storage tank-type water\nheater or a hot water storage tank is installed in a location\nwhere water leakage from the tank will cause damage, the\ntank shall be installed in a pan constructed of one of the\nfollowing:\n\n1. Galvanized steel or aluminum of not less than 0.0236\ninch (0.6010 mm) in thickness.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 56,
        "text": "2. Plastic not less than 0.036 inch (0.9 mm) in\nthickness.\n\n3. Other approved materials.\n\nA plastic pan shall not be installed beneath a gas-fired\nwater heater.\n\n504.7.1 Pan size and drain. The pan shall be not less\nthan 1'/, inches (38 mm) in depth and shall be of suffi-\ncient size and shape to receive all dripping or condensate\nfrom the tank or water heater. The pan shall be drained by\nan indirect waste pipe having a diameter of not less than\n3/, inch (19 mm). Piping for safety pan drains shall be of\nthose materials listed in Table 605.4.\n\n504.7.2 Pan drain termination. The pan drain shall\nextend full size and terminate over a suitably located indi-\nrect waste receptor or floor drain or extend to the exterior\nof the building and terminate not less than 6 inches (152\nmm) and not more than 24 inches (610 mm) above the\nadjacent ground surface. Where a pan drain was not\npreviously installed, a pan drain shall not be required for a\nreplacement water heater installation.\n\nSECTION 505\nINSULATION\n\n[E] 505.1 Unfired vessel insulation. Unfired hot water stor-\nage tanks shall be insulated to R-12.5 (h x ft? x °F)/Btu (R-\n2.2 m’ x K/W).\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nWATER HEATERS\n"
    },
    {
        "page": 57,
        "text": "5-4\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 58,
        "text": "CHAPTER 6\nWATER SUPPLY AND DISTRIBUTION\n\nUser note:\n\nAbout this chapter: Many plumbing fixtures require a supply of potable water. Other fixtures could be supplied with nonpotable water such\nas reclaimed water. Chapter 6 covers the requirements for water distribution piping systems to and within buildings. The regulations include\nthe types of materials and the connection methods for such systems. The prevention of backflow of contaminated or polluted water into any\npotable water system is critical for protection of users of potable water. This chapter regulates the assemblies, devices and methods that\n\nare used for this purpose.\nSECTION 601 602.3.1 Sources. Dependent on geological and soil condi-\nGENERAL tions and the amount of rainfall, individual water supplies\n\n601.1 Scope. This chapter shall govern the materials, design\nand installation of water supply systems, both hot and cold,\nfor utilization in connection with human occupancy and\nhabitation and shall govern the installation of individual\nwater supply systems.\n\n601.2 Solar energy utilization. Solar energy systems used\nfor heating potable water or using an independent medium\nfor heating potable water shall comply with the applicable\nrequirements of this code. The use of solar energy shall not\ncompromise the requirements for cross connection or protec-\ntion of the potable water supply system required by this\ncode.\n\n601.3 Existing piping used for grounding. Existing metal-\nlic water service piping used for electrical grounding shall\nnot be replaced with nonmetallic pipe or tubing until other\napproved means of grounding is provided.\n\n601.4 Tests. The potable water distribution system shall be\ntested in accordance with Section 312.5.\n\n601.5 Rehabilitation of piping systems. Where pressure\npiping systems are rehabilitated using an epoxy lining\nsystem, such lining system shall comply with ASTM F2831.\n\nSECTION 602\nWATER REQUIRED\n\n602.1 General. Structures equipped with plumbing fixtures\nand utilized for human occupancy or habitation shall be\nprovided with a potable supply of water in the amounts and\nat the pressures specified in this chapter.\n\n602.2 Potable water required. Only potable water shall be\nsupplied to plumbing fixtures that provide water for drink-\ning, bathing or culinary purposes, or for the processing of\nfood, medical or pharmaceutical products. Unless otherwise\nprovided in this code, potable water shall be supplied to all\nplumbing fixtures.\n\n602.3 Individual water supply. Where a potable public\nwater supply is not available, individual sources of potable\nwater supply shall be utilized.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nare of the following types: drilled well, driven well, dug\nwell, bored well, spring, stream or cistern. Surface bodies\nof water and land cisterns shall not be sources of individ-\nual water supply unless properly treated by approved\nmeans to prevent contamination. Individual water\nsupplies shall be constructed and installed in accordance\nwith the applicable state and local laws. Where such laws\ndo not address all of the requirements set forth in NGWA-\n01, individual water supplies shall comply with NGWA-\n01 for those requirements not addressed by state and local\nlaws.\n\n602.3.2 Minimum quantity. The combined capacity of\nthe source and storage in an individual water supply\nsystem shall supply the fixtures with water at rates and\npressures as required by this chapter.\n\n602.3.3 Water quality. Water from an individual water\nsupply shall be approved as potable by the authority\nhaving jurisdiction prior to connection to the plumbing\nsystem.\n\n602.3.4 Disinfection of system. After construction, the\nindividual water supply system shall be purged of delete-\nrious matter and disinfected in accordance with Section\n610.\n\n602.3.5 Pumps. Pumps shall be rated for the transport of\npotable water. Pumps in an individual water supply\nsystem shall be constructed and installed so as to prevent\ncontamination from entering a potable water supply\nthrough the pump units. Pumps intended to supply drink-\ning water shall conform to NSF 61. Pumps shall be sealed\nto the well casing or covered with a watertight seal.\nPumps shall be designed to maintain a prime and installed\nsuch that ready access is provided to the pump parts of\nthe entire assembly for repairs.\n\n602.3.5.1 Pump enclosure. The pump room or enclo-\nsure around a well pump shall be drained and protected\nfrom freezing by heating or other approved means.\nWhere pumps are installed in basements, such pumps\nshall be mounted on a block or shelf not less than 18\ninches (457 mm) above the basement floor. Well pits\nshall be prohibited.\n\n6-1\n"
    },
    {
        "page": 59,
        "text": "WATER SUPPLY AND DISTRIBUTION\n\nSECTION 603\nWATER SERVICE\n\n603.1 Size of water service pipe. The water service pipe\nshall be sized to supply water to the structure in the quanti-\nties and at the pressures required in this code. The water\nservice pipe shall be not less than */, inch (19.1 mm) in\ndiameter.\n\n603.2 Separation of water service and building sewer.\nWhere water service piping is located in the same trench\nwith the building sewer, such sewer shall be constructed of\nmaterials listed in Table 702.2. Where the building sewer\npiping is not constructed of materials listed in Table 702.2,\nthe water service pipe and the building sewer shall be hori-\nzontally separated by not less than 5 feet (1524 mm) of\nundisturbed or compacted earth. The required separation\ndistance shall not apply where a water service pipe crosses a\nsewer pipe, provided that the water service is sleeved to a\npoint not less than 5 feet (1524 mm) horizontally from the\nsewer pipe centerline on both sides of such crossing. The\nsleeve shall be of pipe materials listed in Table 605.3, 702.2\nor 702.3. The required separation distance shall not apply\nwhere the bottom of the water service pipe, located within 5\nfeet (1524 mm) of the sewer, is not less than 12 inches (305\nmm) above the highest point of the top of the building sewer.\n\n603.2.1 Water service near sources of pollution. Pota-\nble water service pipes shall not be located in, under or\nabove cesspools, septic tanks, septic tank drainage fields\nor seepage pits. Where soil or ground water causes\ncontaminated conditions for piping, analysis shall be\nrequired in accordance with Section 605.1.\n\nSECTION 604\nDESIGN OF BUILDING WATER\nDISTRIBUTION SYSTEM\n\n604.1 General. The design of the water distribution system\nshall conform to accepted engineering practice. Methods\nutilized to determine pipe sizes shall be approved.\n\n604.2 System interconnection. At the points of interconnec-\ntion between the hot and cold water supply piping systems\nand the individual fixtures, appliances or devices, provisions\nshall be made to prevent flow between such piping systems.\n\n604.3 Water distribution system design criteria. The\nwater distribution system shall be designed, and pipe sizes\nshall be selected such that under conditions of peak demand,\nthe capacities at the fixture supply pipe outlets shall be not\nless than shown in Table 604.3. The minimum flow rate and\nflow pressure provided to fixtures and appliances not listed\nin Table 604.3 shall be in accordance with the manufac-\nturer’s installation instructions.\n\n604.4 Maximum flow and water consumption. The maxi-\nmum water consumption flow rates and quantities for all\n\n6-2\n\nplumbing fixtures and fixture fittings shall be in accordance\nwith Table 604.4.\n\nExceptions:\n\n1. Blowout design water closets having a water\nconsumption not greater than 3'/, gallons (13 L)\nper flushing cycle.\n\nVegetable sprays.\n\n3. Clinical sinks having a water consumption not\ngreater than 4'/, gallons (17 L) per flushing cycle.\nService sinks.\n\n5. Emergency showers.\n\nTABLE 604.3\nWATER DISTRIBUTION SYSTEM DESIGN CRITERIA\nREQUIRED CAPACITY AT FIXTURE SUPPLY PIPE OUTLETS\n; ‘ ' 9) FLow ™ FLOW |\n\n1 1\ni] FIXTURE SUPPLY OUTLET SERVING np RATE? | PRESSURE|\n\nfs ' ; — (gpm) — (psi) =\n[ rot a\n+ Bathtub, balanced-pressure, thermostatic - _ 4\n\nor combination balanced-pressure/ 4 0 — 20, =\n\n[ thermostatic mixing valve\n\nDrinking fountain\n\nLaundry tray 4 8\nLavatory, private 0.8 8\nLavatory, private, mixing valve 0.8 8\nLavatory, public 0.4 8\nShower 2.5 8\nShower, balanced-pressure, thermostatic\n\nor combination balanced-pressure/ 2.5° 20\nthermostatic mixing valve\n\nSillcock, hose bibb 5 8\nSink, residential 1.75 8\nSink, service 3 8\nUrinal, valve 12 25\nWater closet, blow out, flushometer valve 25 45\nWater closet, flushometer tank 1.6 20\nWater closet, siphonic, flushometer valve 25 35\nWater closet, tank, close coupled 3 20\nWater closet, tank, one piece 6 20\n\nFor SI:1 pound per square inch = 6.895 kPa, 1 gallon per minute = 3.785 L/m.\n\na. For additional requirements for flow rates and quantities, see Section\n604.4.\n\nb. Where the shower mixing valve manufacturer indicates a lower flow\nrating for the mixing valve, the lower value shall be applied.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 60,
        "text": "WATER SUPPLY AND DISTRIBUTION\n\nTABLE 604.4 TABLE 604.5\nMAXIMUM FLOW RATES AND CONSUMPTION FOR MINIMUM SIZES OF FIXTURE WATER SUPPLY PIPES\nPLUMBING FIXTURES AND FIXTURE FITTINGS MINIMUM PIPE|SIZE\n| PLUMBING FIXTURE OR ) | MAXIMUM-FLOW—____ FIXTURE [ (inch)\n[emer sy fT ine!\n[FIXTURE FITTING RATE OR QUANTITY° 1\n— i — +7 | Bathtubs* (60\" « 32” and smaller) b\n| Lavatory, private\nee A a 1\n\"Lavatory, public (metering) 0.25 gallon per metering cycle Bathtubs” (larger thar 60\" >\" 32\") ——!, _.___\nLavatory, public 0.5 apm at 60 psi | Bidet ___| __| 8\n(other than metering) > Spm at ou Psi _Combnrationsnkand tray Ny\nShower head* 2.5 gpm at 80 psi | Dishwasher} domestic* Wy\nSink faucet 2.2 gpm at 60 psi Drinking fountain [—4.-———\nUrinal 1.0 gallon per flushing cycle Hose bibbs y\n2\nWater closet 1.6 gallons per flushing cycle Kitchen sink* y\n2\nFor SI: 1 gallon = 3.785 L, 1 gallon per minute = 3.785 L/m, Laundry, 1, 2 or 3 compartments* yy.\n1 pound per square inch = 6.895 kPa. 5 >\na. A hand-held shower spray is a shower head. Lavatory ls\nb. Consumption tolerances shall be determined from referenced standards. Shower, single head* \",\n604.5 Size of fixture supply. The minimum size of a fixture Sinks, flushing rim 4,\nsupply pipe shall be as shown in Table 604.5. The fixture 5 . 1\nwe . . Sinks, service |,\nsupply pipe shall terminate not more than 30 inches (762\nmm) from the point of connection to the fixture. A reduced- Urinal, flush tank h\nsize flexible water connector installed between the supply Urinal, flushometer valve x,\npipe and the fixture shall be of an approved type. The supply f\npipe shall extend to the floor or wall adjacent to the fixture. Wall hydrant fh\nThe minimum size of individual distribution lines utilized in Water closet, flush tank Vy\ngridded or parallel water distribution systems shall be as Water closet, flushometer tank 3/\nshown in Table 604.5. , .\n. . Water closet, flushometer valve 1\n604.6 Variable street pressures. Where street water main _ 4 f\npressures fluctuate, the building water distribution system Water closet, one piece h\n\nshall be designed for the minimum pressure available.\n\n604.7 Inadequate water pressure. Wherever water pressure\nfrom the street main or other source of supply is insufficient\nto provide flow pressures at fixture outlets as required under\nTable 604.3, a water pressure booster system conforming to\nSection 606.5 shall be installed on the building water supply\nsystem.\n\n604.8 Water pressure-reducing valve or regulator. Where\nwater pressure within a building exceeds 80 psi (552 kPa)\nstatic, an approved water pressure-reducing valve conform-\ning to ASSE 1003 or CSA B356 with strainer shall be\ninstalled to reduce the pressure in the building water distri-\nbution piping to not greater than 80 psi (552 kPa) static.\n\nException: Service lines to sill cocks and outside\nydrants, and main supply risers where pressure from the\nmains is reduced to 80 psi (552 kPa) or less at individual\nfixtures.\n\n604.8.1 Valve design. The pressure-reducing valve shall\nbe designed to remain open to permit uninterrupted water\nflow in case of valve failure.\n\n604.8.2 Repair and removal. Water pressure-reducing\nvalves, regulators and strainers shall be so constructed\nand installed as to permit repair or removal of parts with-\nout breaking a pipeline or removing the valve and strainer\nrom the pipeline.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nFor SI: 1 inch = 25.4 mm, | foot = 304.8 mm,\n1 pound per square inch = 6.895 kPa.\n\na. Where the developed length of the distribution line is 50 feet or less, and\nthe available pressure at the meter is 35 psi or greater, the minimum size\nof an individual distribution line supplied from a manifold and installed\nas part of a parallel water distribution system shall be one nominal tube\nsize smaller than the sizes indicated.\n\n604.9 Water hammer. The flow velocity of the water distri-\nbution system shall be controlled to reduce the possibility of\nwater hammer. A water-hammer arrestor shall be installed\nwhere quick-closing valves are utilized. Water-hammer\narrestors shall be installed in accordance with the manufac-\nturer’s instructions. Water-hammer arrestors shall conform\nto ASSE 1010.\n\n604.10 Gridded and parallel water distribution system\nmanifolds. Hot water and cold water manifolds installed\nwith gridded or parallel connected individual distribution\nlines to each fixture or fixture fitting shall be designed in\naccordance with Sections 604.10.1 through 604.10.3.\n\n604.10.1 Manifold sizing. Hot water and cold water\nmanifolds shall be sized in accordance with Table\n604.10.1. The total gallons per minute is the demand of\nall outlets supplied.\n\n6-3\n"
    },
    {
        "page": 61,
        "text": "WATER SUPPLY AND DISTRIBUTION\n\nTABLE 604.10.1\nMANIFOLD SIZING\n\nNOMINAL Size Mt MAXIMUM DW (Gpm)\nINTERNAL DIAMETER Velocity at i\n(inches)\n7, 2 5\nM 6 ul\n1 10 20\n1/, 15 31\n/, 2 44\n\nFor SI: 1 inch = 25.4 mm, | gallon per minute = 3.785 L/m,\n1 foot per second = 0.305 m/s.\n\n604.10.2 Valves. Individual fixture shutoff valves\ninstalled at the manifold shall be identified as to the\nfixture being supplied.\n\n604.10.3 Access. Access shall be provided to manifolds\nwith integral factory- or field-installed valves.\n\n604.11 Individual pressure balancing in-line valves for\nindividual fixture fittings. Where individual pressure\nbalancing in-line valves for individual fixture fittings are\ninstalled, such valves shall comply with ASSE 1066. Such\nvalves shall be installed in a location with access. The valves\nshall not be utilized alone as a substitute for the balanced\npressure, thermostatic or combination shower valves\nrequired in Section 412.3.\n\nSECTION 605\nMATERIALS, JOINTS AND CONNECTIONS\n\n605.1 Soil and ground water. The installation of a water\nservice or water distribution pipe shall be prohibited in soil\n\nand ground water contaminated with solvents, fuels, organic\ncompounds or other detrimental materials causing perme-\nation, corrosion, degradation or structural failure of the\npiping material. Where detrimental conditions are suspected,\na chemical analysis of the soil and ground water conditions\nshall be required to ascertain the acceptability of the water\nservice or water distribution piping material for the specific\ninstallation. Where detrimental conditions exist, approved\nalternative materials or routing shall be required.\n\n605.2 Lead content of water supply pipe and fittings. Pipe\nand pipe fittings, including valves and faucets, utilized in the\nwater supply system shall have not more than 8-percent lead\ncontent.\n\n605.2.1 Lead content of drinking water pipe and\nfittings. Pipe, pipe fittings, joints, valves, faucets and\nfixture fittings utilized to supply water for drinking or\ncooking purposes shall comply with NSF 372 and shall\nhave a weighted average lead content of 0.25 percent or\nless.\n605.3 Water service pipe. Water service pipe shall conform\nto NSF 61 and shall conform to one of the standards listed in\nTable 605.3. Water service pipe or tubing, installed under-\nground and outside of the structure, shall have a working\npressure rating of not less than 160 psi (1100 kPa) at 73.4°F\n(23°C). Where the water pressure exceeds 160 psi (1100\nkPa), piping material shall have a working pressure rating\nnot less than the highest available pressure. Water service\npiping materials not third-party certified for water distribu-\ntion shall terminate at or before the full open valve located at\nthe entrance to the structure. Ductile iron water service\npiping shall be cement mortar lined in accordance with\nAWWA C104/A21.4.\n\nTABLE 605.3\nWATER SERVICE PIPE\n\nMATERIAL\n\nSTANDARD.\n\nsAcrytomtrite-bmmntienestyrene (ABS) plastic ppt-—=<<—\n\nASTM D1527;23S 9822282\n\n_Chlorinated polyvinyl chloride (CPVC) plastic pipe ASTM D2846; ASTM F441; ASTM F442; CSA B137.6\n\nChlorinated polyvinyl chloride/aluminum/chlorinated polyvinyl chloride\n\n- (CPVC/AL/CPVC)\n\n—ASFM-¥2855-\n\n€opper-or-copper-alloy-pipe-\n\nASTM -B42-ASTM B43; ASTM B302_\n\nCopper or copper-alloy tubing (Type K, WK,-E,-WE,Mor WM)\nCross-linked polyethylene (PEX) plastic pipe-and tubing\nCross-linked polyethylene/aluminum/cross-linked polyethylene\n(PEX-AL-PEX) pipe\n\nCross-linked polyethylene/aluminum/high-density polyethylene\n(PEX-AL-HDPE)\n\nDuctile iron water pipe\n\nGalvanized steel pipe\n\nPolyethylene (PE) plastic pipe\n\nPolyethylene (PE) plastic tubing\nPolyethylene/aluminum/polyethylene (PE-AL-PE) pipe\nPolyethylene of raised temperature (PE-RT) plastic tubing\nPolypropylene (PP) plastic pipe or tubing\n\nPolyviny! chloride (PVC) plastic pipe\n\nStainless steel pipe (Type 304/304L)\n\nStainless steel pipe (Type 316/316L)\n\n6-4\n\nASTM B75;ASTM B88; ASTM B251; ASTM B447\nASTM F876; AWWA €904;€SA BI375\n\nASTM F1281; ASTM F2262; CSA B137.10\n\nASTM F1986\n\nAWWA C151/A21.51; AWWA C115/A21.15\n\nASTM A53\n\nASTM D2239; ASTM D3035; AWWA C901; CSA B137.1\nASTM D2737; AWWA C901; CSA B137.1\n\nASTM F1282; CSA B137.9\n\nASTM F2769; CSA B137.18\n\nASTM F2389; CSA B137.11\n\nASTM D1785; ASTM D2241; ASTM D2672; CSA B137.3\nASTM A269/A269M; ASTM A312; ASTM A778\n\nASTM A269/A269M; ASTM A312; ASTM A778\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 62,
        "text": "605.3.1 Dual check-valve-type backflow preventer.\nDual check-valve backflow preventers installed on the\nwater supply system shall comply with ASSE 1024 or\nCSA B64.6.\n\n605.4 Water distribution pipe. Water distribution pipe and\ntubing shall conform to NSF 61 and shall conform to one of\nthe standards listed in Table 605.4. Hot water distribution\npipe and tubing shall have a pressure rating of not less than\n100 psi (690 kPa) at 180°F (82°C).\n\n605.5 Fittings. Pipe fittings shall be approved for installa-\ntion with the piping material installed and shall comply with\nthe applicable standards listed in Table 605.5. Pipe fittings\nutilized in water supply systems shall also comply with NSF\n61. Ductile and gray iron pipe and pipe fittings utilized in\nwater service piping systems shall be cement mortar lined in\naccordance with AWWA C104/A21.4.\n\n605.5.1 Mechanically formed tee fittings. Mechanically\nextracted outlets shall have a height not less than three\ntimes the thickness of the branch tube wall.\n\nWATER SUPPLY AND DISTRIBUTION\n\n605.5.1.1 Full flow assurance. Branch tubes shall not\nrestrict the flow in the run tube. A dimple serving as a\ndepth stop shall be formed in the branch tube to ensure\nthat penetration into the collar is of the correct depth.\nFor inspection purposes, a second dimple shall be\nplaced '/, inch (64 mm) above the first dimple.\nDimples shall be aligned with the tube run.\n\n605.5.1.2  Brazed joints. Mechanically formed tee\nfittings shall be brazed in accordance with Section\n605.14.1.\n\n605.6 Flexible water connectors. Flexible water connectors\nexposed to continuous pressure shall conform to ASME\nA112.18.6/CSA B125.6. Access shall be provided to all flex-\nible water connectors.\n\n605.7 Valves. Valves shall be compatible with the type of\npiping material installed in the system. Valves shall conform\nto one of the standards listed in Table 605.7 or shall be\napproved. Valves intended to supply drinking water shall\nmeet the requirements of NSF 61.\n\nTABLE 605.4\nWATER DISTRIBUTION PIPE\nMATERIAL STANDARD.\n~Chiorinated polyvinyt chioride (CPVC) plastic pipe and tubing ___ASTM _D2846; ASTM F441; ASTM F442; CSA B137.6\n\n~ Chlorinated polyvinyl chloride/aluminum/chlorinated polyvinyl chloride STM-F2855\n\n(CPVC/AL/CPVC)\n\nCopper or copper-alloy pipe\n\nASTM-B42;AS}\n\nM B43; ASTM B302\n\nCopper or copper-alloy tubing (Type K, WK,-E- WE, or WM ASTN-B75;-ASTM B88; ASTM B251; ASTM B447\n\nCross-linked polyethylene (PEX) plastic tubing\n\nCross-linked polyethylene/aluminum/cross-linked polyethylene\n(PEX-AL-PEX) pipe\n\nCross-linked polyethylene/aluminum/high-density polyethylene\n(PEX-AL-HDPE)\n\nDuctile iron pipe\n\nGalvanized steel pipe\n\nPolyethylene/aluminum/polyethylene (PE-AL-PE) composite pipe\nPolyethylene of raised temperature (PE-RT) plastic tubing\n\nPolypropylene (PP) plastic pipe or tubing\nStainless steel pipe (Type 304/304L)\nStainless steel pipe (Type 316/316L)\n\nASTM F876; CSA B137.5\n\nASTM F1281; ASTM F2262; CSA B137.10\n\nASTM F1986\n\nAWWA C115/A21.15; AWWA C151/A21.51\nASTM A53\n\nASTM F1282\n\nASTM F2769; CSA B137.18\n\nASTM F2389; CSA B137.11\n\nASTM A312; ASTM A778\n\nASTM A312; ASTM A778\n\nTABLE 605.7\nVALVES\n\nporte OP YC atastic\n\n~ Copper or copper alloy\n\nCross-linked polyethylene (PEX) plastic\n\nGray iron and ductile iron\n\nPolypropylene (PP) plastic\nPolyvinyl chloride (PVC) plastic\n\n2021 INTERNATIONAL PLUMBING CODE®\n\n—==_7 CANAD ———\n\nASME A 112.4.14; ASME A112.18.1/CSA B125.1; ASTM F1970;\n\nCSA B125.3; IAPMO Z1157; MSS SP-122\n\nASME A112.4.14; ASME A112.18.1/CSA B125.1; ASME B16.34;\n~ CSA B125.3; LAPMO Z1157; MSS SP-67; MSS SP-80;\nMSS SP-110; MSS SP-139\n\nASME A112.4.14; ASME A112.18.1/CSA B125.1; CSA B125.3;\nIAPMO Z1157; NSF 359\n\nAWWA C500; AWWA C504; AWWA C507; IAPMO Z1157;\nMSS SP-67; MSS SP-70; MSS SP-71; MSS SP-72; MSS SP-78\n\nASME A112.4.14; ASTM F2389; IAPMO Z1157\nASME A112.4.14; ASTM F1970; IAPMO Z1157; MSS SP-122\n\n6-5\n"
    },
    {
        "page": 63,
        "text": "WATER SUPPLY AND DISTRIBUTION\n\nTABLE 605.5\nPIPE FITTINGS\n\nMATERIAL\n\nSTANDARD\n\nastiron\n\nAST ND 2408—\n—————\n\nPVCS -prastic\n\n+ Copper or copper alloy\n\n| Cross-linked polyethylene/aluminum/high-density polyethylene\n(PEX-AL-HDPE)\n\nil Fittings for cross-linked polyethylene (PEX) plastic tubing\n\nFittings for polyethylene of raised temperature (PE-RT) plastic tubing\n\nGray iron and ductile iron\n\nInsert fittings for polyethylene/aluminum/polyethylene (PE-AL-PE) and\n\ncross-linked polyethylene/aluminum/cross-linked polyethylene\n(PEX-AL-PEX)\nMalleable iron\n\nMetal (brass) insert fittings for polyethylene/aluminum/polyethylene\n(PE-AL-PE) and cross-linked polyethylene/aluminum/cross-linked poly-\n\nethylene (PEX-AL-PEX)\nPolyethylene (PE) plastic pipe\nPolypropylene (PP) plastic pipe or tubing\n\nPolyvinyl chloride (PVC) plastic\nStainless steel (Type 304/304L)\nStainless steel (Type 316/316L)\n\nSteel\n\n605.8 Manufactured pipe nipples. Manufactured pipe\nnipples shall conform to one of the standards listed in Table\n605.8.\n\nTABLE 605.8\nMANUFACTURED PIPE NIPPLES\n\nMATERIAL STANDARD\nCopper, copper alloy, and chromium-plated ASTM B687\nSteel ASTM A733\n\n605.9 Prohibited joints and connections. The following\ntypes of joints and connections shall be prohibited:\n\n1. Cement or concrete joints.\n\n2. Joints made with fittings not approved for the\nspecific installation.\n\n3. Solvent-cement joints between different types of\nplastic pipe.\n4. Saddle-type fittings.\n\n6-6\n\nes mM ASSE | (61; ASTM D2846; ASTM F437; ASTM F438;\n\n= ASTM F439; CSA B137.6\n\n@ ASME BI6.15; ASME B16.18; ASME B16.22;\n— ASME B16.26; ASME B16.51; ASSE 1061; ASTM F1476;\n™ ASTM F1548; ASTM F3226\n\n—ASDMLELOSO\n™= ASSE 1061; ASTM F877; ASTM F1807; ASTM F1960;\n\n= ASTM F2080; ASTM F2098; ASTM F2159; ASTM F2434;\nASTM F2735; CSA B137.5\n\nASSE 1061; ASTM D3261; ASTM F1807; ASTM F2098;\nASTM F2159; ASTM F2735; ASTM F2769; CSA B137.18\n\nASTM F1476; ASTM F1548; AWWA C110/A21.10;\nAWWA C153/A21.53;\n\nASTM F1281; ASTM F1282; ASTM F1974; CSA B137.9;\nCSA B137.10\n\nASME B16.3\nASTM F1974\n\nASTM D2609; ASTM D2683; ASTM D3261; ASTM F1055;\nCSA BI137.1\n\nASTM F2389; CSA B137.11\n\nASTM D2464; ASTM D2466; ASTM D2467; CSA B137.2;\nCSA B137.3\n\nASTM A312; ASTM A778; ASTM F1476; ASTM F1548;\nASTM F3226\n\nASTM A312; ASTM A778; ASTM F1476; ASTM F1548;\nASTM F3226\n\nASME B16.9; ASME B16.11; ASME B16.28; ASTM F1476;\nASTM F1548\n\n605.10 ABS plastic. Joints between ABS plastic pipe and\nfittings shall comply with Sections 605.10.1 through\n605.10.3.\n\n605.10.1 Mechanical joints. Mechanical joints on water\npipes shall be made with an elastomeric seal conforming\nto ASTM D3139. Mechanical joints shall only be\ninstalled in underground systems, unless otherwise\napproved. Joints shall be installed only in accordance\nwith the manufacturer’s instructions.\n\n605.10.2 Solvent cementing. Joint surfaces shall be clean\nand free from moisture. Solvent cement that conforms to\nASTM D2235 shall be applied to all joint surfaces. The\njoint shall be made while the cement is wet. Joints shall\nbe made in accordance with ASTM D2235. Solvent-\ncement joints shall be permitted above or below ground.\n\n605.10.3 Threaded joints. Threads shall conform to\nASME B1.20.1. Where pipe is to be threaded, the pipe\nshall have a wall thickness of not less than Schedule 80.\nPipe threads shall be made with dies specifically designed\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 64,
        "text": "for plastic pipe. Approved thread lubricant or tape shall be\napplied on the male threads only.\n\n605.11 Gray iron and ductile iron joints. Joints for gray\nand ductile iron pipe and fittings shall comply with AWWA\nC111/A21.11 and shall be installed in accordance with the\nmanufacturer’s instructions.\n\n605.12 Copper pipe. Joints between copper or copper-alloy\npipe and fittings shall comply with Sections 605.12.1\nthrough 605.12.5.\n\n605.12.1 Brazed joints. Joint surfaces shall be cleaned.\nAn approved flux shall be applied where required. The\njoint shall be brazed with a filler metal conforming to\nAWS AS5.8.\n\n605.12.2 Mechanical joints. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n605.12.3 Solder joints. Solder joints shall be made in\naccordance with ASTM B828. Cut tube ends shall be\nreamed to the full inside diameter of the tube end. Joint\nsurfaces shall be cleaned. A flux conforming to ASTM\nB813 shall be applied. The joint shall be soldered with a\nsolder conforming to ASTM B32. The joining of water\nsupply piping shall be made with lead-free solder and\nfluxes. “Lead free” shall mean a chemical composition\nequal to or less than 0.2-percent lead. Solder and flux\njoining pipe or fittings intended to supply drinking water\nshall conform to NSF 61.\n\n605.12.4 Threaded joints. Threads shall conform to\nASME B1.20.1. Pipe-joint compound or tape shall be\napplied on the male threads only.\n\n605.12.5 Welded joints. Joint surfaces shall be cleaned.\nThe joint shall be welded with an approved filler metal.\n\n605.13 Copper tubing. Joints between copper or copper-\nalloy tubing and fittings shall comply with Sections 605.13.1\nthrough 605.13.7.\n\n605.13.1 Brazed joints. Joint surfaces shall be cleaned.\nAn approved flux shall be applied where required. The\njoint shall be brazed with a filler metal conforming to\nAWS A5.8.\n\n605.13.2 Flared joints. Flared joints for water pipe shall\nbe made by a tool designed for that operation.\n\n605.13.3 Grooved and shouldered mechanical joints.\nGrooved and shouldered mechanical joints shall comply\nwith ASTM F1476, shall be made with an approved elas-\ntomeric seal and shall be installed in accordance with the\nmanufacturer’s instructions. Such joints shall be exposed\nor concealed.\n\n605.13.4 Mechanical joints. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n605.13.5 Press-connect joints. Press-connect joints shall\nconform to one of the standards indicated in Table 605.5,\nand shall be installed in accordance with the manufac-\nturer’s instructions. Cut tube ends shall be reamed to the\nfull inside diameter of the tube end. Joint surfaces shall be\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nWATER SUPPLY AND DISTRIBUTION\n\ncleaned. The tube shall be fully inserted into the press-\nconnect fitting. Press-connect joints shall be pressed with\na tool certified by the manufacturer.\n\n605.13.6 Solder joints. Solder joints shall be made in\naccordance with the methods of ASTM B828. Cut tube\nends shall be reamed to the full inside diameter of the\ntube end. Joint surfaces shall be cleaned. A flux conform-\ning to ASTM B813 shall be applied. The joint shall be\nsoldered with a solder conforming to ASTM B32. The\njoining of water supply piping shall be made with /ead-\nfree solder and flux. “Lead free” shall mean a chemical\ncomposition equal to or less than 0.2-percent lead. Solder\nand flux joining pipe or fittings intended to supply drink-\ning water shall conform to NSF 61.\n\n605.13.7 Push-fit fitting joints. Push-fit fittings shall\nconform to ASSE 1061 and shall be installed in accor-\ndance with the manufacturer’s instructions.\n\n605.14 CPVC plastic. Joints between CPVC plastic pipe\nand fittings shall comply with Sections 605.14.1 through\n605.14.4.\n\n605.14.1 Mechanical joints. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n605.14.2 Solvent cementing. Joint surfaces shall be clean\nand free from moisture. Joints shall be made in accor-\ndance with the pipe manufacturer’s installation\ninstructions. Where such instructions require that a primer\nbe used, the primer shall be applied to the joint surfaces\nand a solvent cement orange in color and conforming to\nASTM F493 shall be applied to the joint surfaces. Where\nsuch instructions allow for a one-step solvent cement,\nyellow in color and conforming to ASTM F493, to be\nused, the joint surfaces shall not require application of a\nprimer before the solvent cement is applied. The joint\nshall be made while the cement is wet and in accordance\nwith ASTM D2846 or ASTM F493. Solvent-cement\njoints shall be permitted above or below ground.\n\n605.14.3 Threaded joints. Threads shall conform to\nASME B1.20.1. Where pipe is to be threaded, the pipe\nshall have a wall thickness of not less than Schedule 80.\nPipe threads shall be made with dies specifically designed\nfor plastic pipe. The pressure rating of threaded pipe shall\nbe reduced by 50 percent. Thread-by-socket molded\nfittings shall be permitted. Approved thread lubricant or\ntape shall be applied on the male threads only.\n\n605.14.4 Push-fit joints. Push-fit joints shall conform to\nASSE 1061 and shall be installed in accordance with the\nmanufacturer’s instructions.\n\n605.15 Chlorinated polyvinyl chloride/aluminum/chlori-\nnated polyvinyl chloride (CPVC/AL/CPVC) pipe and\ntubing. Joints between CPVC/AL/CPVC plastic pipe or\nCPVC fittings shall comply with Sections 605.15.1 and\n605.15.2.\n\n605.15.1 Mechanical joints. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n"
    },
    {
        "page": 65,
        "text": "WATER SUPPLY AND DISTRIBUTION\n\n605.15.2 Solvent cementing. Joint surfaces shall be clean\nand free from moisture, and an approved primer shall be\napplied. Solvent cement, orange in color and conforming\nto ASTM F493, shall be applied to joint surfaces. The\njoint shall be made while the cement is wet, and in accor-\ndance with ASTM D2846 or ASTM F493. Solvent\ncement joints shall be permitted above or below ground.\n\nException: A primer is not required where all of the\nfollowing conditions apply:\n\n1. The solvent cement used is third-party certified\nas conforming to ASTM F493.\n\nThe solvent cement used is yellow in color.\n\n3. The solvent cement is used only for joining '/,-\ninch (12.7 mm) through 2-inch-diameter (51\nmm) CPVC/AL/CPVC pipe and CPVC fittings.\n\n4. The CPVC fittings are manufactured in accor-\ndance with ASTM D2846.\n\n605.16 PEX plastic. Joints between cross-linked polyeth-\nylene plastic tubing and fittings shall comply with Sections\n605.16.1 through 605.16.3.\n\n605.16.1 Flared joints. Flared pipe ends shall be made by\na tool designed for that operation.\n\n605.16.2 Mechanical joints. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s instruc-\ntions. Fittings for cross-linked polyethylene (PEX) plastic\ntubing shall comply with the applicable standards listed in\nTable 605.5 and shall be installed in accordance with the\nmanufacturer’s instructions. PEX tubing shall be factory\nmarked with the appropriate standards for the fittings that\nthe PEX manufacturer specifies for use with the tubing.\n\n605.16.3 Push-fit joints. Push-fit joints shall conform to\nASSE 1061 and shall be installed in accordance with the\nmanufacturer’s instructions.\n\n605.17 Steel. Joints between galvanized steel pipe and\nfittings shall comply with Sections 605.17.1 through\n605.17.3.\n\n605.17.1 Threaded joints. Threads shall conform to\nASME B1.20.1. Pipe-joint compound or tape shall be\napplied on the male threads only.\n\n605.17.2 Mechanical joints. Joints shall be made with an\napproved elastomeric seal. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n605.17.3 Grooved and shouldered mechanical joints.\nGrooved and shouldered mechanical joints shall comply\nwith ASTM F1476, shall be made with an approved elas-\ntomeric seal and shall be installed in accordance with the\nmanufacturer’s instructions. Such joints shall be exposed\nor concealed.\n\n605.18 PE plastic. Joints between polyethylene plastic pipe\nor tubing and fittings shall comply with Sections 605.18.1\nthrough 605.18.4.\n\n605.18.1 Flared joints. Flared joints shall be permitted\nwhere so indicated by the pipe manufacturer. Flared joints\nshall be made by a tool designed for that operation.\n\n605.18.2 Heat-fusion joints. Joint surfaces shall be clean\nand free from moisture. Joint surfaces shall be heated to\nmelt temperature and joined. The joint shall be undis-\nturbed until cool. Joints shall be made in accordance with\nASTM D2657.\n\n605.18.3 Mechanical joints. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n605.18.4 Installation. Polyethylene pipe shall be cut\nsquare, with a cutter designed for plastic pipe. Except\nwhere joined by heat fusion, pipe ends shall be chamfered\nto remove sharp edges. Kinked pipe shall not be installed.\nThe minimum pipe bending radius shall be not less than\n30 pipe diameters, or the minimum coil radius, whichever\nis greater. Piping shall not be bent beyond straightening\nof the curvature of the coil. Bends shall be prohibited\nwithin 10 pipe diameters of any fitting or valve. Stiffener\ninserts installed with compression-type couplings and\nfittings shall not extend beyond the clamp or nut of the\ncoupling or fitting.\n\n605.19 Polypropylene (PP) plastic. Joints between PP plas-\n\ntic pipe and fittings shall comply with Section 605.19.1 or\n605.19.2.\n\n605.19.1 Heat-fusion joints. Heat-fusion joints for poly-\npropylene pipe and tubing joints shall be installed with\nsocket-type heat-fused polypropylene fittings, butt-fusion\npolypropylene fittings or electrofusion polypropylene\nfittings. Joint surfaces shall be clean and free from mois-\nture. The joint shall be undisturbed until cool. Joints shall\nbe made in accordance with ASTM F2389.\n\n605.19.2 Mechanical and compression sleeve joints.\nMechanical and compression sleeve joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n605.20 Polyethylene/aluminum/polyethylene (PE-AL-PE)\nand cross-linked _ polyethylene/aluminum/cross-linked\npolyethylene (PEX-AL-PEX). Joints between PE-AL-PE\nor PEX-AL-PEX pipe and fittings shall comply with Section\n605.20.1.\n\n605.20.1 Mechanical joints. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s instruc-\ntions. Fittings for PE-AL-PE and PEX-AL-PEX as\ndescribed in ASTM F1281, ASTM F1282, ASTM F1974,\nCSA B137.9 and CSA B137.10 shall be installed in\naccordance with the manufacturer’s instructions.\n\n605.21 PVC plastic. Joints between PVC plastic pipe and\nfittings shall comply with Sections 605.21.1 through\n605.21.3.\n\n605.21.1 Mechanical joints. Mechanical joints on water\npipe shall be made with an elastomeric seal conforming to\nASTM D3139. Mechanical joints shall not be installed in\nabove-ground systems unless otherwise approved. Joints\nshall be installed in accordance with the manufacturer’s\ninstructions.\n\n605.21.2 Grooved and shouldered mechanical joints.\nGrooved and shouldered mechanical joints shall comply\nwith ASTM F1476, shall be made with an approved elas-\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 66,
        "text": "tomeric seal and shall be installed in accordance with the\nmanufacturer’s instructions. Such joints shall be exposed\nor concealed.\n\n605.21.3 Solvent cementing. Joint surfaces shall be clean\nand free from moisture. A purple primer that conforms to\nASTM F656 shall be applied. Solvent cement not purple\nin color and conforming to ASTM D2564 or CSA B137.3\nshall be applied to all joint surfaces. The joint shall be\nmade while the cement is wet and shall be in accordance\nwith ASTM D2855. Solvent-cement joints shall be\npermitted above or below ground.\n\n605.21.4 Threaded joints. Threads shall conform to\nASME B1.20.1. Where pipe is to be threaded, the pipe\nshall have a wall thickness of not less than Schedule 80.\nPipe threads shall be made with dies specifically designed\nfor plastic pipe. The pressure rating of threaded pipe shall\nbe reduced by 50 percent. Thread-by-socket molded\nfittings shall be permitted. Approved thread lubricant or\ntape shall be applied on the male threads only.\n\n605.22 Stainless steel. Joints between stainless steel pipe\nand fittings shall comply with Sections 605.22.1 through\n605.22.3.\n\n605.22.1 Mechanical joints. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n605.22.2 Welded joints. Joint surfaces shall be cleaned.\nThe joint shall be welded autogenously or with an\napproved filler metal as referenced in ASTM A312.\n\n605.22.3 Grooved and shouldered mechanical joints.\nGrooved and shouldered mechanical joints shall comply\nwith ASTM F1476, shall be made with an approved elas-\ntomeric seal and shall be installed in accordance with the\nmanufacturer’s instructions. Such joints shall be exposed\nor concealed.\n\n605.23 Joints between different materials. Joints between\ndifferent piping materials shall be made with a mechanical\njoint of the compression or mechanical-sealing type, or shall\nbe made in accordance with Section 605.23.1, 605.23.2 or\n605.23.3. Connectors or adapters shall have an elastomeric\nseal conforming to ASTM F477. Joints shall be installed in\naccordance with the manufacturer’s instructions.\n\n605.23.1 Copper or copper-alloy tubing to galvanized\nsteel pipe. Joints between copper pipe or tubing and\ngalvanized steel pipe shall be made with a copper-alloy or\ndielectric fitting or a dielectric union conforming to\nASSE 1079. The copper tubing shall be soldered to the\nfitting in an approved manner, and the fitting shall be\nscrewed to the threaded pipe\n\n605.23.2 Plastic pipe or tubing to other piping mate-\nrial. Joints between different types of plastic pipe or\nbetween plastic pipe and other piping material shall be\nmade with approved adapters or transition fittings.\n\n605.23.3 Stainless steel. Joints between stainless steel\nand different piping materials shall be made with a\nmechanical joint of the compression or mechanical seal-\ning type or a dielectric fitting or a dielectric union\nconforming to ASSE 1079.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nWATER SUPPLY AND DISTRIBUTION\n\n605.24 PE-RT plastic. Joints between polyethylene of\nraised temperature plastic tubing and fittings shall be in\naccordance with Section 605.24.1.\n\n605.24.1 Mechanical joints. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s instruc-\ntions. Fittings for polyethylene of raised temperature\nplastic tubing shall comply with the applicable standards\nindicated in Table 605.5 and shall be installed in accor-\ndance with the manufacturer’s instructions. Polyethylene\nof raised temperature plastic tubing shall be factory\nmarked with the applicable standards for the fittings that\nthe manufacturer of the tubing specifies for use with the\ntubing.\n\nSECTION 606\nINSTALLATION OF THE\nBUILDING WATER DISTRIBUTION SYSTEM\n\n606.1 Location of full-open valves. Full-open valves shall\nbe installed in the following locations:\n\n1. On the building water service pipe from the public\nwater supply near the curb.\n\n2. On the water distribution supply pipe at the entrance\ninto the structure.\n\n2.1. In multiple-tenant buildings, where a\ncommon water supply piping system is\ninstalled to supply other than one- and two-\nfamily dwellings, a main shutoff valve shall\nbe provided for each tenant.\n\n3. On the discharge side of every water meter.\n\nOn the base of every water riser pipe in occupancies\nother than multiple-family residential occupancies\nthat are two stories or less in height and in one- and\ntwo-family residential occupancies.\n\n5. On the top of every water down-feed pipe in occu-\npancies other than one- and two-family residential\noccupancies.\n\n6. On the entrance to every water supply pipe to a\ndwelling unit, except where supplying a single\nfixture equipped with individual stops.\n\n7. On the water supply pipe to a gravity or pressurized\nwater tank.\n\n8. On the water supply pipe to every water heater.\n\n606.2 Location of shutoff valves. Shutoff valves shall be\ninstalled in the following locations:\n\n1. On the fixture supply to each plumbing fixture other\nthan bathtubs and showers in one- and two-family\nresidential occupancies, and other than in individual\nsleeping units that are provided with unit shutoff\nvalves in hotels, motels, boarding houses and similar\noccupancies.\n\n2. On the water supply pipe to each sillcock.\n\nOn the water supply pipe to each appliance or\nmechanical equipment.\n\n6-9\n"
    },
    {
        "page": 67,
        "text": "WATER SUPPLY AND DISTRIBUTION\n\n606.3 Access to valves. Access shall be provided to all full-\nopen valves and shutoff valves.\n\n606.4 Valve identification. Service and hose bibb valves\nshall be identified. Other valves installed in locations that are\nnot adjacent to the fixture or appliance shall be identified,\nindicating the fixture or appliance served.\n\n606.5 Water pressure booster systems. Water pressure\nbooster systems shall be provided as required by Sections\n606.5.1 through 606.5.10.\n\n606.5.1 Water pressure booster systems required.\nWhere the water pressure in the public water main or\nindividual water supply system is insufficient to supply\nthe minimum pressures and quantities specified in this\ncode, the supply shall be supplemented by an elevated\nwater tank, a hydropneumatic pressure booster system or\na water pressure booster pump installed in accordance\nwith Section 606.5.5.\n\n606.5.2 Support. Water supply tanks shall be supported\nin accordance with the /nternational Building Code.\n\n606.5.3 Covers. Water supply tanks shall be covered to\neep out unauthorized persons, dirt and vermin. The\ncovers of gravity tanks shall be vented with a return bend\nvent pipe with an area not less than the area of the down-\need riser pipe, and the vent shall be screened with a\ncorrosion-resistant screen of not less than 16 by 20 mesh\nper inch (630 by 787 mesh per m).\n\n606.5.4 Overflows for water supply tanks. A gravity or\nsuction water supply tank shall be provided with an over-\nflow with a diameter not less than that shown in Table\n606.5.4. The overflow outlet shall discharge at a point not\nless than 6 inches (152 mm) above the roof or roof drain;\nfloor or floor drain; or over an open water-supplied\nfixture. The overflow outlet shall be covered with a corro-\nsion-resistant screen of not less than 16 by 20 mesh per\ninch (630 by 787 mesh per m) and by '/,-inch (6.4 mm)\nardware cloth or shall terminate in a horizontal angle\nseat check valve. Drainage from overflow pipes shall be\ndirected so as not to freeze on roof walks.\n\nTABLE 606.5.4\nSIZES FOR OVERFLOW PIPES FOR WATER SUPPLY TANKS\n\nMAXIMUM|CAPACITY. OF OVERFLOW PIPE\nSUPPLY (inches)\n\n0-50\n\n50 — 150 2\n\n150 — 200 3\n\n200 — 400 4\n\n400 — 700 5\n\n700 — 1,000 6\n\nOver 1,000 8\n\nFor SI: 1 inch = 25.4 mm, | gallon per minute = 3.785 L/m.\n\n606.5.5 Low-pressure cutoff required on booster\npumps. A low-pressure cutoff shall be installed on all\nbooster pumps in a water pressure booster system to\nprevent creation of a vacuum or negative pressure on the\n\n6-10\n\nsuction side of the pump when a positive pressure of 10 psi\n(68.94 kPa) or less occurs on the suction side of the pump.\n\n606.5.6 Potable water inlet control and location. Pota-\nble water inlets to gravity tanks shall be controlled by a\nfill valve or other automatic supply valve installed so as\nto prevent the tank from overflowing. The inlet shall be\nterminated so as to provide an air gap not less than 4\ninches (102 mm) above the overflow.\n\n606.5.7 Tank drain pipes. A drain pipe with a valve\nshall be provided at the lowest point of each tank to\npermit emptying of the tank. The tank drain pipe shall\ndischarge as required for overflow pipes and shall not be\nsmaller in size than specified in Table 606.5.7.\n\nTABLE 606.5.7\nSIZE OF DRAIN PIPES FOR WATER TANKS\n\nTANK CAPACITY (galfons: inches)\nUp to 750 1\n95410 1,500 7,\n1,501 to 3,000 2\n3,001 to 5,000 2\",\n5,000 to 7,500\nOver 7,500 4\n\nFor SI: 1 inch = 25.4 mm, | gallon = 3.785 L.\n\n606.5.8 Prohibited location of potable supply tanks.\nPotable water gravity tanks or manholes of potable water\npressure tanks shall not be located directly under any soil\nor waste piping or any source of contamination.\n\n606.5.9 Pressure tanks, vacuum relief. Water pressure\ntanks shall be provided with a vacuum relief valve at the\ntop of the tank that will operate up to a maximum water\npressure of 200 psi (1380 kPa) and up to a maximum\ntemperature of 200°F (93°C). The size of such vacuum\nrelief valve shall be not less than '/, inch (12.7 mm).\n\nException: This section shall not apply to pressurized\ncaptive air diaphragm/bladder tanks.\n\n606.5.10 Pressure relief for tanks. Every pressure tank\nin a hydropneumatic pressure booster system shall be\nprotected with a pressure relief valve. The pressure relief\nvalve shall be set at a maximum pressure equal to the\nrating of the tank. The relief valve shall be installed on the\nsupply pipe to the tank or on the tank. The relief valve\nshall discharge by gravity to a safe place of disposal.\n\n606.6 Water supply system test. Upon completion of a\nsection of or the entire water supply system, the system, or\nportion completed, shall be tested in accordance with\nSection 312.\n\nSECTION 607\nHOT WATER SUPPLY SYSTEM\n\n607.1 Where required. In residential occupancies, hot\nwater shall be supplied to plumbing fixtures and equipment\nutilized for bathing, washing, culinary purposes, cleansing,\nlaundry or building maintenance. In nonresidential occupan-\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 68,
        "text": "cies, hot water shall be supplied for culinary purposes,\ncleansing, laundry or building maintenance purposes. In\nnonresidential occupancies, hot water or tempered water\nshall be supplied for bathing and washing purposes.\n\n607.1.1 Temperature limiting means. A thermostat\ncontrol for a water heater shall only serve as the tempera-\nture limiting means for the purposes of complying with\nthe requirements of this code for maximum allowable hot\nor tempered water delivery temperature at fixtures where\nthe water heater complies with ASSE 1082 or ASSE\n1085.\n\n607.1.2 Tempered water temperature control.\nTempered water shall be controlled by one the following:\n\n1. A limiting device conforming to ASSE\n1070/ASME A112.1070/CSA B125.70 and set to\nnot greater than 110°F (43°C).\n\n2. A thermostatic mixing valve conforming to ASSE\n1017.\n\n3. A water heater conforming to ASSE 1082.\n4. A water heater conforming to ASSE 1084.\n\nThis provision shall not supersede the requirement for\nprotective shower valves in accordance with Section\n412.3.\n\n607.2 Hot or tempered water supply to fixtures. The\ndeveloped length of hot or tempered water piping, from the\nsource of hot water to the fixtures that require fot or\ntempered water, shall not exceed 50 feet (15 240 mm).\nRecirculating system piping and heat-traced piping shall be\nconsidered to be sources of hot or tempered water.\n\n607.2.1 Circulation systems and heat trace systems for\nmaintaining heated water temperature in distribution\nsystems. For Group R2, R3 and R4 occupancies that are\nthree stories or less in height above grade plane, the\ninstallation of heated water circulation and temperature\nmaintenance systems shall be in accordance with Section\nR403.5.1 of the /nternational Energy Conservation Code.\nFor other than Group R2, R3 and R4 occupancies that are\nthree stories or less in height above grade plane, the\ninstallation of heated water circulation and heat trace\nsystems shall be in accordance with Section C404.6 of the\nInternational Energy Conservation Code.\n\n607.2.1.1 Pump controls for hot water storage\nsystems. The controls on pumps that circulate water\nbetween a water heater and a storage tank for heated\nwater shall limit operation of the pump from heating\ncycle startup to not greater than 5 minutes after the end\nof the cycle.\n\n607.2.1.2 Demand recirculation controls for distri-\nbution systems. A water distribution system having\none or more recirculation pumps that pump water from\na heated water supply pipe back to the heated water\nsource through a cold water supply pipe shall be a\ndemand recirculation water system. Pumps shall have\ncontrols that comply with both of the following:\n\n1. The control shall start the pump upon receiving\na signal from the action of a user of a fixture or\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nWATER SUPPLY AND DISTRIBUTION\n\nappliance, sensing the presence of a user of a\nfixture, or sensing the flow of hot or tempered\nwater to a fixture fitting or appliance.\n\n2. The control shall limit the temperature of the\nwater entering the cold water piping to 104°F\n(40°C).\n607.2.2 Piping for recirculation systems having\ntemperature-actuated mixing valves. Where a tempera-\nture-actuated mixing valve is used in a system with a hot\nwater recirculating pump, the hot water or tempered\nwater return line shall be routed to the cold water inlet\npipe of the water heater and the cold water inlet pipe or\nthe hot water return connection of the temperature-actu-\nated mixing valve.\n\n607.3 Thermal expansion control. Where a storage water\nheater is supplied with cold water that passes through a\ncheck valve, pressure reducing valve or backflow preventer,\na thermal expansion control device shall be connected to the\nwater heater cold water supply pipe at a point that is down-\nstream of all check valves, pressure reducing valves and\nbackflow preventers. Thermal expansion tanks shall be sized\nin accordance with the tank manufacturer’s instructions and\nshall be sized such that the pressure in the water distribution\nsystem shall not exceed that required by Section 604.8.\n\n607.4 Flow of hot water to fixtures. Fixture fittings, faucets\nand diverters shall be installed and adjusted so that the flow\nof hot water from the fittings corresponds to the left-hand\nside of the fixture fitting.\n\nException: Shower and tub/shower mixing valves\nconforming to ASSE 1016/ASME A112.1016/CSA\nB125.16 or ASME A112.18.1/CSA B125.1, where the\nflow of hot water corresponds to the markings on the\ndevice.\n\n[E] 607.5 Insulation of piping. For other than Group R2, R3\nand R4 occupancies that are three stories or less in height\nabove grade plane, piping to the inlet of a water heater and\npiping conveying water heated by a water heater shall be\ninsulated in accordance with Section C404.4 of the Interna-\ntional Energy Conservation Code. For Group R2, R3 and R4\noccupancies that are three stories or less in height above\ngrade plane, piping to the inlet of a water heater and piping\nconveying water heated by a water heater shall be insulated\nin accordance with Section R403.5.3 of the Jnternational\nEnergy Conservation Code.\n\nSECTION 608\nPROTECTION OF POTABLE WATER SUPPLY\n\n608.1 General. A potable water supply system shall be\ndesigned, installed and maintained in such a manner so as to\nprevent contamination from nonpotable liquids, solids or\ngases being introduced into the potable water supply through\ncross connections or any other piping connections to the\nsystem. Backflow preventer applications shall conform to\nTable 608.1, except as specifically stated in Sections 608.2\nthrough 608.17.10.\n\n6-11\n"
    },
    {
        "page": 69,
        "text": "WATER SUPPLY AND DISTRIBUTION\n\nDEGREE OF HAZARD?\n\nTABLE 608.1\nAPPLICATION OF BACKFLOW PREVENTERS\n\nAPPLICA’\n\nEE ———\n\nDouble check backflow prevention assembly\n\nand double check fire protection backflow Low hazard\n\n_ prevention assembly =\n\nBackpressure or backsiphonage l ASSE 1015; AWWA C510;\nSizes °/,\"-16\" = CSA B64.5; CSA B64.5.1\n\nDouble check detector fire protection backflow T wir\nSS 5 “ ASSE 1048\nSizes 2” ee ——_—\n\nprevention assemblies\n\nPresse vac ruin breakCRagsemrary ———\n\nTON Size 7, 2 ASSE 1OZ0TCSA BOTT\n\nReduced pressure principle backflow\n\nprevention assembly and reduced\n\npressure principle fire protection backflow\n” assembly\n\nsHigh or low hazard\n\n@Backpressure or backsiphonage 1 ASSE 1013; AWWA C511; |\nmSizes */,\"-16\" 1 CSA B64.4; CSA B64.4.1\n\n_ Reduced pressure detector fire protection back-\nI | flow prevention assemblies\n\n—\n\nBackflow preventer plumbing devices:\n\nAntisiphon-type fill valves for gravity water\ncloset flush tanks\n\nBackflow preventer for carbonated beverage\nmachines\n\nBackflow preventer with intermediate\natmospheric vents\n\nBackflow preventer with intermediate\natmospheric vent and pressure-reducing valve.\n\nDual-check-valve-type backflow preventer\n\nHose connection backflow preventer\n\nHose connection vacuum breaker\n\nLaboratory faucet backflow preventer\n\nPipe-applied atmospheric-type vacuum breaker\nVacuum breaker wall hydrants, frost-\n\nresistant, automatic-draining-type\n\nOther means or methods:\n\nAir gap\n\nAir gap fittings for use with plumbing fixtures,\nappliances and appurtenances\n\nBarometric loop\n\nFor SI: 1 inch = 25.4 mm,\n\na. Low hazard—See Pollution (Section 202).\nHigh hazard—See Contamination (Section 202).\n\nb. See Backpressure, low head (Section 202, Backflow).\nSee Backsiphonage (Section 202, Backflow).\n\n6-12\n\nHigh or low hazard\n\n————\nHigh or low hazard\n\nHigh hazard\n\nLow hazard\n\nLow hazard\n\nLow hazard\n\nLow hazard\n\nHigh or\n\nHigh or\n\nHigh or\nHigh or\n\nHigh or\n\nHigh or\nHigh or\n\nHigh or\n\nlow hazar\n\now hazar\n\now hazar\now hazard\n\now hazar\n\now hazar\n\now hazar\n\nlow hazar\n\n= Backsiphonage or backpressure\n(automatic sprinkler systems)\n\n\" ASSE 1047\n\nBacksiphonage only Sizes ‘7,\"—-2”ASSE 1056; CSA B64.1.3\n\nASSE 1002/ASME\n\nBacksiphonage only A112.1002/CSA B125.12;\nCSA B125.3\n\nBackpressure or backsiphonage ASSE 1022\n\nSizes '/,\"—/,\"\n\nBackpressure or backsiphonage ASSE 1012: CSA B643\n\nSizes '/,\"/,\" 7 .\n\nBackpressure or backsiphonage ASSE 1081\n\nSizes '/,\"—*/,\"\n\nBackpressure or backsiphonage\n\nSizes '/,\"-1\"\n\nLow head backpressure, rated\nworking pressure, backpressure or\nbacksiphonage Sizes '/;\"-1”\n\nLow head backpressure or\n\nbac!\n\nLow head backpressure and\n\nASSE 1024; CSA B64.6\n\nASME A112.21.3;\nASSE 1052; CSA B64.2.1.1\n\nASME A112.21.3;\nASSE 1011; CSA B64.2;\n\nksi se Sizes 1\" 3/\"\nsiphonage Sizes '/,\", */, CSA B64.2.1\n\nASSE 1035; CSA B64.7\n\nbacksiphonage\n\nBacksiphonage only Sizes '/,\"-4\" ASSE 1001; CSA B64.1.1\nLow head backpressure or ASME A112.21.3;\nbacksiphonage Sizes */,”, 1” ASSE 1019; CSA B64.2.2\nBacksiphonage or backpressure ASME A112.1.2\nBacksiphonage or backpressure ASME A112.1.3\nBacksiphonage only (See Section 608.14.4)\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 70,
        "text": "608.2 Plumbing fixtures. The supply lines and fittings for\nplumbing fixtures shall be installed so as to prevent back-\nflow. Plumbing fixture fittings shall provide backflow\nprotection in accordance with ASME A112.18.1/CSA\nB125.1.\n\n608.3 Devices, appurtenances, appliances and apparatus.\nDevices, appurtenances, appliances and apparatus intended\nto serve some special function, such as sterilization, distilla-\ntion, processing, cooling, or storage of ice or foods, and that\nconnect to the water supply system, shall be provided with\nprotection against backflow and contamination of the water\nsupply system.\n\n608.3.1 Special equipment, water supply protection.\nThe water supply for hospital fixtures shall be protected\nagainst backflow with a reduced pressure principle back-\nflow prevention assembly, an atmospheric or spill-\nresistant vacuum breaker assembly, or an air gap.\nVacuum breakers for bedpan washer hoses shall not be\nlocated less than 5 feet (1524 mm) above the floor.\nVacuum breakers for hose connections in health care or\nlaboratory areas shall be not less than 6 feet (1829 mm)\nabove the floor.\n\n608.4 Potable water handling and treatment equipment.\nWater pumps, filters, softeners, tanks and other appliances\nand devices that handle or treat potable water to be supplied\nto the potable water distribution system shall be located to\nprevent contamination from entering the appliances and\ndevices. Overflow, relief valve and waste discharge pipes\nfrom such appliances and devices shall terminate through an\nair gap.\n\n608.5 Water service piping. Water service piping shall be\nprotected in accordance with Sections 603.2 and 603.2.1.\n\n608.6 Chemicals and other substances. Chemicals and\nother substances that produce either toxic conditions, taste,\nodor or discoloration in a potable water system shall not be\nintroduced into, or utilized in, such systems.\n\n608.7 Cross connection control. Cross connections shall be\nprohibited, except where approved backflow prevention\nassemblies, backflow prevention devices or other means or\nmethods are installed to protect the potable water supply.\n\n608.7.1 Private water supplies. Cross connections\nbetween a private water supply and a potable public\nsupply shall be prohibited.\n\n608.8 Valves and outlets prohibited below grade. Potable\nwater outlets and combination stop-and-waste valves shall\nnot be installed underground or below grade. A freezeproof\nyard hydrant that drains the riser into the ground shall be\nconsidered as having a stop-and-waste valve below grade.\n\nException: Freezeproof yard hydrants that drain the riser\ninto the ground shall be permitted to be installed,\nprovided that the potable water supply to such hydrants is\nprotected in accordance with Section 608.14.2 or\n608.14.5, and the hydrants and the piping from the back-\nflow preventer to the hydrant are identified in accordance\nwith Section 608.9.\n\n608.9 Identification of nonpotable water systems. Where\nnonpotable water systems are installed, the piping conveying\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nWATER SUPPLY AND DISTRIBUTION\n\nthe nonpotable water shall be identified either by color mark-\ning, metal tags or tape in accordance with Sections 608.9.1\nthrough 608.9.2.3.\n\n608.9.1 Signage required. Nonpotable water outlets,\nsuch as hose connections, open-ended pipes and faucets,\nshall be identified with signage that reads as follows:\n“Nonpotable water is utilized for [application name].\nCAUTION: NONPOTABLE WATER - DO NOT\nDRINK.” The words shall be legibly and indelibly printed\non a tag or sign constructed of corrosion-resistant water-\nproof material or shall be indelibly printed on the fixture.\nThe letters of the words shall be not less than 0.5 inch\n(12.7 mm) in height and in colors in contrast to the back-\nground on which they are applied. In addition to the\nrequired wordage, the pictograph shown in Figure 608.9. 1\nshall appear on the required signage.\n\nFIGURE 608.9.1\nPICTOGRAPH—DO NOT DRINK\n\n608.9.2 Distribution pipe labeling and marking. Non-\npotable distribution piping shall be purple in color and\nshall be embossed, or integrally stamped or marked, with\nthe words: “CAUTION: NONPOTABLE WATER — DO\nNOT DRINK” or the piping shall be installed with a\npurple identification tape or wrap. Pipe identification\nshall include the contents of the piping system and an\narrow indicating the direction of flow. Hazardous piping\nsystems shall also contain information addressing the\nnature of the hazard. Pipe identification shall be repeated\nat intervals not exceeding 25 feet (7620 mm) and at each\npoint where the piping passes through a wall, floor or\nroof. Lettering shall be readily observable within the\nroom or space where the piping is located.\n\n608.9.2.1 Color. The color of the pipe identification\nshall be discernable and consistent throughout the\nbuilding. The color purple shall be used to identify\nreclaimed, rain and graywater distribution systems.\n\n608.9.2.2 Lettering size. The size of the background\ncolor field and lettering shall comply with Table\n608.9.2.2.\n\n6-13\n"
    },
    {
        "page": 71,
        "text": "WATER SUPPLY AND DISTRIBUTION\n\nTABLE 608.9.2.2\nSIZE OF PIPE IDENTIFICATION\n\nT\nLar-yy-} =p ™ LENGTH BACKGROUND “a5, wl\nPIPE DIAMETER Z COLOR FIELD SIZE OF LETTERS\n\n(inches) (inches) a (inches) 4\n\n7, to 1'/, 0.5\n1'/, to2 8 0.75\n2'/, to 6 12 1.25\n8 to 10 24 2.5\nover 10 32 3.5\n\nFor SI: 1 inch =25.4mm.\n\n608.9.2.3 Identification tape. Where used, identifica-\ntion tape shall be not less than 3 inches (76 mm) wide\nand have white or black lettering on a purple field stat-\ning “CAUTION: NONPOTABLE WATER - DO\nNOT DRINK.” Identification tape shall be installed on\ntop of nonpotable rainwater distribution pipes,\nfastened not less than every 10 feet (3048 mm) to each\npipe length and run continuously the entire length of\nthe pipe.\n608.10 Reutilization prohibited. Water utilized for the\nheating or cooling of equipment or other processes shall not\nbe returned to the potable water system. Such water shall be\ndischarged into a drainage system through an air gap or shall\nbe utilized for nonpotable purposes.\n\n608.11 Reuse of piping. Piping that has been utilized for any\npurpose other than conveying potable water shall not be\nutilized for conveying potable water.\n\n608.12 Potable water tanks. Where in contact with potable\nwater intended for drinking water, water tanks, coatings for\nthe inside of tanks and liners for water tanks shall conform to\nNSF 61. The interior surface of a potable water tank shall not\nbe lined, painted or repaired with any material that changes\nthe taste, odor, color or potability of the water supply when\nthe tank is placed in, or returned to, service.\n\n608.13 Pumps and other appliances. Water pumps, filters,\nsofteners, tanks and other devices that handle or treat potable\nwater shall be protected against contamination.\n\n608.14 Backflow protection. Means of protection against\nbackflow shall be provided in accordance with Sections\n609.14.1 through 608.14.9.\n\n608.14.1 Air gap. The minimum required air gap shall be\nmeasured vertically from the lowest end of a potable\nwater outlet to the flood level rim of the fixture or recepta-\ncle into which such potable water outlet discharges. Air\ngaps shall comply with ASME A112.1.2 and air gap\nfittings shall comply with ASME A112.1.3. Products that\nare listed and labeled to ASME A112.1.2 or ASME\nA112.1.3 shall be considered to be in compliance with\nthis section.\n\n608.14.2 Reduced pressure principle backflow preven-\ntion assemblies. Reduced pressure principle backflow\nprevention assemblies shall conform to ASSE 1013,\nAWWA C511, CSA B64.4 or CSA B64.4.1. Reduced\npressure detector assembly backflow preventers shall\nconform to ASSE 1047. These devices shall be permitted\n\n6-14\n\nto be installed where subject to continuous pressure\nconditions. The relief opening shall discharge by air gap\nand shall be prevented from being submerged.\n\n608.14.3 Backflow preventer with intermediate atmo-\nspheric vent. Backflow preventers with intermediate\natmospheric vents shall conform to ASSE 1012, ASSE\n1081 or CSA B64.3. These devices shall be permitted to\nbe installed where subject to continuous pressure condi-\ntions. The relief opening shall discharge by air gap and\nshall be prevented from being submerged.\n\n608.14.4 Barometric loop. Barometric loops shall\nprecede the point of connection and shall extend verti-\ncally to a height of 35 feet (10 668 mm). A barometric\nloop shall only be utilized as an atmospheric-type or pres-\nsure-type vacuum breaker.\n\n608.14.5 Pressure vacuum breaker assemblies. Pres-\nsure vacuum breaker assemblies shall comply with ASSE\n1020 or CSA B64.1.2. Spill-resistant vacuum breaker\nassemblies shall comply with ASSE 1056 or CSA\nB64.1.3. These assemblies shall be installed with the crit-\nical level of the assembly located not less than 12 inches\n(305 mm) above all downstream piping and outlets. Pres-\nsure vacuum breaker assemblies shall not be installed in\nlocations where spillage could cause damage to the\nstructure.\n\n608.14.6 Atmospheric-type vacuum breakers. Pipe-\napplied atmospheric-type vacuum breakers shall conform\nto ASSE 1001 or CSA B64.1.1. Hose-connection vacuum\nbreakers shall conform to ASME A112.21.3, ASSE 1011,\nASSE 1019, ASSE 1035, ASSE 1052, CSA B64.2, CSA\nB64.2.1, CSA B64.2.1.1, CSA B64.2.2 or CSA B64.7.\nThese devices shall operate under normal atmospheric\npressure when the critical level is installed at the required\nheight.\n\n608.14.7 Double check backflow prevention assem-\nblies. Double check backflow prevention assemblies shall\nconform to ASSE 1015, CSA B64.5, CSA B64.5.1 or\nAWWA C510. Double check detector fire protection\nbackflow prevention assemblies shall conform to ASSE\n1048. These assemblies shall be capable of operating\nunder continuous pressure conditions.\n\n608.14.8 Chemical dispenser backflow devices. Back-\nflow devices for chemical dispensers shall comply with\nASSE 1055 or shall be equipped with an air gap fitting.\n\n608.14.9 Dual check backflow preventer. Dual check\nbackflow preventers shall conform to ASSE 1024 or CSA\nB64.6.\n\n608.15 Location of backflow preventers. Access shall be\nprovided to backflow preventers as specified by the manu-\nfacturer’s instructions.\n\n608.15.1 Outdoor enclosures for backflow prevention\ndevices. Outdoor enclosures for backflow prevention\ndevices shall comply with ASSE 1060.\n\n608.15.2 Protection of backflow preventers. Backflow\npreventers shall not be located in areas subject to freezing\nexcept where they can be removed by means of unions or\nare protected from freezing by heat, insulation or both.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 72,
        "text": "608.15.2.1 Relief port piping. The termination of the\npiping from the relief port or air gap fitting of a back-\nflow preventer shall discharge to an approved indirect\nwaste receptor or to the outdoors where it will not\ncause damage or create a nuisance. The indirect waste\nreceptor and drainage piping shall be sized to drain the\nmaximum discharge flow rate from the relief port as\npublished by the backflow preventer manufacturer.\n\n608.16 Protection of potable water outlets. Potable water\nopenings and outlets shall be protected against backflow in\naccordance with Section 608.16.1, 608.16.2, 608.16.3,\n608.16.4, 608.16.4.1 or 608. 16.4.2.\n\n608.16.1 Protection by air gap. Openings and outlets\nshall be protected by an air gap between the opening and\nthe fixture flood level rim as specified in Table 608.16.1.\nOpenings and outlets equipped for hose connection shall\nbe protected by means other than an air gap.\n\n608.16.2 Protection by reduced pressure principle\nbackflow prevention assembly. Openings and outlets\nshall be protected by a reduced pressure principle back-\nflow prevention assembly or a reduced pressure principle\nfire protection backflow prevention assembly on potable\nwater supplies.\n\n608.16.3 Protection by a backflow preventer with\nintermediate atmospheric vent. Openings and outlets\nshall be protected by a backflow preventer with an inter-\nmediate atmospheric vent.\n\n608.16.4 Protection by a vacuum breaker. Openings\nand outlets shall be protected by atmospheric-type or\npressure-type vacuum breakers. The critical level of the\nvacuum breaker shall be set not less than 6 inches (152\nmm) above the flood level rim of the fixture or device. Fill\nvalves shall be set in accordance with Section 415.3.1.\nVacuum breakers shall not be installed under exhaust\nhoods or similar locations that will contain toxic fumes or\nvapors. Pipe-applied vacuum breakers shall be installed\nnot less than 6 inches (152 mm) above the flood level rim\nof the fixture, receptor or device served.\n\nWATER SUPPLY AND DISTRIBUTION\n\n608.16.4.1 Deck-mounted and integral vacuum\nbreakers. Approved deck-mounted or equipment-\nmounted vacuum breakers and faucets with integral\natmospheric vacuum breakers or _ spill-resistant\nvacuum breaker assemblies shall be installed in accor-\ndance with the manufacturer’s instructions and the\nrequirements for labeling with the critical level not less\nthan 1 inch (25 mm) above the flood level rim.\n\n608.16.4.2 Hose connections. Sillcocks, hose bibbs,\nwall hydrants and other openings with a hose connec-\ntion shall be protected by an atmospheric-type or\npressure-type vacuum breaker or a_ permanently\nattached hose connection vacuum breaker.\n\nExceptions:\n\n1. This section shall not apply to water heater\nand boiler drain valves that are provided\nwith hose connection threads and that are\nintended only for tank or vessel draining.\n\n2. This section shall not apply to water supply\nvalves intended for connection of clothes\nwashing machines where backflow preven-\ntion is otherwise provided or is integral with\nthe machine.\n\n608.17 Connections to the potable water system. Connec-\ntions to the potable water system shall conform to Sections\n608.17.1 through 608.17.10.\n\n608.17.1 Beverage dispensers. The water supply connec-\ntion to beverage dispensers shall be protected against\nbackflow in accordance with Sections 608.17.1.1 and\n608.17.1.2.\n\n608.17.1.1 Carbonated beverage dispensers. The\nwater supply connection to each carbonated beverage\ndispenser shall be protected against backflow by a\nbackflow preventer conforming to ASSE 1022 or by\nan air gap. The portion of the backflow preventer\ndevice downstream from the second check valve of the\ndevice and the piping downstream therefrom shall not\nbe affected by carbon dioxide gas.\n\nTABLE 608.16.1\nMINIMUM REQUIRED AIR GAPS\n\nFIXTURE\n\n(_inimum_air Gap\n\nAway from a Wall* (1-105) ase to a wall (inches)\n\nLavatories and other fixtures with effective openings not greater\n\ninch in di ee ee\nthan '/, inch in diameter |\n—<—\n\neS ———— —\nSinks, laundry trays, gooseneck back faucets and other fixtures with Vy 21)\neffective openings not greater than */, inch in diameter 2 2\nOver-rim bath fillers and other fixtures with effective openings not 2 3\n\ngreater than | inch in diameter\n\nDrinking water fountains, single orifice not greater than 7/,, inch in\ndiameter or multiple orifices with a total area of 0.150 square inch 1 Ih,\n(area of circle 7/,, inch in diameter)\n\nThree times the diameter of the\neffective opening\n\nTwo times the diameter of the\n\nEffective openings greater than 1 inch effective opening\n\nFor SI:1 inch = 25.4 mm, | square inch = 645 mm’.\na. Applicable where walls or obstructions are spaced from the nearest inside-edge of the spout opening a distance greater than three times the diameter of the\neffective opening fora single wall, or a distance greater than four times the diameter of the effective opening for two intersecting walls.\n\n2021 INTERNATIONAL PLUMBING CODE® 6-15\n"
    },
    {
        "page": 73,
        "text": "WATER SUPPLY AND DISTRIBUTION\n\n608.17.1.2 Coffee machines and noncarbonated\ndrink dispensers. The water supply connection to\neach coffee machine and each noncarbonated beverage\ndispenser shall be protected against backflow by a\nbackflow preventer conforming to ASSE 1022 or\nASSE 1024, or protected by an air gap.\n\n608.17.2 Connections to boilers. The potable supply to\nthe boiler shall be equipped with a backflow preventer\nwith an intermediate atmospheric vent complying with\nASSE 1012, ASSE 1081 or CSA B64.3. Where condi-\ntioning chemicals are introduced into the system, the\npotable water connection shall be protected by an air gap\nor a reduced pressure principle backflow preventer,\ncomplying with ASSE 1013, AWWA C511 or CSA\nB64.4.\n\n608.17.3 Heat exchangers. Heat exchangers utilizing an\nessentially toxic transfer fluid shall be separated from the\npotable water by double-wall construction. An air gap\nopen to the atmosphere shall be provided between the two\nwalls. Heat exchangers utilizing an essentially nontoxic\ntransfer fluid shall be permitted to be of single-wall\nconstruction.\n\n608.17.4 Connections to automatic sprinkler systems\nand standpipe systems. The potable water supply to\nautomatic sprinkler systems and standpipe systems shall\nbe protected against backflow by a double check back-\nflow prevention assembly, a double check fire protection\nbackflow prevention assembly or a reduced pressure prin-\nciple fire protection backflow prevention assembly.\n\nExceptions:\n\n1. Where systems are installed as a portion of the\nwater distribution system in accordance with\nthe requirements of this code and are not\nprovided with a fire department connection,\nisolation of the water supply system shall not\nbe required.\n\n2. Isolation of the water distribution system is not\nrequired for deluge, preaction or dry pipe\nsystems.\n\n608.17.4.1 Additives or nonpotable source. Where\nsystems under continuous pressure contain chemical\nadditives or antifreeze, or where systems are\nconnected to a nonpotable secondary water supply, the\npotable water supply shall be protected against back-\nflow by a reduced pressure principle backflow\nprevention assembly or a reduced pressure principle\nfire protection backflow prevention assembly. Where\nchemical additives or antifreeze are added to only a\nportion of an automatic sprinkler system or standpipe\nsystem, the reduced pressure principle backflow\nprevention assembly or the reduced pressure principle\nfire protection backflow prevention assembly shall be\npermitted to be located so as to isolate that portion of\nthe system. Where systems are not under continuous\n\n6-16\n\npressure, the potable water supply shall be protected\nagainst backflow by an air gap or an atmospheric\nvacuum breaker conforming to ASSE 1001 or CSA\nB64.1.1.\n\n608.17.5 Connections to lawn irrigation systems. The\npotable water supply to lawn irrigation systems shall be\nprotected against backflow by an atmospheric vacuum\nbreaker, a pressure vacuum breaker assembly or a\nreduced pressure principle backflow prevention assem-\nbly. Valves shall not be installed downstream from an\natmospheric vacuum breaker. Where chemicals are intro-\nduced into the system, the potable water supply shall be\nprotected against backflow by a reduced pressure princi-\nple backflow prevention assembly.\n\n608.17.6 Connections subject to backpressure. Where a\npotable water connection is made to a nonpotable line,\nfixture, tank, vat, pump or other equipment subject to\nhigh-hazard backpressure, the potable water connection\nshall be protected by a reduced pressure principle back-\nflow prevention assembly.\n\n608.17.7 Chemical dispensers. Where chemical dispens-\ners connect to the potable water distribution system, the\nwater supply system shall be protected against backflow\nin accordance with Section 608.14.1, 608.14.2, 608.14.5,\n608.14.6, or 608.14.8.\n\n608.17.8 Portable cleaning equipment. Where the\nportable cleaning equipment connects to the water distri-\nbution system, the water supply system shall be protected\nagainst backflow in accordance with Section 608.14.1,\n608.14.2, 608.14.3, 608.14.7 or 608.14.8.\n\n608.17.9 Dental pumping equipment. The water supply\nconnection to each dental pumping equipment system, the\nwater supply system shall be protected against backflow\nin accordance with Section 608.14.1, 608.14.2, 608.14.5,\n608.14.6 or 608.14.8.\n\n608.17.10 Humidifiers. The water supply connection to\nhumidifiers that do not have internal backflow protection\nshall be protected against backflow by a backflow\npreventer conforming to ASSE 1012 or by an air gap.\n\n608.18 Protection of individual water supplies. An indi-\nvidual water supply shall be located and constructed so as to\nbe safeguarded against contamination in accordance with\nSections 608.18.1 through 608.18.8.\n\n608.18.1 Well locations. A potable ground water source\nor pump suction line shall not be located closer to poten-\ntial sources of contamination than the distances shown in\nTable 608.18.1. In the event the underlying rock structure\nis limestone or fragmented shale, the local or state health\ndepartment shall be consulted on well site location. The\ndistances in Table 608.18.1 constitute minimum separa-\ntion and shall be increased in areas of creviced rock or\nlimestone, or where the direction of movement of the\nground water is from sources of contamination toward the\nwell.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 74,
        "text": "TABLE 608.18.1\nDISTANCE FROM CONTAMINATION TO\nPRIVATE WATER SUPPLIES AND PUMP SUCTION LINES\n\nDISTANCE (feet)\nery\n———\n\n— 60\nPumphouse floor drain of cast iron draining 2\nto ground surface\nSeepage pits 50\nSeptic tank 25\nSewer 10\nSubsurface disposal fields 50\nSubsurface pits 50\n\nFor SI: 1 foot = 304.8 mm.\n\n608.18.2 Elevation. Well sites shall be positively drained\nand shall be at higher elevations than potential sources of\ncontamination.\n\n608.18.3 Depth. Private potable well supplies shall not be\ndeveloped from a water table less than 10 feet (3048 mm)\nbelow the ground surface.\n\n608.18.4 Watertight casings. Each well shall be\nprovided with a watertight casing extending to not less\nthan 10 feet (3048 mm) below the ground surface.\nCasings shall extend not less than 6 inches (152 mm)\nabove the well platform. Casings shall be large enough to\npermit installation of a separate drop pipe. Casings shall\nbe sealed at the bottom in an impermeable stratum or\nextend several feet (mm) into the water-bearing stratum.\n\n608.18.5 Drilled or driven well casings. Drilled or\ndriven well casings shall be of steel or other approved\nmaterial. Where drilled wells extend into a rock forma-\ntion, the well casing shall extend to and set firmly in the\nformation. The annular space between the earth and the\noutside of the casing shall be filled with cement grout to a\ndepth of not less than 10 feet (3048 mm) below the\nground surface. In an instance of casing to rock installa-\ntion, the grout shall extend to the rock surface.\n\n608.18.6 Dug or bored well casings. Dug or bored well\ncasings shall be of watertight concrete, tile or galvanized\nor corrugated metal pipe extending to not less than 10 feet\n(3048 mm) below the ground surface. Where the water\ntable is more than 10 feet (3048 mm) below the ground\nsurface, the watertight casing shall extend below the table\nsurface. Well casings for dug wells or bored wells\nconstructed with sections of concrete, tile or galvanized\nor corrugated metal pipe shall be surrounded by 6 inches\n(152 mm) of grout poured into the hole between the\noutside of the casing and the ground and extending not\nless than 10 feet (3048 mm) below the ground surface.\n\n608.18.7 Cover. Potable water wells shall be equipped\nwith an overlapping watertight cover at the top of the well\ncasing or pipe sleeve such that contaminated water or\nother substances are prevented from entering the well\nthrough the annular opening at the top of the well casing,\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nWATER SUPPLY AND DISTRIBUTION\n\nwall or pipe sleeve. Covers shall extend downward not\nless than 2 inches (51 mm) over the outside of the well\ncasing or wall. A dug well cover shall be provided with a\npipe sleeve permitting the withdrawal of the pump\nsuction pipe, cylinder or jet body without disturbing the\ncover. Where pump sections or discharge pipes enter or\nleave a well through the side of the casing, the circle of\ncontact shall be watertight.\n\n608.18.8 Drainage. Potable water wells and springs shall\nbe constructed such that surface drainage will be diverted\naway from the well or spring.\n\nSECTION 609\nHEALTH CARE PLUMBING\n\n609.1 Scope. This section shall govern those aspects of\nhealth care plumbing systems that differ from plumbing\nsystems in other structures. Health care plumbing systems\nshall conform to the requirements of this section in addition\nto the other requirements of this code. The provisions of this\nsection shall apply to the special devices and equipment\ninstalled and maintained in the following occupancies:\nGroup I-1, Group I- 2, Group B ambulatory care facilities,\nmedical offices, research and testing laboratories, and Group\nF facilities manufacturing pharmaceutical drugs and\nmedicines.\n\n609.2 Water service for Group I-2, Condition 2 facilities.\nGroup 1-2, Condition 2 facilities shall have not fewer than\ntwo water service pipes sized such that with the loss of the\nlargest service pipe, the remaining service pipes will meet\nthe water demand for the entire facility. Each water service\nshall have a shutoff valve in the building and a shutoff valve\nat the utility-provided point of connection to the water main\nor other source of potable water.\n\n609.2.1 Tracer wire for nonmetallic piping. An insu-\nlated tracer wire listed for the purpose or other approved\nconductor shall be installed adjacent to underground\nnonmetallic piping serving as a water service for a hospi-\ntal. Access shall be provided to the tracer wire or the\ntracer wire shall terminate above ground at each end of\nthe nonmetalic piping. The tracer wire size shall be not\nless than 18 AWG and the wire insulation type shall be\nsuitable for direct burial.\n\n609.3 Hot water. Hot water shall be provided to supply all\nof the hospital fixture, kitchen and laundry requirements.\nSpecial fixtures and equipment shall have hot water supplied\nat a temperature specified by the manufacturer. The hot\nwater system shall be installed in accordance with Section\n607.\n\n609.4 Vacuum breaker installation. Vacuum breakers shall\nbe installed not less than 6 inches (152 mm) above the flood\nlevel rim of the fixture or device in accordance with Section\n608. The flood level rim of hose connections shall be the\nmaximum height at which any hose is utilized.\n\n609.5 Prohibited water closet and clinical sink supply.\nJet- or water-supplied orifices, except those supplied by the\nflush connections, shall not be located in or connected with a\n\n6-17\n"
    },
    {
        "page": 75,
        "text": "WATER SUPPLY AND DISTRIBUTION\n\nwater closet bowl or clinical sink. This section shall not\nprohibit an approved bidet installation.\n\n609.6 Clinical, hydrotherapeutic and radiological equip-\nment. Clinical, hydrotherapeutic, radiological or any\nequipment that is supplied with water or that discharges to\nthe waste system shall conform to the requirements of this\nsection and Section 608.\n\n609.7 Condensate drain trap seal. A water supply shall be\nprovided for cleaning, flushing and resealing the condensate\ntrap, and the trap shall discharge through an air gap in accor-\ndance with Section 608.\n\n609.8 Valve leakage diverter. Each water sterilizer filled\nwith water through directly connected piping shall be\nequipped with an approved leakage diverter or bleed line on\nthe water supply control valve to indicate and conduct any\nleakage of unsterile water away from the sterile zone.\n\nSECTION 610\nDISINFECTION OF POTABLE WATER SYSTEM\n\n610.1 General. New potable water systems shall be purged\nof deleterious matter and disinfected prior to utilization. The\nmethod to be followed shall be that prescribed by the health\nauthority or water purveyor having jurisdiction or, in the\nabsence of a prescribed method, the procedure described in\neither AWWA C651 or AWWA C652, or as described in\nthis section. This requirement shall apply to “on-site” or “in-\nplant” fabrication of a system or to a modular portion of a\nsystem.\n\n1. The pipe system shall be flushed with clean, potable\nwater until dirty water does not appear at the points\nof outlet.\n\n2. The system or part thereof shall be filled with a\nwater/chlorine solution containing not less than 50\nparts per million (50 mg/L) of chlorine, and the\nsystem or part thereof shall be valved off and allowed\nto stand for 24 hours; or the system or part thereof\nshall be filled with a water/chlorine solution contain-\ning not less than 200 parts per million (200 mg/L) of\nchlorine and allowed to stand for 3 hours.\n\n3. Following the required standing time, the system\nshall be flushed with clean potable water until the\nchlorine is purged from the system.\n\n4. The procedure shall be repeated where shown by a\nbacteriological examination that contamination\nremains present in the system.\n\nSECTION 611\nDRINKING WATER TREATMENT UNITS\n\n611.1 Design. Point-of-use reverse osmosis drinking water\ntreatment units shall comply with CSA B483.1 or NSF 58.\nDrinking water treatment units shall meet the requirements\nof CSA B483.1, NSF 42, NSF 44, NSF 53 or NSF 62.\n\n611.2 Reverse osmosis systems. The discharge from a\nreverse osmosis drinking water treatment unit shall enter the\n\n6-18\n\ndrainage system through an air gap or an air gap device that\nmeets the requirements of CSA B483.1 or NSF 58.\n\n611.3 Connection tubing. The tubing to and from drinking\nwater treatment units shall be of a size and material as\nrecommended by the manufacturer. The tubing shall comply\nwith NSF 14, NSF 42, NSF 44, NSF 53, NSF 58 or NSF 61.\n\nSECTION 612\nSOLAR SYSTEMS\n\n612.1 Solar systems. The construction, installation, alter-\nations and repair of systems, equipment and appliances\nintended to utilize solar energy for space heating or cooling,\ndomestic hot water heating, swimming pool heating or\nprocess heating shall be in accordance with the /nternational\nMechanical Code.\n\nSECTION 613\nTEMPERATURE CONTROL DEVICES AND VALVES\n\n613.1 Temperature-actuated mixing valves. Temperature-\nactuated mixing valves, which are installed to reduce water\ntemperatures to defined limits, shall comply with ASSE\n1017. Such valves shall be installed at the hot water source.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 76,
        "text": "CHAPTER 7\nSANITARY DRAINAGE\n\nUser note:\n\nAbout this chapter: Chapter 7 regulates the methods and piping systems that remove water that has served a purpose such as flushing\nwater closets, bathing, culinary activities and equipment discharges. The types of materials, drainage fitting and the connection methods\nare covered for these systems that begin at the receiving fixtures and end at the point of disposal for the liquid waste. A design method for\na gravity flow system of vertical and horizontal piping is provided based on the probability of flows from specific fixtures. Vacuum and\npumped types of liquid waste removal methods are also regulated by this chapter.\n\nSECTION 701\nGENERAL\n\n701.1 Scope. The provisions of this chapter shall govern the\nmaterials, design, construction and installation of sanitary\ndrainage systems.\n\n701.2 Connection to sewer required. Sanitary drainage\npiping from plumbing fixtures in buildings and sanitary\ndrainage piping systems from premises shall be connected to\na public sewer. Where a public sewer is not available, the\nsanitary drainage piping and systems shall be connected to a\nprivate sewage disposal system in compliance with state or\nlocal requirements. Where state or local requirements do not\nexist for private sewage disposal systems, the sanitary drain-\nage piping and systems shall be connected to an approved\nprivate sewage disposal system that is in accordance with the\nInternational Private Sewage Disposal Code.\n\nException: Sanitary drainage piping and systems that\nconvey only the discharge from bathtubs, showers, lava-\ntories, clothes washers and laundry trays shall not be\nrequired to connect to a public sewer or to a private\nsewage disposal system provided that the piping or\nsystems are connected to a system in accordance with\nChapter 13 or 14.\n\n701.3. Separate sewer connection. A building having\nplumbing fixtures installed and intended for human habita-\ntion, occupancy or use on premises abutting on a street, alley\nor easement in which there is a public sewer shall have a\nseparate connection with the sewer. Where located on the\nsame lot, multiple buildings shall not be prohibited from\nconnecting to a common building sewer that connects to the\npublic sewer.\n\n701.4 Sewage treatment. Sewage or other waste from a\nplumbing system that is deleterious to surface or subsurface\nwaters shall not be discharged into the ground or into any\nwaterway unless it has first been rendered innocuous through\nsubjection to an approved form of treatment.\n\n701.5 Damage to drainage system or public sewer. Waste\ndetrimental to the public sewer system or to the functioning\nof the sewage-treatment plant shall be treated and disposed\nof in accordance with Section 1003 as directed by the code\nofficial.\n\n701.6 Tests. The sanitary drainage system shall be tested in\naccordance with Section 312.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\n701.7 Engineered systems. Engineered sanitary drainage\nsystems shall conform to the provisions of Sections 316 and\n713.\n\nSECTION 702\nMATERIALS\n\n702.1 Above-ground sanitary drainage and vent pipe.\nAbove-ground soil, waste and vent pipe shall conform to one\nof the standards listed in Table 702.1.\n\nTABLE 702.1\nABOVE-GROUND DRAINAGE AND VENT PIPE\n\noe ee a ee\n\nAcrylonitrile butadiene styrene\n“fers ichuding Schedule 40, _ASTM D266\nDR 22 (PS 200) and DR 24 “rN ree ASTM F1488;\n- (PS 140); with a solid, cellular core\nor composite wall |\n“Topper or copper-alloy pipe a SS\nCopper or copper-alloy tubing ASTM B75; ASTM B88;\n\n(Type K, L, M or DWV)\nGalvanized steel pipe\n\nASTM B251; ASTM B306\nASTM AS53\n\nASTM C1053\n\nASTM F1412; CSA B181.3\n\nGlass pipe\nPolyolefin pipe\nPolyvinyl chloride (PVC) plastic\n\npipe in IPS diameters, including ASTM D2665;\n\nSchedule 40, DR 22 (PS 200), and ASTM F891; ASTM F1488;\nDR 24 (PS 140); with a solid, CSA B181.2\n\ncellular core or composite wall\n\nPolyvinyl chloride (PVC) plastic\n\npipe with a 3.25-inch O.D. anda ASTM D2949;\n\nsolid, cellular core or composite ASTM F1488\n\nwall\n\nPolyvinylidene fluoride (PVDF)\nplastic pipe\n\nASTM F1673; CSA B181.3\n\nStainless steel drainage systems,\n\nTypes 304 and 316L ASME A112.3.1\n\n7-1\n"
    },
    {
        "page": 77,
        "text": "SANITARY DRAINAGE\n\n702.2 Underground building sanitary drainage and vent\npipe. Underground building sanitary drainage and vent pipe\nshall conform to one of the standards listed in Table 702.2.\n\nTABLE 702.2\n\n= a re\n\nAcrylonitrile butadiene styrene a\n(ABS) plastic pipe in IPS diame- 5 7\nters, including Schedule 40, _ ASTM D2661; ASTM F628; _\nDR 22 (PS 200) and _ASTM F1488; CSA B181.1\nDR 24 (PS 140); with a solid, I\ncellular core or composite wall A\n_— —\n|* ASTM A74; ASTM A888;\nCISPI 301\n\nASTM B75; ASTM B88;\nASTM B251; ASTM B306\n\nCopper or copper-alloy tubing\n(Type K, L, Mor DWV)\n\nPolyethylene (PE) plastic pipe\n\n(SDR-PR) ASTM F714\n\nASTM F714;\n\nPolyolefin pipe ASTM F1412; CSA B1813\n\nPolyvinyl chloride (PVC) plastic\npipe in IPS diameters, including\nSchedule 40, DR 22 (PS 200) and\n\nDR 24 (PS 140); with a solid,\ncellular core or composite wall\n\nASTM D2665; ASTM F891;\nASTM F1488; CSA B181.2\n\nPolyvinyl chloride (PVC) plastic\npipe with a 3.25-inch O.D. anda\nsolid, cellular core or composite\nwall\n\nPolyvinylidene fluoride (PVDF)\nplastic pipe\n\nASTM D2949; ASTM F1488\n\nASTM F1673; CSA B181.3\n\nStainless steel drainage systems,\n\nType 316L ASME A112.3.1\n\nFor SI: 1 inch = 25.4 mm.\n\n702.3 Building sewer pipe. Building sewer pipe shall\nconform to one of the standards listed in Table 702.3.\n\n702.4 Fittings. Pipe fittings shall be approved for installa-\ntion with the piping material installed and shall comply with\nthe applicable standards listed in Table 702.4.\n\n702.5 Temperature rating. Where the wastewater tempera-\nture will be greater than 140°F (60°C), the sanitary drainage\npiping material shall be rated for the highest temperature of\nthe wastewater.\n\n702.6 Chemical waste system. A chemical waste system\nshall be completely separated from the sanitary drainage\nsystem. The chemical waste shall be treated in accordance\nwith Section 803.2 before discharging to the sanitary drain-\nage system. Separate drainage systems for chemical wastes\nand vent pipes shall be of an approved material that is resis-\ntant to corrosion and degradation for the concentrations of\nchemicals involved.\n\n702.7 Lead bends and traps. The wall thickness of lead\nbends and traps shall be not less than '/, inch (3.2 mm).\n\n7-2\n\nTABLE 702.3\nBUILDING SEWER PIPE\n\n1 le butadi |\nAcrylonitrile butadiene styrene\n- (ABS) plastic pipe in IPS diame- ASTM D2661;\n\ni\" . ASTM D2680;\nters, including Schedule 40, ASTM F628:\nDR 22 (PS 200) and DR 24 ‘ 7\n(PS 140); with a solid, cellular» ASTM F1488;\n\nr ? . z » CSA B181.1\n\ncore or composite wall\n\nAcrylonitrile butadiene styrene\n_(ABS) plastic pipe in sewer and\ndrain diameters, including\n~ SDR 42 (PS 20), PS 35, SDR 35\n(PS 45), PS 50, PS 100, PS 140,\nSDR 23.5 (PS 150) and PS 200;\n~ with a solid, cellular core or\ncomposite wall\n\nASTM D2751; ASTM F1488\n\n—————————\n= es | = ASTM A74; ASTM A888;\nCasearor pipe CISPI 301\nASTM C14; ASTM C76;\nCSA A257.1; CSA A257.2\n\nASTM B75; ASTM B88;\nASTM B251\n\nConcrete pipe\n\nCopper or copper-alloy tubing\n(Type K or L)\n\nPolyethylene (PE) plastic pipe\n\n(SDR-PR) ASTM F714\n\nASTM F2736; ASTM F2764;\n\nPolypropylene (PP) plastic pipe CSA B182.13\n\nPolyvinyl! chloride (PVC) plastic\npipe in IPS diameters, including\nSchedule 40, DR 22 (PS 200) and\nDR 24 (PS 140); with a solid,\ncellular core or composite wall\n\nASTM D2665; ASTM F891;\nASTM F1488\n\nPolyvinyl chloride (PVC) plastic\npipe in sewer and drain diame-\nters, including PS 25, SDR 41 (PS\n28), PS 35, SDR 35 (PS 46), PS\n50, PS 100, SDR 26\n\n(PS 115), PS 140 and PS 200; with\na solid, cellular core or composite\nwall\n\nASTM F891; ASTM F1488;\nASTM D3034;\nCSA B182.2; CSA B182.4\n\nPolyvinyl chloride (PVC) plastic\npipe with a 3.25-inch O.D. anda\nsolid, cellular core or composite\nwall\n\nPolyvinylidene fluoride (PVDF)\n\nASTM D2949; ASTM F1488\n\nASTM F1673; CSA B181.3\n\nplastic pipe\n\nStainless steel drainage systems,\n\nTypes 304 and 316L ASME A112.3.1\nVitrified clay pipe ASTM C4; ASTM C700\n\nFor SI: 1 inch= 25.4 mm.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 78,
        "text": "TABLE 702.4\nPIPE FITTINGS\n\nee\nAcrylonitrile butadiene styrene |;ASME A112.4.4;\n7(ABS) plastic pipe in IPS )ASTM D2661; ASTM F628;\n\ndiameters ~CSA B181.1\nAcrylonitrile Dutadiene styrene |\n\n: (ABS) plastic pipe in sewer and -ASTM D2751\n\n° drain diameters 4\n——— | ——_\n\n— \\ \\\n1 ASME B16.4; ASME B16.12;\nCast iron | ASTM A74; ASTM A888; ]\nHS CISPI 301 4\nC ASME BI16.15; ASME B16.18;\n7 “ASME BI16.22;\nCopper or copper alloy ASME B16.23;\nASME B16.26;\nASME BI16.29\nGlass ASTM C1053\nGray iron and ductile iron AWWA C110/A21.10\nPolyethylene ASTM D2683\nPolyolefin ASTM F1412; CSA B181.3\nPolyvinyl chloride (PVC) plas- ASME A1 12.4.4;\n\ntic in IPS diameters\nPolyvinyl chloride (PVC) plas-\n\nASTM D2665; ASTM F1866\n\ntic pipe in sewer and drain ASTM D3034\ndiameters\nPolyvinyl chloride (PVC) plas- ASTM D2949\n\ntic pipe with a 3.25-inch O.D.\nPolyvinylidene fluoride (PVDF)\n\nASTM F1673; CSA B181.3\n\nplastic pipe\nStainless steel drainage systems,\nTypes 304 and 316L ASME A112.3.1\nSteel ASME B16.9; ASME B16.11;\nee ASME B16.28\nVitrified clay ASTM C700\nFor SI: 1 inch= 25.4 mm.\nSECTION 703\n\nBUILDING SEWER\n\n703.1 Building sewer pipe near the water service. The\nproximity of a sewer to a water service shall comply with\nSection 603.2.\n\n703.2 Drainage pipe in filled ground. Where a building\nsewer or building drain is installed on filled or unstable\nground, the drainage pipe shall conform to one of the stan-\ndards for ABS plastic pipe, cast-iron pipe, copper or copper-\nalloy tubing, PVC plastic pipe or polypropylene plastic pipe\nindicated in Table 702.3.\n\n703.3 Sanitary and storm sewers. Where separate systems\nof sanitary drainage and storm drainage are installed in the\nsame property, the sanitary and storm building sewers or\ndrains shall be permitted to be laid side by side in one trench.\n\n703.4 Existing building sewers and building drains.\nWhere the entire sanitary drainage system of an existing\nbuilding is replaced, existing building drains under concrete\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nSANITARY DRAINAGE\n\nslabs and existing building sewers that will serve the new\nsystem shall be internally examined to verify that the piping\nis sloping in the correct direction, is not broken, is not\nobstructed and is sized for the drainage load of the new\nplumbing drainage system to be installed.\n\n703.5 Cleanouts on building sewers. Cleanouts on building\nsewers shall be located as indicated in Section 708.\n\n703.6 Combined sanitary and storm public sewer. Where\nthe public sewer is a combined system for both sanitary and\nstorm water, the sanitary sewer shall be connected inde-\npendently to the public sewer.\n\nSECTION 704\nDRAINAGE PIPING INSTALLATION\n\n704.1 Slope of horizontal drainage piping. Horizontal\ndrainage piping shall be installed in uniform alignment at\nuniform slopes. The slope of a horizontal drainage pipe shall\nbe not less than that indicated in Table 704.1 except that\nwhere the drainage piping is upstream of a grease intercep-\ntor, the slope of the piping shall be not less than '/, inch per\nfoot (2-percent slope).\n\nTABLE 704.1\nSLOPE OF HORIZONTAL DRAINAGE PIPE\nSIZE (inches| SLOPE (inch per foot)\n41 4 yy a\n[or tess 4\n3106 ye\n8 or larger Ne\n\nFor SI: 1 inch = 25.4 mm, | inch per foot = 83.33 mm/m.\na. Slopes for piping draining to a grease interceptor shall comply with\nSection 704.1.\n\n704.2 Reduction in pipe size in the direction of flow. The\nsize of the drainage piping shall not be reduced in the direc-\n\ntion of the flow. The following shall not be considered as a\nreduction in size in the direction of flow:\n\n1. A 4-inch by 3-inch (102 mm by 76 mm) water closet\nlange.\n\n2. A water closet bend fitting having a 4-inch (102 mm)\ninlet and a 3-inch (76 mm) outlet provided that the 4-\ninch leg of the fitting is upright and below, but not\nnecessarily directly connected to, the water closet\nlange.\n\n3. An offset closet flange.\n\n704.3 Connections to offsets and bases of stacks. Horizon-\ntal branches shall connect to the bases of stacks at a point\nlocated not less than 10 times the diameter of the drainage\nstack downstream from the stack. Horizontal branches shall\nconnect to horizontal stack offsets at a point located not less\nthan 10 times the diameter of the drainage stack downstream\nfrom the upper stack.\n\n704.4 Future fixtures. Drainage piping for future fixtures\nshall terminate with an approved cap or plug.\n\n7-3\n"
    },
    {
        "page": 79,
        "text": "SANITARY DRAINAGE\n\nSECTION 705\nJOINTS\n\n705.1 General. This section contains provisions applicable\nto joints specific to sanitary drainage piping.\n\n705.2. ABS plastic. Joints between ABS plastic pipe or\nfittings shall comply with Sections 705.2.1 through 705.2.3.\n\n705.2.1 Mechanical joints. Mechanical joints on drain-\nage pipes shall be made with an elastomeric seal\nconforming to ASTM C1173, ASTM D3212 or CSA\nB602. Mechanical joints shall be installed only in under-\nground systems unless otherwise approved. Joints shall\nbe installed in accordance with the manufacturer’s\ninstructions.\n\n705.2.2 Solvent cementing. Joint surfaces shall be clean\nand free from moisture. Solvent cement that conforms to\nASTM D2235 or CSA B181.1 shall be applied to all joint\nsurfaces. The joint shall be made while the cement is wet.\nJoints shall be made in accordance with ASTM D2235,\nASTM D2661, ASTM F628 or CSA B181.1. Solvent-\ncement joints shall be permitted above or below ground.\n\n705.2.3 Threaded joints. Threads shall conform to\nASME B1.20.1. Schedule 80 or heavier pipe shall be\npermitted to be threaded with dies specifically designed\nfor plastic pipe. Approved thread lubricant or tape shall be\napplied on the male threads only.\n705.2.4 Push-fit joints. Push-fit DWV fittings shall be\nlisted and labeled to ASME A112.4.4 and shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n705.3 Cast iron. Joints between cast-iron pipe or fittings\nshall comply with Sections 705.3.1 through 705.3.3.\n\n705.3.1 Caulked joints. Joints for hub and spigot pipe\nshall be firmly packed with oakum or hemp. Molten lead\nshall be poured in one operation to a depth of not less than\n1 inch (25 mm). The lead shall not recede more than '/,\ninch (3.2 mm) below the rim of the hub and shall be\ncaulked tight. Paint, varnish or other coatings shall not be\npermitted on the jointing material until after the joint has\nbeen tested and approved. Lead shall be run in one pour-\ning and shall be caulked tight. Acid-resistant rope and\nacidproof cement shall be permitted.\n\n705.3.2 Compression gasket joints. Compression\ngaskets for hub and spigot pipe and fittings shall conform\nto ASTM C564 and shall be tested to ASTM C1563.\nGaskets shall be compressed when the pipe is fully\ninserted.\n\n705.3.3 Mechanical joint coupling. Mechanical joint\ncouplings for hubless pipe and fittings shall consist of an\nelastomeric sealing sleeve and a metallic shield that\ncomply with CISPI 310, ASTM C1277 or ASTM C1540.\nThe elastomeric sealing sleeve shall conform to ASTM\nC564 or CSA B602 and shall be provided with a center\nstop. Mechanical joint couplings shall be installed in\naccordance with the manufacturer’s instructions.\n\n7-4\n\n705.4 Concrete joints. Joints between concrete pipe and\nfittings shall be made with an elastomeric seal conforming to\nASTM C443, ASTM C1173, CSA A257.3M or CSA B602.\n\n705.5 Copper pipe. Joints between copper or copper-alloy\npipe or fittings shall comply with Sections 705.5.1 through\n705.5.5.\n\n705.5.1 Brazed joints. Joint surfaces shall be cleaned. An\napproved flux shall be applied where required. The joint\nshall be brazed with a filler metal conforming to AWS\nA5.8.\n\n705.5.2 Mechanical joints. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n705.5.3 Solder joints. Solder joints shall be made in\naccordance with the methods of ASTM B828. Cut tube\nends shall be reamed to the full inside diameter of the\ntube end. Joint surfaces shall be cleaned. A flux conform-\ning to ASTM B813 shall be applied. The joint shall be\nsoldered with a solder conforming to ASTM B32.\n\n705.5.4 Threaded joints. Threads shall conform to\nASME B1.20.1. Pipe-joint compound or tape shall be\napplied on the male threads only.\n\n705.5.5 Welded joints. Joint surfaces shall be cleaned.\nThe joint shall be welded with an approved filler metal.\n\n705.6 Copper tubing. Joints between copper or copper-\nalloy tubing or fittings shall comply with Sections 705.6.1\nthrough 705.6.3.\n\n705.6.1 Brazed joints. Joint surfaces shall be cleaned. An\napproved flux shall be applied where required. The joint\nshall be brazed with a filler metal conforming to AWS\nA5.8.\n\n705.6.2 Mechanical joints. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n705.6.3 Solder joints. Solder joints shall be made in\naccordance with the methods of ASTM B828. Cut tube\nends shall be reamed to the full inside diameter of the\ntube end. Joint surfaces shall be cleaned. A flux conform-\ning to ASTM B813 shall be applied. The joint shall be\nsoldered with a solder conforming to ASTM B32.\n\n705.7 Borosilicate glass joints. Glass-to-glass connections\nshall be made with a bolted compression-type, 300 series\nstainless steel coupling with contoured acid-resistant elasto-\nmeric compression ring and a fluorocarbon polymer inner\nseal ring; or with caulked joints in accordance with Section\n705.7.1.\n\n705.7.1 Caulked joints. Lead-caulked joints for hub and\nspigot soil pipe shall be firmly packed with oakum or\nhemp and filled with molten lead not less than 1 inch (25\nmm) in depth and not to recede more than '/, inch (3.2\nmm) below the rim of the hub. Paint, varnish or other\ncoatings shall not be permitted on the jointing material\nuntil after the joint has been tested and approved. Lead\nshall be run in one pouring and shall be caulked tight.\nAcid-resistant rope and acidproof cement shall be\npermitted.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 80,
        "text": "705.8 Steel. Joints between galvanized steel pipe or fittings\nshall comply with Sections 705.8.1 and 705.8.2.\n\n705.8.1 Threaded joints. Threads shall conform to\nASME B1.20.1. Pipe-joint compound or tape shall be\napplied on the male threads only.\n\n705.8.2 Mechanical joints. Joints shall be made with an\napproved elastomeric seal. Mechanical joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n705.9 Lead. Joints between lead pipe or fittings shall comply\nwith Sections 705.9.1 and 705.9.2.\n\n705.9.1 Burned. Burned joints shall be uniformly fused\ntogether into one continuous piece. The thickness of the\njoint shall be not less than the thickness of the lead being\njoined. The filler metal shall be of the same material as\nthe pipe.\n\n705.9.2 Wiped. Joints shall be fully wiped, with an\nexposed surface on each side of the joint not less than */,\ninch (19.1 mm). The joint shall be not less than */, inch\n(9.5 mm) thick at the thickest point.\n\n705.10 PVC plastic. Joints between PVC plastic pipe or\nfittings shall comply with Sections 705.10.1 through\n705.10.3.\n\n705.10.1 Mechanical joints. Mechanical joints on drain-\nage pipe shall be made with an elastomeric seal\nconforming to ASTM C1173, ASTM D3212 or CSA\nB602. Mechanical joints shall not be installed in above-\nground systems, unless otherwise approved. Joints shall\nbe installed in accordance with the manufacturer’s\ninstructions.\n\n705.10.2 Solvent cementing. Joint surfaces shall be clean\nand free from moisture. A purple primer that conforms to\nASTM F656 shall be applied. Solvent cement not purple\nin color and conforming to ASTM D2564, CSA B137.3,\nCSA B181.2 or CSA B182.1 shall be applied to all joint\nsurfaces. The joint shall be made while the cement is wet\nand shall be in accordance with ASTM D2855. Solvent-\ncement joints shall be permitted above or below ground.\n\nException: A primer is not required where both of the\nfollowing conditions apply:\n\n1. The solvent cement used is third-party certified\nas conforming to ASTM D2564.\n\n2. The solvent cement is used only for joining\nPVC drain, waste and vent pipe and fittings in\nnonpressure applications in sizes up to and\nincluding 4 inches (102 mm) in diameter.\n\n705.10.3 Threaded joints. Threads shall conform to\nASME B1.20.1. Where pipe is to be threaded, the pipe\nshall have a wall thickness of not less than Schedule 80.\nPipe threads shall be made with dies specifically designed\nfor plastic pipe. Approved thread lubricant or tape shall be\napplied on the male threads only.\n\n705.10.4 Push-fit joints. Push-fit joints shall conform to\nASME A112.4.4 and shall be installed in accordance with\nthe manufacturer’s instructions.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nSANITARY DRAINAGE\n\n705.11 Vitrified clay. Joints between vitrified clay pipe or\nfittings shall be made with an elastomeric seal conforming to\nASTM C425, ASTM C1173 or CSA B602.\n\n705.12 Polyethylene plastic pipe. Joints between polyeth-\nylene plastic pipe and fittings shall be underground and shall\ncomply with Section 705.12.1 or 705.12.2.\n\n705.12.1 Heat-fusion joints. Joint surfaces shall be clean\nand free from moisture. Joint surfaces shall be cut, heated\nto melting temperature and joined using tools specifically\ndesigned for the operation. Joints shall be undisturbed\nuntil cool. Joints shall be made in accordance with ASTM\nD2657 and the manufacturer’s instructions.\n\n705.12.2 Mechanical joints. Mechanical joints in drain-\nage piping shall be made with an elastomeric seal\nconforming to ASTM C1173, ASTM D3212 or CSA\nB602. Mechanical joints shall be installed in accordance\nwith the manufacturer’s instructions.\n\n705.13 Polyolefin plastic. Joints between polyolefin plastic\npipe and fittings shall comply with Sections 705.13.1 and\n705.13.2.\n\n705.13.1 Heat-fusion joints. Heat-fusion joints for poly-\nolefin pipe and tubing joints shall be installed with\nsocket-type heat-fused polyolefin fittings or electrofusion\npolyolefin fittings. Joint surfaces shall be clean and free\nfrom moisture. The joint shall be undisturbed until cool.\nJoints shall be made in accordance with ASTM F1412 or\nCSA B181.3.\n\n705.13.2 Mechanical and compression sleeve joints.\nMechanical and compression sleeve joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n705.14 Polyvinylidene fluoride plastic. Joints between\n\npolyvinylidene plastic pipe and fittings shall comply with\n\nSections 705.14.1 and 705.14.2.\n705.14.1 Heat-fusion joints. Heat-fusion joints for poly-\nvinylidene fluoride pipe and tubing joints shall be\ninstalled with socket-type heat-fused polyvinylidene fluo-\nride fittings or electrofusion polyvinylidene fittings and\ncouplings. Joint surfaces shall be clean and free from\nmoisture. The joint shall be undisturbed until cool. Joints\nshall be made in accordance with ASTM F1673.\n\n705.14.2 Mechanical and compression sleeve joints.\nMechanical and compression sleeve joints shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n705.15 Polypropylene plastic. The joint between polypro-\npylene plastic pipe and fittings shall incorporate an\nelastomeric seal. The joint shall conform to ASTM D3212.\nMechanical joints shall not be installed above ground.\n\n705.16 Joints between different materials. Joints between\ndifferent piping materials shall be made with a mechanical\n\njoint of the compression or mechanical-sealing type\n\nconforming to ASTM C1173, ASTM C1460 or ASTM\nC1461. Connectors and adapters shall be approved for the\napplication and such joints shall have an elastomeric seal\n"
    },
    {
        "page": 81,
        "text": "SANITARY DRAINAGE\n\nconforming to ASTM C425, ASTM C443, ASTM C564,\nASTM C1440, ASTM F477, CSA A257.3M or CSA B602,\nor as required in Sections 705.16.1 through 705.16.7. Joints\nbetween glass pipe and other types of materials shall be\nmade with adapters having a TFE seal. Joints shall be\ninstalled in accordance with the manufacturer’s instructions.\n\n705.16.1 Copper pipe or tubing to cast-iron hub pipe.\nJoints between copper pipe or tubing and cast-iron hub\npipe shall be made with a copper or copper-alloy ferrule\nor compression joint. The copper pipe or tubing shall be\nsoldered to the ferrule in an approved manner, and the\nferrule shall be joined to the cast-iron hub by a caulked\njoint or a mechanical compression joint.\n\n705.16.2 Copper or copper-alloy pipe or tubing to\ngalvanized steel pipe. Joints between copper or copper-\nalloy pipe or tubing and galvanized steel pipe shall be\nmade with a copper-alloy fitting or dielectric fitting. The\ncopper tubing shall be soldered to the fitting in an\napproved manner, and the fitting shall be screwed to the\nthreaded pipe.\n\n705.16.3 Cast-iron pipe to galvanized steel pipe. Joints\nbetween cast iron and galvanized steel shall be made by\neither caulked or threaded joints or with an approved\nadapter fitting.\n\n705.16.4 Plastic pipe or tubing to other piping mate-\nrial. Joints between different types of plastic pipe shall be\nmade with an approved adapter fitting, or by a solvent-\ncement joint only where a single joint is made between\nABS and PVC pipes at the end of a building drainage pipe\nand the beginning of a building sewer pipe using a solvent\ncement complying with ASTM D3138. Joints between\nplastic pipe and other piping material shall be made with\nan approved adapter fitting. Joints between plastic pipe\nand cast-iron hub pipe shall be made by a caulked joint or\na mechanical compression joint.\n\n705.16.5 Lead pipe to other piping material. Joints\nbetween lead pipe and other piping material shall be made\nby a wiped joint to a caulking ferrule, soldering nipple or\nbushing or shall be made with an approved adapter\nfitting.\n\n705.16.6 Borosilicate glass to other materials. Joints\nbetween glass pipe and other types of materials shall be\nmade with adapters having a TFE seal and shall be\ninstalled in accordance with the manufacturer’s\ninstructions.\n\n705.16.7 Stainless steel drainage systems to other\nmaterials. Joints between stainless steel drainage systems\nand other piping materials shall be made with approved\nmechanical couplings.\n\n705.17 Drainage slip joints. Slip joints shall comply with\nSection 405.9.\n\n705.18 Caulking ferrules. Caulking ferrules shall be of\ncopper alloy and shall be in accordance with Table 705.18.\n\nTABLE 705.18\nCAULKING FERRULE SPECIFICATIONS\n\nPIPE-SIZES. INSIDE DIAMETER LENGTH. MINIMUM\nman inches) (imahes) (inche$)mmm WEIGHT EACH\na TT. 44!\" 1 pound\n\n1 1 1 pound\n: 3s 4h, 12 ounces\n1 1 2 pounds\n4 a ah 8 ounces\n\nFor SI: 1 inch = 25.4 mm, 1 ounce = 28.35 g, 1 pound = 0.454 kg.\n\n705.19 Soldering bushings. Soldering bushings shall be of\ncopper or copper alloy and shall be in accordance with Table\n705.19.\n\nTABLE 705.19\nSOLDERING BUSHING SPECIFICATIONS\n\nPIPE SIZES (inches)\n\nV/, —G-ounces\n1/, —$-ounces\n2 14 ounces\n2\", 1 pound 6 ounces\n3 2 pounds\n4 3 pounds 8 ounces\n\nFor SI: 1 inch = 25.4 mm, 1 ounce = 28.35 g, 1 pound = 0.454 kg.\n\n705.20 Stainless steel drainage systems. O-ring joints for\nstainless steel drainage systems shall be made with an\napproved elastomeric seal.\n\nSECTION 706\nCONNECTIONS BETWEEN\nDRAINAGE PIPING AND FITTINGS\n\n706.1 Connections and changes in direction. Connections\nand changes in direction of the sanitary drainage system\nshall be made with approved drainage fittings. Connections\nbetween drainage piping and fixtures shall conform to\nSection 405.\n\n706.2 Obstructions. The fittings shall not have ledges,\nshoulders or reductions capable of retarding or obstructing\nflow in the piping. Threaded drainage pipe fittings shall be\nof the recessed drainage type. This section shall not be appli-\ncable to tubular waste fittings used to convey vertical flow\nupstream of the trap seal liquid level of a fixture trap.\n\n706.3 Installation of fittings. Fittings shall be installed to\nguide sewage and waste in the direction of flow. Change in\ndirection shall be made by fittings installed in accordance\nwith Table 706.3. Change in direction by combination\nfittings, side inlets or increasers shall be installed in accor-\ndance with Table 706.3 based on the pattern of flow created\nby the fitting. Double sanitary tee patterns shall not receive\nthe discharge of back-to-back water closets and fixtures or\nappliances with pumping action discharge.\n\nException: Back-to-back water closet connections to\ndouble sanitary tees shall be permitted where the horizon-\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 82,
        "text": "tal developed length between the outlet of the water closet\nand the connection to the double sanitary tee pattern is 18\ninches (457 mm) or greater.\n\nTABLE 706.3\nHANGE |\n\nCHANGE IN DIRECTION\nTYPE OF FITTING —r—Ff__ fT _]\nPATTERN Horizontalto | Verti i\n\n——-ertical| __| horizontal horizontal\n\nSixteenth bend x x\nig! — x x x\n\nSixth bend x x Xx\n\nQuarter bend x x* x*\n\nShort sweep x x\" x\n\nLong sweep x x x\n\nSanitary tee x* — —\n\nWye x\n\nCombination wye and\n\neighth bend\n\nFor SI: 1 inch = 25.4 mm.\n\na. The fittings shall only be permitted for a 2-inch or smaller fixture drain.\nb. Three inches or larger.\n\nc. Fora limitation on double sanitary tees, see Section 706.3.\n\n706.4 Heel- or side-inlet quarter bends. Heel-inlet quarter\nbends shall be an acceptable means of connection, except\nwhere the quarter bend serves a water closet. A low-heel\ninlet shall not be used as a wet-vented connection. Side-inlet\nquarter bends shall be an acceptable means of connection for\ndrainage, wet venting and stack venting arrangements.\n\nSECTION 707\nPROHIBITED JOINTS AND CONNECTIONS\n\n707.1 Prohibited joints. The following types of joints and\nconnections shall be prohibited:\n\n1. Cement or concrete joints.\n\n2. Mastic or hot-pour bituminous joints.\n\n3. Joints made with fittings not approved for the\nspecific installation.\n\n4. Joints between different diameter pipes made with\nelastomeric rolling O-rings.\n\n5. Solvent-cement joints between different types of\nplastic pipe except where provided for in Section\n705.16.4.\n\n6. Saddle-type fittings.\n\nSECTION 708\nCLEANOUTS\n\n708.1 Cleanouts required. Cleanouts shall be provided for\ndrainage piping in accordance with Sections 708.1.1 through\n708.1.12.\n\n708.1.1 Horizontal drains and building drains. Hori-\nzontal drainage pipes in buildings shall have cleanouts\nlocated at intervals of not more than 100 feet (30 480\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nSANITARY DRAINAGE\n\nmm). Building drains shall have cleanouts located at\nintervals of not more than 100 feet (30 480 mm) except\nwhere manholes are used instead of cleanouts, the\nmanholes shall be located at intervals of not more than\n400 feet (122 m). The interval length shall be measured\nfrom the cleanout or manhole opening, along the devel-\noped length of the piping to the next drainage fitting\nproviding access for cleaning, the end of the horizontal\ndrain or the end of the building drain.\nException: Horizontal fixture drain piping serving a\nnonremovable trap shall not be required to have a clea-\nnout for the section of piping between the trap and the\nvent connection for such trap.\n\n708.1.2 Building sewers. Building sewers smaller than 8\ninches (203 mm) shall have cleanouts located at intervals\nof not more than 100 feet (30 480 mm). Building sewers 8\ninches (203 mm) and larger shall have a manhole located\nnot more than 200 feet (60 960 mm) from the junction of\nthe building drain and building sewer and at intervals of\nnot more than 400 feet (122 m). The interval length shall\nbe measured from the cleanout or manhole opening, along\nthe developed length of the piping to the next drainage\nfitting providing access for cleaning, a manhole or the end\nof the building sewer.\n\n708.1.3 Building drain and building sewer junction.\nThe junction of the building drain and the building sewer\nshall be served by a cleanout that is located at the junction\nor within 10 feet (3048 mm) of the developed length of\npiping upstream of the junction. For the requirements of\nthis section, the removal of the water closet shall not be\nrequired to provide cleanout access.\n\n708.1.4 Changes of direction. Where a horizontal drain-\nage pipe, a building drain or a building sewer has a\nchange of horizontal direction greater than 45 degrees\n(0.79 rad), a cleanout shall be installed at the change of\ndirection. Where more than one change of horizontal\ndirection greater than 45 degrees (0.79 rad) occurs within\n40 feet (12 192 mm) of developed length of piping, the\ncleanout installed for the first change of direction shall\nserve as the cleanout for all changes in direction within\nthat 40 feet (12 192 mm) of developed length of piping.\n\n708.1.5 Cleanout size. Cleanouts shall be the same size\nas the piping served by the cleanout, except that cleanouts\nfor piping larger than 4 inches (102 mm) need not be\nlarger than 4 inches (102 mm).\n\nExceptions:\n\n1. A removable P-trap with slip or ground joint\nconnections can serve as a cleanout for drain\npiping that is one size larger than the P-trap\nsize.\n\n2. Cleanouts located on stacks can be one size\nsmaller than the stack size.\n\n3. The size of cleanouts for cast-iron piping can\nbe in accordance with the referenced standards\nfor cast-iron fittings as indicated in Table\n702.4.\n\n7-7\n"
    },
    {
        "page": 83,
        "text": "SA\n\nNITARY DRAINAGE\n\n708.1.6 Cleanout equivalent. A fixture trap or a fixture\nwith integral trap, removable without altering concealed\npiping, shall be acceptable as a cleanout equivalent.\n\n708.1.7 Cleanout plugs. Cleanout plugs shall be of\ncopper-alloy, plastic or other approved materials. Clea-\nnout plugs for borosilicate glass piping systems shall be\nof borosilicate glass. Copper-alloy cleanout plugs shall\nconform to ASTM A74 and shall be limited for use only\non metallic piping systems. Plastic cleanout plugs sha!\nconform to the referenced standards for plastic pipe\nfittings, as indicated in Table 702.4. Cleanout plugs shall\nhave a raised square head, a countersunk square head or a\ncountersunk slot head. Where a cleanout plug will have a\ntrim cover screw installed into the plug, the plug shall be\nmanufactured with a blind end threaded hole for suc\npurpose.\n\n708.1.8 Manholes. Manholes and manhole covers shall\nbe of an approved type. Manholes located inside of a\nbuilding shall have gas-tight covers that require tools for\nremoval.\n\n708.1.9 Installation arrangement. The installation\narrangement of a cleanout shall enable cleaning of drain-\nage piping only in the direction of drainage flow.\n\nExceptions:\n1. Test tees serving as cleanouts.\n\n2. A two-way cleanout installation that is\napproved for meeting the requirements of\nSection 708.1.3.\n\n708.1.10 Required clearance. Cleanouts for 6-inch (153\nmm) and smaller piping shall be provided with a clear-\nance of not less than 18 inches (457 mm) from, and\nperpendicular to, the face of the opening to any obstruc-\ntion. Cleanouts for 8-inch (203 mm) and larger piping\nshall be provided with a clearance of not less than 36\ninches (914 mm) from, and perpendicular to, the face of\nthe opening to any obstruction.\n\n708.1.11 Cleanout access. Required cleanouts shall not be\ninstalled in concealed locations. For the purposes of this\nsection, concealed locations include, but are not limited to,\nthe inside of plenums, within walls, within floor/ceiling\nassemblies, below grade and in crawl spaces where the\nheight from the crawl space floor to the nearest obstruc-\ntion along the path from the crawl space opening to the\ncleanout location is less than 24 inches (610 mm). Clean-\nouts with openings at a finished wall shall have the face of\nthe opening located within 1'/, inches (38 mm) of the\nfinished wall surface. Cleanouts located below grade shall\nbe extended to grade level so that the top of the cleanout\nplug is at or above grade. A cleanout installed in a floor or\nwalkway that will not have a trim cover installed shall\nhave a countersunk plug installed so the top surface of the\nplug is flush with the finished surface of the floor or\nwalkway.\n\n708.1.11.1 Cleanout plug trim covers. Trim covers\nand access doors for cleanout plugs shall be designed\n\nfor such purposes and shall be approved. Trim cover\nfasteners that thread into cleanout plugs shall be corro-\nsion resistant. Cleanout plugs shall not be covered with\nmortar, plaster or any other permanent material.\n\n708.1.11.2 Floor cleanout assemblies. Where it is\nnecessary to protect a cleanout plug from the loads of\nvehicular traffic, cleanout assemblies in accordance\nwith ASME A112.36.2M shall be installed.\n\n708.1.12 Prohibited use. The use of a threaded cleanout\nopening to add a fixture or to extend piping shall be\nprohibited except where another cleanout of equal size is\ninstalled with the required access and clearance.\n\nSECTION 709\nFIXTURE UNITS\n\n709.1 Values for fixtures. Drainage fixture unit values as\ngiven in Table 709.1 designate the relative load weight of\ndifferent kinds of fixtures that shall be employed in estimat-\ning the total load carried by a soil or waste pipe, and shall be\nused in connection with Tables 710.1(1) and 710.1(2) of\nsizes for soil, waste and vent pipes for which the permissible\nload is given in terms of fixture units.\n\n709.2 Fixtures not listed in Table 709.1. Fixtures not listed\nin Table 709.1 shall have a drainage fixture unit load based\non the outlet size of the fixture in accordance with Table\n709.2. The minimum trap size for unlisted fixtures shall be\nthe size of the drainage outlet but not less than 1'/, inches (32\nmm).\n\nTABLE 709.2\nDRAINAGE FIXTURE UNITS FOR FIXTURE DRAINS OR TRAPS.\n| FIXTURE DRAINORTRAPSIZE——______\nFIXTURE UNIT VALUE\nDRAINAGE\n\niw 1\n\nVW, 2\n\n2 3\n\n2\", 4\n\n3 5\n\n4 6\n\nFor SI: 1 inch = 25.4 mm.\n\n709.3 Conversion of gpm flow to dfu values. Where\ndischarges to a waste receptor or to a drainage system are\nonly known in gallons per minute (liters per second) values,\nthe drainage fixture unit values for those flows shall be\ncomputed on the basis that 1 gpm (0.06 L/s) of flow is equiv-\nalent to two drainage fixture units.\n\n709.4 Values for indirect waste receptor. The drainage\n\nfixture unit load of an indirect waste receptor receiving the\n\ndischarge of indirectly connected fixtures shall be the sum of\nthe drainage fixture unit values of the fixtures that discharge\nto the receptor, but not less than the drainage fixture unit\nvalue given for the indirect waste receptor in Table 709.1 or\n709.2.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 84,
        "text": "TABLE 709.1\n\nSANITARY DRAINAGE\n\nDRAINAGE FIXTURE UNITS FOR FIXTURES AND GROUPS\n\nFIXTURE-_TYPE\n\nDRAINAGE-FIXFURE-UNF—¥ MINIMUM SIZE-OF FRAP—\n\nAutomatic clothes washers, commercial**\n\n>\n\nBat UT ined ii i Wi\n\n—Bathtub? (with or without overhead shower of whirlpool-attachments)\n\ning 21 1.6 gpfy\"\n\nVALUE AS LOAD FACTORS 7 (inches) |\n| 3 2\n2 2\n5 =\n6 =\n2.\n\n— ou os I\n\n| u\nee ee\n+ 2\nI C_I%,_|\n\nDental lavatory\n\nDental unit or cuspidor\n\nDishwashing machine‘, domestic\n\nDrinking fountain\nEmergency floor drain\nFloor drains\"\n\nFloor sinks\n\nKitchen sink, domestic\n\nKitchen sink, domestic with food waste disposer, dishwasher or both\n\nLaundry tray (1 or 2 compartments)\nLavatory\n\nShower (based on the total flow rate through showerheads and body sprays)\n\nflow rate:\n5.7 gpm or less\nGreater than 5.7 gpm to 12.3 gpm\nGreater than 12.3 gpm to 25.8 gpm\nGreater than 25.8 gpm to 55.6 gpm\n\nService sink\n\nSink\n\nUrinal\n\nUrinal, 1 gallon per flush or less\n\nUrinal, nonwater supplied\n\nWash sink (circular or multiple) each set of faucets\nWater closet, flushometer tank, public or private\nWater closet, private (1.6 gpf)\n\nWater closet, private (flushing greater than 1.6 gpf)\nWater closet, public (1.6 gpf)\n\nWater closet, public (flushing greater than 1.6 gpf)\n\nI 17,\n2 1'/\n\" Il,\n0 2\n2h 2\nNote h 2\n2 1\",\n2 1\",\n2 \",\n1 /,\n2 \",\n3 2\n5 3\n6 4\n2 WW,\n2 1\",\n4 Note d\n2° Note d\n\" Note d\n2 1,\n4 Note d\n3° Note d\n4 Note d\n4 Note d\n6° Note d\n\nFor SI: 1 inch = 25.4 mm, | gallon = 3.785 L, gpf= gallon per flushing cycle, 1 gallon per minute (gpm) = 3.785 L/m.\n\n. For traps larger than 3 inches, use Table 709.2.\n\n. Trap size shall be consistent with the fixture outlet size.\n\nenese\n\nlower values are confirmed by testing.\n\noa\n\n. See Sections 709.4 and 709.4.1.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\n. A showerhead over a bathtub or whirlpool bathtub attachment does not increase the drainage fixture unit value.\n. See Sections 709.2 through 709.4.1 for methods of computing unit value of fixtures not listed in this table or forrating of devices with intermittent flows.\n\n. For the purpose of computing loads on building drains and sewers, water closets and urinals shall not be rated at a lower drainage fixture unit unless the\n\nFor fixtures added to a bathroom group, add the dfu value of those additional fixtures to the bathroom group fixture count.\n. See Section 406.2 for sizing requirements for fixture drain, branch drain and drainage stack for an automatic clothes washer standpipe.\n\n7-9\n"
    },
    {
        "page": 85,
        "text": "SANITARY DRAINAGE\n\n709.4.1 Clear-water waste receptors. Where waste\nreceptors such as floor drains, floor sinks and hub drains\nreceive only clear-water waste from display cases, refrig-\nerated display cases, ice bins, coolers and freezers, such\nreceptors shall have a drainage fixture unit value of one-\nhalf.\n\nSECTION 710\nDRAINAGE SYSTEM SIZING\n\n710.1 Maximum fixture unit load. The maximum number\nof drainage fixture units connected to a given size of build-\ning sewer, building drain or horizontal branch of the\nbuilding drain shall be determined using Table 710.1(1). The\nmaximum number of drainage fixture units connected to a\ngiven size of horizontal branch or vertical soil or waste stack\nshall be determined using Table 710.1(2).\n\n710.1.1 Horizontal stack offsets. Horizontal stack\noffsets shall be sized as required for building drains in\naccordance with Table 710.1(1), except as required by\nSection 711.3.\n\n710.1.2 Vertical stack offsets. Vertical stack offsets shall\nbe sized as required for straight stacks in accordance with\nTable 710.1(2), except where required to be sized as a\nbuilding drain in accordance with Section 711.1.1.\n\n710.2 Future fixtures. Where provision is made for the\nfuture installation of fixtures, those provided for shall be\nconsidered in determining the required sizes of drain pipes.\n\nSECTION 711\nOFFSETS IN DRAINAGE PIPING\nIN BUILDINGS OF FIVE STORIES OR MORE\n\n711.1 Horizontal branch connections above or below\nvertical stack offsets. If a horizontal branch connects to the\nstack within 2 feet (610 mm) above or below a vertical stack\noffset, and the offset is located more than four branch inter-\nvals below the top of the stack, the offset shall be vented in\naccordance with Section 907.\n\n711.1.1 Omission of vents for vertical stack offsets.\nVents for vertical offsets required by Section 711.1 shall\nnot be required where the stack and its offset are sized as\na building drain [see Table 710.1(1)].\n\n711.2 Horizontal stack offsets. A stack with a horizontal\noffset located more than four branch intervals below the top\nof the stack shall be vented in accordance with Section 907\nand sized as follows:\n\n1. The portion of the stack above the offset shall be\nsized as for a vertical stack based on the total number\nof drainage fixture units above the offset.\n\n2. The offset shall be sized in accordance with Section\n710.1.1.\n\n3. The portion of the stack below the offset shall be\nsized as for the offset or based on the total number of\ndrainage fixture units on the entire stack, whichever\nis larger [see Table 710.1(2), Column 5].\n\n7-10\n\nTABLE 710.1(1)\nBUILDING DRAINS AND SEWERS\n\n| ee\n\nCONNECTED TO ANY PORTION OF THE BUILDING\n\nDIAMETER DRAIN OR THE BUILDING SEWER, INCLUDING\nOF PIPE BRANCHES OF THE BUILDING DRAIN?\n\n_ (inches) lope perfoot\n\ni finch 4toineh 44 inch —|—f, inch _—\nT'7 rf j iT\n1/, — 8 3\n2 — — 21 26\n2'/, _— _— 24 31\n3 — 36 42 50\n4 _— 180 216 250\n5 — 390 480 575\n6 _— 700 840 1,000\n8 1,400 1,600 1,920 2,300\n10 2,500 2,900 3,500 4,200\n12 3,900 4,600 5,600 6,700\n15 7,000 8,300 10,000 12,000\n\nFor SI: 1 inch= 25.4 mm, | inch per foot = 83.3 mm/m.\na. The minimum size of any building drain serving a water closet shall be 3\ninches.\n\nTABLE 710.1(2)\nHORIZONTAL FIXTURE BRANCHES AND STACKS?\n\nROF\ni ru i\nOO OPE. — Totalfor __—‘Total Total for Total for\n(inches) horizontal __ discharge _| stack of stack greater —\nbranch -— intoone —threebranch | than three\nbranch intervals or | branch\n| interval — less | intervals\nT 5 3 | 2 4 | 8\n2 6 6 10 24\n2\", 12 9 20 42\n3 20 20 48 72\n4 160 90 240 500\n5 360 200 540 1,100\n6 620 350 960 1,900\n8 1,400 600 2,200 3,600\n10 2,500 1,000 3,800 5,600\n12 3,900 1,500 6,000 8,400\n15 7,000 Notec Note c Note c\n\nFor SI:1 inch = 25.4 mm.\n\na. Does not include branches of the building drain. Refer to Table 710.1(1).\n\nb. Stacks shall be sized based on the total accumulated connected load at\neach story or branch interval. As the total accumulated connected load\ndecreases, stacks are permitted to be reduced in size. Stack diameters\nshall not be reduced to less than one-half of the diameter of the largest\nstack size required.\n\nc. Sizing load based on design criteria.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 86,
        "text": "This File is Uploaded By\n\n4MechEngineer.com\nWIKIMEP.com\n\ny/|\n(AY MECHANICAL\nOA ENGINEER\n\nYou can Follow US\n\nBB acebook/4MechEngineer in Linked-in/4MechEngineer\nYou\n(©) Instagram/4MechEngineer Cy cuTube/4MechEngineer\n\n[4 Google+/4MechEngineer Pa rwitter/4MechEngineer\n\n"
    },
    {
        "page": 87,
        "text": "711.2.1 Omission of vents for horizontal stack offsets.\nVents for horizontal stack offsets required by Section\n711.2 shall not be required where the stack and its offset\nare one pipe size larger than required for a building drain\n[see Table 710.1(1)] and the entire stack and offset are not\nless in cross-sectional area than that required for a straight\nstack plus the area of an offset vent as provided for in\nSection 907.\n\n711.3 Offsets below lowest branch. Where a vertical offset\noccurs in a soil or waste stack below the lowest horizontal\nbranch, a change in diameter of the stack because of the\noffset shall not be required. If a horizontal offset occurs in a\nsoil or waste stack below the lowest horizontal branch, the\nrequired diameter of the offset and the stack below it shall be\ndetermined as for a building drain in accordance with Table\n710.1(1).\n\nSECTION 712\nSUMPS AND EJECTORS\n\n712.1 Building subdrains. Building subdrains that cannot\nbe discharged to the sewer by gravity flow shall be\ndischarged into a tightly covered and vented sump from\nwhich the liquid shall be lifted and discharged into the build-\ning gravity drainage system by automatic pumping\nequipment or other approved method. In other than existing\nstructures, the sump shall not receive drainage from any\npiping within the building capable of being discharged by\ngravity to the building sewer.\n\n712.2 Valves required. A check valve and a full open valve\nlocated on the discharge side of the check valve shall be\ninstalled in the pump or ejector discharge piping between the\npump or ejector and the gravity drainage system. Access\nshall be provided to such valves. Such valves shall be\nlocated above the sump cover required by Section 712.1 or,\nwhere the discharge pipe from the ejector is below grade, the\nvalves shall be accessibly located outside the sump below\ngrade in an access pit with a removable access cover.\n\n712.3 Sump design. The sump pump, pit and discharge\npiping shall conform to the requirements of Sections 712.3.1\nthrough 712.3.5.\n\n712.3.1 Sump pump. The sump pump capacity and head\nshall be appropriate to anticipated use requirements.\n\n712.3.2 Sump pit. The sump pit shall be not less than 18\ninches (457 mm) in diameter and not less than 24 inches\n(610 mm) in depth, unless otherwise approved. The pit\nshall be provided with access and shall be located such\nthat all drainage flows into the pit by gravity. The sump\npit shall be constructed of tile, concrete, steel, plastic or\nother approved materials. The pit bottom shall be solid\nand provide permanent support for the pump. The sump\npit shall be fitted with a gastight removable cover that is\ninstalled not more than 2 inches (51 mm) below grade or\nfloor level. The cover shall be adequate to support antici-\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nSANITARY DRAINAGE\n\npated loads in the area of use. The sump pit shall be\nvented in accordance with Chapter 9.\n\n712.3.3 Discharge pipe and fittings. Discharge pipe and\nfittings serving sump pumps and ejectors shall be\nconstructed of materials in accordance with Sections\n712.3.3.1 and 712.3.3.2.\n\n712.3.3.1 Materials. Pipe and fitting materials shall be\nconstructed of copper or copper-alloy, CPVC, ductile\niron, PE, or PVC.\n\n712.3.3.2 Ratings. Pipe and fittings shall be rated for\nthe maximum system operating pressure and tempera-\nture. Pipe fitting materials shall be compatible with the\npipe material. Where pipe and fittings are buried in the\nearth, they shall be suitable for burial.\n\n712.3.4 Maximum effluent level. The effluent level\ncontrol shall be adjusted and maintained to at all times\nprevent the effluent in the sump from rising to within 2\ninches (51 mm) of the invert of the gravity drain inlet into\nthe sump.\n\n712.3.5 Pump connection to the drainage system.\nPumps connected to the drainage system shall connect to\na building sewer, building drain, soil stack, waste stack or\nhorizontal branch drain. Where the discharge line\nconnects into horizontal drainage piping, the connection\nshall be made through a wye fitting into the top of the\ndrainage piping and such wye fitting shall be located not\nless than 10 pipe diameters from the base of any soil\nstack, waste stack or fixture drain.\n\n712.4 Sewage pumps and sewage ejectors. A sewage pump\nor sewage ejector shall automatically discharge the contents\nof the sump to the building drainage system.\n\n712.4.1 Macerating toilet systems. Macerating toilet\nsystems shall comply with ASME A112.3.4/CSA B45.9\nand shall be installed in accordance with the manufac-\nturer’s instructions.\n\n712.4.2 Capacity. A sewage pump or sewage ejector\nshall have the capacity and head for the application\nrequirements. Pumps or ejectors that receive the\ndischarge of water closets shall be capable of handling\nspherical solids with a diameter of up to and including 2\ninches (51 mm). Other pumps or ejectors shall be capable\nof handling spherical solids with a diameter of up to and\nincluding '/, inch (13 mm). The capacity of a pump or\nejector based on the diameter of the discharge pipe shall\nbe not less than that indicated in Table 712.4.2.\n\nExceptions:\n\n1. Grinder pumps or grinder ejectors that receive\nthe discharge of water closets shall have a\ndischarge opening of not less than 1'/, inches\n(32 mm).\n\n2. Macerating toilet assemblies that serve single\nwater closets shall have a discharge opening of\nnot less than */, inch (19.1 mm).\n\n7-11\n"
    },
    {
        "page": 88,
        "text": "SANITARY DRAINAGE\n\nTABLE 712.4.2\nMINIMUM CAPACITY OF\nSEWAGE PUMP OR SEWAGE EJECTOR\n\nCAPACITY OF PUMP\n\nOR EJECTOR (gpm)\n2 21\n2\", 30\n3 46\n\nFor SI: 1 inch = 25.4 mm, | gallon per minute = 3.785 L/m.\n\nSECTION 713\nCOMPUTERIZED DRAINAGE DESIGN\n\n713.1 Design of drainage system. The sizing, design and\nlayout of the drainage system shall be permitted to be\ndesigned by approved computer design methods.\n\n713.2 Load on drainage system. The load shall be\ncomputed from the simultaneous or sequential discharge\nconditions from fixtures, appurtenances and appliances or\nthe peak usage design condition.\n\n713.2.1 Fixture discharge profiles. The discharge\nprofiles for flow rates versus time from fixtures and appli-\nances shall be in accordance with the manufacturer’s\nspecifications.\n\n713.3 Selections of drainage pipe sizes. Pipe shall be sized\nto prevent full-bore flow.\n\n713.3.1 Selecting pipe wall roughness. Pipe size calcula-\ntions shall be conducted with the pipe wall roughness\nfactor (ks), in accordance with the manufacturer’s specifi-\ncations and as modified for aging roughness factors with\ndeposits and corrosion.\n\n713.3.2 Slope of horizontal drainage piping. Horizontal\ndrainage piping shall be designed and installed at slopes\nin accordance with Table 704.1.\n\nSECTION 714\nBACKWATER VALVES\n\n714.1 Sewage backflow. Where plumbing fixtures are\ninstalled on a floor with a finished floor elevation below the\nelevation of the manhole cover of the next upstream manhole\nin the public sewer, such fixtures shall be protected by a\nbackwater valve installed in the building drain, or horizontal\nbranch serving such fixtures. Plumbing fixtures installed on\na floor with a finished floor elevation above the elevation of\nthe manhole cover of the next upstream manhole in the\npublic sewer shall not discharge through a backwater valve.\n\nException: In existing buildings, fixtures above the\nelevation of the manhole cover of the next upstream\nmanhole in the public sewer shall not be prohibited from\ndischarging through a backwater valve.\n\n714.2 Material. Backwater valves shall comply with ASME\nA112.14.1, CSA B181.1 or CSA B181.2.\n\n714.3 Location. Backwater valves shall be installed so that\naccess is provided to the working parts.\n\n7-12\n\nSECTION 715\nVACUUM DRAINAGE SYSTEMS\n\n715.1 Scope. Vacuum drainage systems shall be in accor-\ndance with Sections 715.2 through 715.4.\n\n715.2 System design. Vacuum drainage systems shall be\ndesigned in accordance with the vacuum drainage system\nmanufacturer’s instructions. The system layout, including\npiping layout, tank assemblies, vacuum pump assembly and\nother components necessary for proper function of the\nsystem shall be in accordance with the manufacturer’s\ninstructions. Plans, specifications and other data for such\nsystems shall be submitted to the code official for review and\napproval prior to installation.\n\n715.2.1 Fixtures. Gravity-type fixtures installed in\nvacuum drainage systems shall comply with Chapter 4.\n\n715.2.2 Drainage fixture units. Drainage fixture units\nfor gravity drainage systems that discharge into, or\nreceive discharge from, vacuum drainage systems shall be\nbased on the values in this chapter.\n\n715.2.3. Water supply fixture units. Water supply\nfixture units shall be based on the values in Chapter 6 of\nthis code, except that the water supply fixture unit for a\nvacuum-type water closet shall be 1.\n\n715.2.4 Traps and cleanouts. Gravity drainage fixtures\nshall be provided with traps and cleanouts in accordance\nwith this chapter and Chapter 10.\n\n715.2.5 Materials. Vacuum drainage pipe, fitting and\nvalve materials shall be in accordance with the vacuum\ndrainage system manufacturer’s instructions and the\nrequirements of this chapter.\n\n715.3 Testing and demonstrations. After completion of the\nentire system installation, the system shall be subjected to a\nvacuum test of 19 inches (483 mm) of mercury and shall be\noperated to function as required by the code official and the\nmanufacturer of the vacuum drainage system. Recorded\nproof of all tests shall be submitted to the code official.\n\n715.4 Written instructions. Written instructions for the\noperation, maintenance, safety and emergency procedures\nshall be provided to the building owner. The code official\nshall verify that the building owner is in receipt of such\ninstructions.\n\nSECTION 716\nREPLACEMENT OF UNDERGROUND\nBUILDING SEWERS AND BUILDING\nDRAINS BY PIPE-BURSTING METHODS\n\n716.1 General. This section shall govern the replacement of\nexisting building sewer and building drain piping by pipe-\nbursting methods.\n\n716.2 Applicability. The replacement of building sewer and\nbuilding drain piping by pipe-bursting methods shall be\nlimited to gravity drainage piping of sizes 6 inches (152 mm)\nand smaller. The replacement piping shall be of the same\nnominal size as the existing piping.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 89,
        "text": "716.3 Pre-installation inspection. The existing piping\nsections to be replaced shall be inspected internally by a\nrecorded video camera survey. The survey shall include\nnotations of the position of cleanouts and the depth of\nconnections to the existing piping.\n\n716.4 Pipe. The replacement pipe shall be made of high-\ndensity polyethylene (HDPE) and shall have a standard\ndimension ratio (SDR) of 17. The pipe shall be in compli-\nance with ASTM F714.\n\n716.5 Pipe fittings. Pipe fittings to be connected to the\nreplacement pipe shall be made of high-density polyethylene\n(HDPE) and shall be in compliance with ASTM D2683.\n\n716.6 Cleanouts. Where the existing building sewer or\nbuilding drain did not have cleanouts meeting the require-\nments of this code, cleanout fittings shall be installed as\nrequired by this code.\n\n716.7 Post-installation inspection. The completed replace-\nment piping section shall be inspected internally by a\nrecorded video camera survey. The video survey shall be\nreviewed and approved by the code official prior to pressure\ntesting of the replacement piping system.\n\n716.8 Pressure testing. The replacement piping system as\nwell as the connections to the replacement piping shall be\ntested in accordance with Section 312.\n\nSECTION 717\nRELINING BUILDING SEWERS\nAND BUILDING DRAINS\n\n717.1 General. This section shall govern the relining of\nexisting building sewers and building drainage piping.\n\n717.2, Applicability. The relining of existing building\nsewers and building drainage piping shall be limited to grav-\nity drainage piping 4 inches (102 mm) in diameter and\nlarger. The relined piping shall be of the same nominal size\nas the existing piping.\n\n717.3 Preinstallation requirements. Prior to commence-\nment of the relining installation, the existing piping sections\nto be relined shall be descaled and cleaned. After the clean-\ning process has occurred and water has been flushed through\nthe system, the piping shall be inspected internally by a\nrecorded video camera survey.\n\n717.3.1 Preinstallation recorded video camera survey.\nThe video survey shall include verification of the project\naddress location. The video shall include notations of the\ncleanout and fitting locations, and the approximate depth\nof the existing piping. The video shall also include nota-\ntions of the length of piping at intervals not greater than\n25 feet (7620 mm).\n\n717.4 Permitting. Prior to permit issuance, the code official\nshall review and evaluate the preinstallation recorded video\ncamera survey to determine if the piping system is able to be\nrelined in accordance with the proposed lining system manu-\nfacturer’s installation requirements and applicable\nreferenced standards.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nSANITARY DRAINAGE\n\n717.5 Prohibited applications. Where review of the prein-\nstallation recorded video camera survey reveals that piping\nsystems are not installed correctly or defects exist, relining\nshall not be permitted. The defective portions of piping shall\nbe exposed and repaired with pipe and fittings in accordance\nwith this code. Defects include, but are not limited to, back-\ngrade or insufficient slope, complete pipe wall deterioration\nor complete separations such as from tree root invasion or\nimproper support.\n\n717.6 Relining materials. The relining materials shall be\nmanufactured in compliance with applicable standards and\ncertified as required in Section 303. Fold-and-form pipe\nreline materials shall be manufactured in compliance with\nASTM F1504 or ASTM F1871.\n\n717.7 Installation. The installation of relining materials\nshall be performed in accordance with the manufacturer's\ninstallation instructions, applicable referenced standards and\nthis code.\n\n717.7.1 Material data report. The installer shall record\nthe data as required by the relining material manufacturer\nand applicable standards. The recorded data shall include\nbut is not limited to the location of the project, relining\nmaterial type, amount of product installed and conditions\nof the installation. A copy of the data report shall be\nprovided to the code official prior to final approval.\n\n717.8 Post-installation recorded video camera survey.\nThe completed, relined piping system shall be inspected\ninternally by a recorded video camera survey after the\nsystem has been flushed and flow-tested with water. The\nvideo survey shall be submitted to the the code official prior\nto finalization of the permit. The video survey shall be\nreviewed and evaluated to provide verification that no\ndefects exist. Any defects identified shall be repaired and\nreplaced in accordance with this code.\n\n717.9 Certification. A certification shall be provided in\nwriting to the code official, from the permit holder, that the\nrelining materials have been installed in accordance with the\nmanufacturer’s installation instructions, the applicable stan-\ndards and this code.\n\n717.10 Approval. Upon verification of compliance with the\nrequirements of Sections 717.1 through 717.9, the code offi-\ncial shall approve the installation.\n\nSECTION 718\nREHABILITATION OF\nBUILDING SEWERS AND BUILDING DRAINS\n\n718.1 Cure-in-place. Sectional cure-in-place rehabilitation\nof building sewer piping and sewer service lateral piping\nshall be in accordance with ASTM F2599. Main and lateral\ncure-in-place rehabilitation of building sewer and sewer\nservice lateral pipe and their connections to the main sewer\npipe shall be in accordance with ASTM F2561. Hydrophilic\nrings or gaskets in cure-in-place rehabilitation of building\nsewer piping and sewer service laterals shall be in accor-\ndance with ASTM F3240 to ensure water tightness and\nelimination of ground water penetration.\n\n7-13\n"
    },
    {
        "page": 90,
        "text": "2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 91,
        "text": "CHAPTER 8\nINDIRECT/SPECIAL WASTE\n\nUser note:\n\nAbout this chapter: There are drainage applications in buildings where a backup of liquid waste in a drainage system could contaminate\nequipment and appliances. Chapter 8 covers the applications that require an indirect discharge connection to the building's drainage\nsystem. The chapter has provisions for the types of indirect connections and waste receptor configurations.\n\nSECTION 801\nGENERAL\n\n801.1 Scope. This chapter shall govern matters concerning\nindirect waste piping and special wastes. This chapter shall\nfurther control matters concerning food-handling establish-\nments, sterilizers, humidifiers, clear-water waste, swimming\npools, methods of providing air breaks or air gaps, and\nneutralizing devices for corrosive wastes.\n\n801.2 Protection. Devices, appurtenances, appliances and\napparatus intended to serve some special function, such as\nsterilization, humidification, distillation, processing, cool-\ning, or storage of ice or foods, and that discharge to the\ndrainage system, shall be provided with protection against\nbackflow, flooding, fouling, contamination and stoppage of\nthe drain.\n\nSECTION 802\nINDIRECT WASTES\n\n802.1 Where required. Food-handling equipment, in other\nthan dwelling units, clear-water waste, humidifiers, dish-\nwashing machines and utensils, pots, pans and dishwashing\nsinks shall discharge through an indirect waste pipe as speci-\nfied in Sections 802.1.1 through 802.1.7. Fixtures not\nrequired to be indirectly connected by this section and the\nexception to Section 301.6 shall be directly connected to the\nplumbing system in accordance with Chapter 7.\n\n802.1.1 Food handling. Equipment and fixtures utilized\nfor the storage, preparation and handling of food shall\ndischarge through an indirect waste pipe by means of an\nair gap. Each well of a multiple-compartment sink shall\ndischarge independently to a waste receptor.\n\n802.1.2 Floor drains in food storage areas. Floor drains\nlocated within walk-in refrigerators or freezers in food\nservice and food establishments shall be indirectly\nconnected to the sanitary drainage system by means of an\nair gap. Where a floor drain is located within an area\nsubject to freezing, the waste line serving the floor drain\nshall not be trapped and shall indirectly discharge into a\nwaste receptor located outside of the area subject to\nfreezing.\n\nException: Where protected against backflow by a\nbackwater valve, such floor drains shall be indirectly\nconnected to the sanitary drainage system by means of\nan air break or an air gap.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\n802.1.3 Potable clear-water waste. Where devices and\nequipment, such as sterilizers and relief valves, discharge\npotable water to the building drainage system, the\ndischarge shall be through an indirect waste pipe by\nmeans of an air gap.\n\n802.1.4 Swimming pools. Where wastewater from swim-\nming pools, backwash from filters and water from pool\ndeck drains discharge to the building drainage system, the\ndischarge shall be through an indirect waste pipe by\nmeans of an air gap.\n\n802.1.5 Nonpotable clear-water waste. Where devices\nand equipment such as process tanks, filters, drips and\nboilers discharge nonpotable water to the building drain-\nage system, the discharge shall be through an indirect\nwaste pipe by means of an air break or an air gap.\n\n802.1.6 Commercial dishwashing machines. The\ndischarge from a commercial dishwashing machine shall\nbe through an air gap or air break into a waste receptor in\naccordance with Section 802.3.\n\n802.1.7 Food utensils, dishes, pots and pans sinks.\nSinks, in other than dwelling units, used for the washing,\nrinsing or sanitizing of utensils, dishes, pots, pans or\nservice ware used in the preparation, serving or eating of\nfood shall discharge indirectly through an air gap or an\nair break to the drainage system.\n\n802.2 Material, joints and connections. The materials,\njoints, connections and methods utilized for the construction\nand installation of indirect waste piping systems shall\ncomply with the applicable provisions of Chapter 7.\n\n802.3 Installation. Indirect waste piping shall discharge\nthrough an air gap or air break into a waste receptor. Waste\nreceptors shall be trapped and vented and shall connect to the\nbuilding drainage system. Indirect waste piping that exceeds\n30 inches (762 mm) in developed length measured horizon-\ntally, or 54 inches (1372 mm) in total developed length, shall\nbe trapped.\n\nException: Where a waste receptor receives only clear-\nwater waste and does not directly connect to a sanitary\ndrainage system, the receptor shall not require a trap.\n\n802.3.1 Air gap. The air gap between the indirect waste\npipe and the flood level rim of the waste receptor shall be\nnot less than twice the effective opening of the indirect\nwaste pipe.\n\n8-1\n"
    },
    {
        "page": 92,
        "text": "INDIRECT/SPECIAL WASTE\n\n802.3.2 Air break. An air break shall be provided\nbetween the indirect waste pipe and the trap seal of the\nwaste receptor.\n\n802.4 Waste receptors. For other than hub drains that\nreceive only clear-water waste and standpipes, a removable\nstrainer or basket shall cover the outlet of waste receptors.\nWaste receptors shall not be installed in concealed spaces.\nWaste receptors shall not be installed in plenums, crawl\nspaces, attics, interstitial spaces above ceilings and below\nfloors. Ready access shall be provided to waste receptors.\n\n802.4.1 Size of receptors. A waste receptor shall be sized\nfor the maximum discharge of all indirect waste pipes\nserved by the receptor. Receptors shall be installed to\nprevent splashing or flooding.\n\n802.4.2 Hub drains. A hub drain shall be in the form of a\nhub or a pipe extending not less than 1 inch (25 mm)\nabove a water-impervious floor.\n\n802.4.3 Standpipes. Standpipes shall be individually\ntrapped. Standpipes shall extend not less than 18 inches\n(457 mm) but not greater than 42 inches (1067 mm)\nabove the trap weir. Access shall be provided to stand-\npipes and drains for rodding.\n\n802.4.3.1 Connection of laundry tray to standpipe.\nAs an alternative for a laundry tray fixture connecting\ndirectly to a drainage system, a laundry tray waste line\nwithout a fixture trap shall connect to a standpipe for\nan automatic clothes washer drain. The standpipe shall\nextend not less than 30 inches (762 mm) above the\nweir of the standpipe trap and shall extend above the\nflood level rim of the laundry tray. The outlet of the\nlaundry tray shall not be greater than 30 inches (762\nmm) horizontal distance from the side of the\nstandpipe.\n\nSECTION 803\nSPECIAL WASTES\n\n803.1 Neutralizing device required for corrosive wastes.\nCorrosive liquids, spent acids or other harmful chemicals\nthat destroy or injure a drain, sewer, soil or waste pipe, or\ncreate noxious or toxic fumes or interfere with sewage treat-\nment processes shall not be discharged into the plumbing\nsystem without being thoroughly diluted, neutralized or\ntreated by passing through an approved dilution or neutraliz-\ning device. Such devices shall be automatically provided\nwith a sufficient supply of diluting water or neutralizing\nmedium so as to make the contents noninjurious before\ndischarge into the drainage system. The nature of the corro-\nsive or harmful waste and the method of its treatment or\ndilution shall be approved prior to installation.\n\n803.2 System design. A chemical drainage and vent system\nshall be designed and installed in accordance with this code.\nChemical drainage and vent systems shall be completely\nseparated from the sanitary systems. Chemical waste shall\nnot discharge to a sanitary drainage system until such waste\nhas been treated in accordance with Section 803.1.\n\n8-2\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 93,
        "text": "CHAPTER 9\nVENTS\n\nUser note:\n\nAbout this chapter: Chapter 9 regulates connection locations, various venting system arrangements and the sizing of piping for vent\nsystems. The proper operation of a gravity flow drainage system (Chapter 7) depends on maintaining an air path throughout the system to\nprevent waste and odor “blow back” into fixtures and siphoning of the trap seal in fixture traps (Chapter 10).\n\nSECTION 901\nGENERAL\n\n901.1 Scope. The provisions of this chapter shall govern the\nmaterials, design, construction and installation of vent\nsystems.\n\n901.2 Trap seal protection. The plumbing system shall be\nprovided with a system of vent piping that will permit the\nadmission or emission of air so that the seal of any fixture\ntrap shall not be subjected to a pressure differential of more\nthan 1 inch of water column (249 Pa).\n\n901.2.1 Venting required. Traps and trapped fixtures\nshall be vented in accordance with one of the venting\nmethods specified in this chapter.\n\n901.3 Chemical waste vent systems. The vent system for a\nchemical waste system shall be independent of the sanitary\nvent system and shall terminate separately through the roof\nto the outdoors or to an air admittance valve that complies\nwith ASSE 1049. Air admittance valves for chemical waste\nsystems shall be constructed of materials approved in accor-\ndance with Section 702.6 and shall be tested for chemical\nresistance in accordance with ASTM F1412.\n\n901.4 Use limitations. The plumbing vent system shall not\nbe utilized for purposes other than the venting of the plumb-\ning system.\n\n901.5 Tests. The vent system shall be tested in accordance\nwith Section 312.\n\n901.6 Engineered systems. Engineered venting systems\nshall conform to the provisions of Section 919.\n\nSECTION 902\nMATERIALS\n\n902.1 Vents. The materials and methods utilized for the\nconstruction and installation of venting systems shall comply\nwith the applicable provisions of Section 702.\n\n902.2 Sheet copper. Sheet copper for vent pipe flashings\nshall conform to ASTM B152 and shall weigh not less than 8\nounces per square foot (2.5 kg/m’).\n\n902.3 Sheet lead. Sheet lead for vent pipe flashings shall\nweigh not less than 3 pounds per square foot (15 kg/m’) for\nfield-constructed flashings and not less than 2'/, pounds per\nsquare foot (12 kg/m’) for prefabricated flashings.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nSECTION 903\nVENT TERMINALS\n\n903.1 Vent terminal required. The vent pipe shall termi-\nnate by extending to the outdoors through the roof or the side\nwall in accordance with one of the methods identified in\nSections 903.1.1 through 903.1.4.\n\n903.1.1 Roof extension unprotected. Open vent pipes\nthat extend through a roof shall be terminated not less\nthan [NUMBER] inches (mm) above the roof.\n\n903.1.2 Roof used for recreational or assembly\npurposes. Where a roof is to be used as a promenade,\nrestaurant, bar, or sunbathing deck, as an observation\ndeck, or for similar purposes, open vent pipes shall termi-\nnate not less than 7 feet (2134 mm) above the roof.\n\n903.1.3 Protected vent terminal. Where an open vent\npipe terminates above a sloped roof and is covered by\neither a roof-mounted panel (such as a solar collector or\nphotovoltaic panel mounted over the vent opening) or a\nroof element (such as an architectural feature or a decora-\ntive shroud), the vent pipe shall terminate not less than 2\ninches (51 mm) above the roof surface. Such roof\nelements shall be designed to prevent the adverse effects\nof snow accumulation and wind on the function of the\nvent. The placement of a panel over a vent pipe and the\ndesign of a roof element covering the vent pipe shall\nprovide for an open area for the vent pipe to the outdoors\nthat is not less than the area of the pipe, as calculated from\nthe inside diameter of the pipe. Such vent terminals shall\nbe protected by a method that prevents birds and rodents\nfrom entering or blocking the vent pipe opening.\n\n903.1.4 Sidewall vent terminal. Vent terminals extend-\ning through the wall shall terminate not less than 10 feet\n(3048 mm) from the lot line and 10 feet (3048 mm) above\nthe highest adjacent grade within 10 feet (3048 mm) hori-\nzontally of the vent terminal. Vent terminals shall not\nterminate under the overhang of a structure with soffit\nvents. Sidewall vent terminals shall be protected to\nprevent birds and rodents from entering or blocking the\nvent opening.\n\n903.2 Frost closure. Where the 97.5-percent value for\noutdoor design temperature is O°F (-18°C) or less, vent\nextensions through a roof or wall shall be not less than 3\ninches (76 mm) in diameter. Any increase in the size of the\nvent shall be made not less than 1 foot (305 mm) inside the\nthermal envelope of the building.\n\n9-1\n"
    },
    {
        "page": 94,
        "text": "VENTS\n\n903.3 Flashings. The juncture of each vent pipe with the\nroof line shall be made watertight by an approved flashing.\n\n903.4 Prohibited use. A vent terminal shall not be used for\nany purpose other than a vent terminal.\n\n903.5 Location of vent terminal. An open vent terminal\nfrom a drainage system shall not be located directly beneath\nany door, openable window, or other air intake opening of\nthe building or of an adjacent building, and any such vent\nterminal shall not be within 10 feet (3048 mm) horizontally\nof such an opening unless it is 3 feet (914 mm) or more\nabove the top of such opening.\n\n903.6 Extension outside a structure. In climates where the\n97.5-percent value for outside design temperature is less\nthan 0°F (-18°C), vent pipes installed on the exterior of the\nstructure shall be protected against freezing by insulation,\nheat or both.\n\nSECTION 904\nOUTDOOR VENT EXTENSIONS\n\n904.1 Required vent extension. The vent system serving\neach building drain shall have not less than one vent pipe\nthat extends to the outdoors.\n\n904.1.1 Installation. The required vent shall be a dry vent\nthat connects to the building drain or an extension of a\ndrain that connects to the building drain. Such vent shall\nnot be an island fixture vent as allowed by Section 916.\n\n904.1.2 Size. The required vent shall be sized in accor-\ndance with Section 906.2 based on the required size of the\nbuilding drain.\n\n904.2 Vent stack required. A vent stack shall be required\nfor every drainage stack that has five branch intervals or\nmore.\n\nException: Drainage stacks installed in accordance with\nSection 913.\n\n904.3 Vent termination. Vent stacks or stack vents shall\nterminate outdoors to the open air or to a stack-type air\nadmittance valve in accordance with Section 918.\n\n904.4 Vent connection at base. Vent stacks shall connect to\nthe base of the drainage stack. The vent stack shall connect\nat or below the lowest horizontal branch. Where the vent\nstack connects to the building drain, the connection shall be\nlocated downstream of the drainage stack and within a\ndistance of 10 times the diameter of the drainage stack.\n\n904.5 Vent headers. Stack vents and vent stacks connected\ninto a common vent header at the top of the stacks and\nextending to the open air at one point shall be sized in accor-\ndance with the requirements of Section 906.1. The number\nof fixture units shall be the sum of all fixture units on all\nstacks connected thereto, and the developed length shall be\nthe longest vent length from the intersection at the base of\nthe most distant stack to the vent terminal in the open air, as\na direct extension of one stack.\n\n9-2\n\nSECTION 905\nVENT CONNECTIONS AND GRADES\n\n905.1 Connection. Individual, branch and circuit vents shall\nconnect to a vent stack, stack vent, air admittance valve or\nextend to the open air.\n\n905.2 Grade. Vent and branch vent pipes shall be so graded\nand connected as to drain back to the drainage pipe by\ngravity.\n\n905.3 Vent connection to drainage system. Every dry vent\nconnecting to a horizontal drain shall connect above the\ncenterline of the horizontal drain pipe.\n\n905.4 Vertical rise of vent. Every dry vent shall rise verti-\ncally to a point not less than 6 inches (152 mm) above the\n\nflood level rim of the highest trap or trapped fixture being\n\nvented.\nException: Vents for interceptors located outdoors.\n\n905.5 Height above fixtures. A connection between a vent\npipe and a vent stack or stack vent shall be made at not less\nthan 6 inches (152 mm) above the flood level rim of the high-\nest fixture served by the vent. Horizontal vent pipes forming\nbranch vents, relief vents or loop vents shall be located not\nless than 6 inches (152 mm) above the flood level rim of the\nhighest fixture served.\n\n905.6 Vent for future fixtures. Where the drainage piping\nhas been roughed-in for future fixtures, a rough-in connec-\ntion for a vent shall be installed. The vent size shall be not\nless than one-half the diameter of the rough-in drain to be\nserved. The vent rough-in shall connect to the vent system,\nor shall be vented by other means as provided for in this\nchapter. The connection shall be identified to indicate that it\nis a vent.\n\nSECTION 906\nVENT PIPE SIZING\n\n906.1 Size of stack vents and vent stacks. The minimum\nrequired diameter of stack vents and vent stacks shall be\ndetermined from the developed length and the total of drain-\nage fixture units connected thereto in accordance with Table\n906.1, but in no case shall the diameter be less than one-half\nthe diameter of the drain served or less than 1'/, inches (32\nmm).\n\n906.2 Vents other than stack vents or vent stacks. The\ndiameter of individual vents, branch vents, circuit vents and\nrelief vents shall be not less than one-half the required diam-\neter of the drain served. The required size of the drain shall\nbe determined in accordance with Table 710.1(2). Vent pipes\nshall be not less than 1'/, inches (32 mm) in diameter. Vents\nexceeding 40 feet (12 192 mm) in developed length shall be\nincreased by one nominal pipe size for the entire developed\nlength of the vent pipe. Relief vents for soil and waste stacks\nin buildings having more than 10 branch intervals shall be\nsized in accordance with Section 908.2.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 95,
        "text": "TABLE 906.1\nSIZE AND DEVELOPED LENGTH OF STACK VENTS AND VENT STACKS\n\nVENTS\n\nDIAW HERR OF TOTAL FIXTURE saeemiWUM DEVELOPED LENGTH OF VENT (feet) S78 METER OF eT REIge\nSOIL OR E §T@CK UNITS BEING\nHL a ace UN arc yy, SUDEP. Pag tn, Mm jul rae\n\nrv i eee 2 HMA E\nmo | ‘ eo r7->t bo ot bt m@ & mit\n\naie ‘ = 30 F100! ee ee ee ee |\naes ML - - -)-)- Pe ee ee ee\n2 1 12 je— 875 1 2008 — 8B ' = i] ul Uy\n\n2 I 20 (30 4p 50 4 1508 1 | Hi—t\n‘idee Wm hw 2 8 00 300 m= - at ----\n3 1 10 a H 42 8 150 #360 41,0408 = r HI \\\n\n3 1 21 mw — 6 32 8 11048 2708 8108 = | Hl I\n\n3 1 53 i 27 4, 94 g 230 g 680 y a | an i\nee 102 =m 0 25 1 86 1 210 | 620 P—— mm TO a a\n4 B — 35 85 250 * «980 __ T T I\n\n4 140 27 65 200 750\n\n4 320 23 55 170 640 —\n\n4 540 21 50 150 580\n\n5 190 — 28 82 320 990\n\n5 490 21 63 250 760\n\n5 940 — —_— 18 53 210 670 —_— —_ — _\n5 1,400 16 49 190 590\n\n6 500 33 130 400 1,000\n\n6 1,100 —_ — — —_ 26 100 310 780 _ _ —\n6 2,000 22 84 260 660\n\n6 2,900 20 77 240 600 —\n\n8 1,800 31 95 240 940 —  —\n8 3,400 —_— 24 B 190 729\n\n8 5,600 20 62 «160 «610 —\n\n8 7,600 18 56 «140 560\n10 4,000 31 78 310 960\n\n10 7,200 24 60 240 740\n\n10 11,000 20 51 200 630 _\n10 15,000 18 46 180 571\n\n12 7,300 31 120 380 940\n12 13,000 24 94 300 720\n12 20,000 20 79 250 610\n12 26,000 18 72 230 500\n15 15,000 40 130 310\n15 25,000 — 31 96 240\n15 38,000 26 81 200\n15 50,000 24 74 180\nFor SI: 1 inch =25.4mm, | foot = 304.8 mm.\na. The developed length shall be measured from the vent connection to the open air.\n2021 INTERNATIONAL PLUMBING CODE® 93\n"
    },
    {
        "page": 96,
        "text": "VENTS\n\n906.3 Developed length. The developed length of individ-\nual, branch, circuit and relief vents shall be measured from\nthe farthest point of vent connection to the drainage system\nto the point of connection to the vent stack, stack vent or\ntermination outside of the building.\n\n906.4 Multiple branch vents. Where multiple branch vents\nare connected to a common branch vent, the common\nbranch vent shall be sized in accordance with this section\nbased on the size of the common horizontal drainage branch\nthat is or would be required to serve the total drainage\nfixture unit load being vented.\n\n906.5 Sump vents. Sump vent sizes shall be determined in\naccordance with Sections 906.5.1 and 906.5.2.\n\n906.5.1 Sewage pumps and sewage ejectors other than\npneumatic. Drainage piping below sewer level shall be\nvented in the same manner as that of a gravity system.\nBuilding sump vent sizes for sumps with sewage pumps\nor sewage ejectors, other than pneumatic, shall be deter-\nmined in accordance with Table 906.5.1.\n\n906.5.2 Pneumatic sewage ejectors. The air pressure\nrelief pipe from a pneumatic sewage ejector shall be\nconnected to an independent vent stack terminating as\nrequired for vent extensions through the roof. The relief\npipe shall be sized to relieve air pressure inside the ejector\nto atmospheric pressure, but shall be not less than 1'/,\ninches (32 mm) in size.\n\nSECTION 907\nVENTS FOR STACK OFFSETS\n\n907.1 Vent for horizontal offset of drainage stack. Hori-\nzontal offsets of drainage stacks shall be vented where five\n\nor more branch intervals are located above the offset. The\noffset shall be vented by venting the upper section of the\ndrainage stack and the lower section of the drainage stack.\n\n907.2 Upper section. The upper section of the drainage\nstack shall be vented as a separate stack with a vent stack\nconnection installed in accordance with Section 904.4. The\noffset shall be considered to be the base of the stack.\n\n907.3 Lower section. The lower section of the drainage\nstack shall be vented by a yoke vent connecting between the\noffset and the next lower horizontal branch. The yoke vent\nconnection shall be permitted to be a vertical extension of\nthe drainage stack. The size of the yoke vent and connection\nshall be not less than the size required for the vent stack of\nthe drainage stack.\n\nSECTION 908\nRELIEF VENTS—STACKS OF\nMORE THAN 10 BRANCH INTERVALS\n\n908.1 Where required. Soil and waste stacks in buildings\nhaving more than 10 branch intervals shall be provided with\na relief vent at each tenth interval installed, beginning with\nthe top floor.\n\n908.2 Size and connection. The size of the relief vent shall\nbe equal to the size of the vent stack to which it connects.\nThe lower end of each relief vent shall connect to the soil or\nwaste stack through a wye below the horizontal branch serv-\ning the floor, and the upper end shall connect to the vent\nstack through a wye not less than 3 feet (914 mm) above the\nfloor.\n\nTABLE 906.5.1\nSIZE AND LENGTH OF SUMP VENTS\n\na MAXIMUM DEVELOPED LENGTH Ox feet)”\n\nDiameter of vent (inches)\n\nDISCHARGE\nCAPACITY OF PUMP\n(gpm) 1, iT,\n10 | No limit? Novimit7\n20 | 270 Notimit\n“40 2 160\n60 31 75\n80 16 41\n100 10° 25\n150 Not permitted 10°\n200 Not permitted Not permitted\n250 Not permitted Not permitted\n300 Not permitted Not permitted\n400 Not permitted Not permitted\n500 Not permitted Not permitted\n\nFor SI: 1 inch = 25.4 mm, | foot = 304.8 mm, | gallon per minute = 3.785 L/m.\n\nNot permitted\n\n2 24 3 4\nNo [limit No jimit. No_limit No fimit\nNojlimit Nodlimit No_limit No_limit\nNo limit No limit No limit No limit\n\n270 No limit No limit No limit\n150 380 No limit No limit\n\n97 250 No limit No limit\n\n44 110 370 No limit\n\n20 60 210 No limit\n\n10 36 132 No limit\n\n10° 22 88 380\n\nNot permitted 10° 44 210\n\nNot permitted 24 130\n\na. Developed length plus an appropriate allowance for entrance losses and friction due to fittings, changes in direction and diameter. Suggested allowances\nshall be obtained from NBS Monograph 31 or other approved sources. An allowance of 50 percent of the developed length shall be assumed if a more\n\nprecise value is not available.\nb. Actual values greater than 500 feet.\nc. Less than 10 feet.\n\n9-4\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 97,
        "text": "SECTION 909\nFIXTURE VENTS\n\n909.1 Distance of trap from vent. Each fixture trap shall\nhave a protecting vent located so that the slope and the devel-\noped length in the fixture drain from the trap weir to the vent\nfitting are within the requirements set forth in Table 909.1.\n\nException: The developed length of the fixture drain\nfrom the trap weir to the vent fitting for self-siphoning\nfixtures, such as water closets, shall not be limited.\n\nTABLE 909.1\nMAXIMUM DISTANCE OF FIXTURE TRAP FROM VENT\n\nSIZE OF TRAP (inches) SLOPE (inch per foot) ae\nth : 5\n6\n\n1, \",\n\n2 \"y\n\"5 12\n4 \", 16\n\nFor SI: 1 inch = 25.4 mm, | foot = 304.8 mm, | inch per foot = 83.3 mm/m.\n\n909.2 Venting of fixture drains. The total fall in a fixture\ndrain due to pipe slope shall not exceed the diameter of the\nfixture drain, nor shall the vent connection to a fixture drain,\nexcept for water closets, be below the weir of the trap.\n\n909.3 Crown vent. A vent shall not be installed within two\npipe diameters of the trap weir.\n\nSECTION 910\nINDIVIDUAL VENT\n\n910.1 Individual vent permitted. Each trap and trapped\nfixture is permitted to be provided with an individual vent.\nThe individual vent shall connect to the fixture drain of the\ntrap or trapped fixture being vented.\n\nSECTION 911\nCOMMON VENT\n\n911.1 Individual vent as common vent. An individual vent\nis permitted to vent two traps or trapped fixtures as a\ncommon vent. The traps or trapped fixtures being common\nvented shall be located on the same floor level.\n\n911.2 Connection at the same level. Where the fixture\ndrains being common vented connect at the same level, the\nvent connection shall be at the interconnection of the fixture\ndrains or downstream of the interconnection.\n\n911.3 Connection at different levels. Where the fixture\ndrains connect at different levels, the vent shall connect as a\nvertical extension of the vertical drain. The vertical drain\npipe connecting the two fixture drains shall be considered to\nbe the vent for the lower fixture drain, and shall be sized in\naccordance with Table 911.3. The upper fixture shall not be\na water closet.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nVENTS\n\nTABLE 911.3\nCOMMON VENT SIZES.\n—< 2 maxim viscHarce ‘}\nPIPE SIZE FROM UPPER FIXTURE DRAIN -\n(inches) (dfu) J\n1; 1\n2 4\n2'/, to 3 6\nFor SI: 1 inch = 25.4 mm.\nSECTION 912\nWET VENTING\n\n912.1 Horizontal wet vent permitted. Any combination of\nfixtures within two bathroom groups located on the same\nfloor level is permitted to be vented by a horizontal wet vent.\nThe wet vent shall be considered to be the vent for the\nfixtures and shall extend from the connection of the dry vent\nalong the direction of the flow in the drain pipe to the most\ndownstream fixture drain connection to the horizontal\nbranch drain. Each wet-vented fixture drain shall connect\nindependently to the horizontal wet vent. Only the fixtures\nwithin the bathroom groups shall connect to the wet-vented\nhorizontal branch drain. Any additional fixtures shall\ndischarge downstream of the horizontal wet vent.\n\n912.1.1 Vertical wet vent permitted. Any combination\nof fixtures within two bathroom groups located on the\nsame floor level is permitted to be vented by a vertical\nwet vent. The vertical wet vent shall be considered to be\nthe vent for the fixtures and shall extend from the connec-\ntion of the dry vent down to the lowest fixture drain\nconnection. Each wet-vented fixture shall connect inde-\npendently to the vertical wet vent. Water closet drains\nshall connect at the same elevation. Other fixture drains\nshall connect above or at the same elevation as the water\ncloset fixture drains. The dry-vent connection to the verti-\ncal wet vent shall be an individual or common vent\nserving one or two fixtures.\n\n912.2 Dry vent connection. The required dry-vent connec-\ntion for wet-vented systems shall comply with Sections\n912.2.1 and 912.2.2.\n\n912.2.1 Horizontal wet vent. The dry-vent connection\nfor a horizontal wet-vent system shall be an individual\nvent or a common vent for any bathroom group fixture,\nexcept an emergency floor drain. Where the dry-vent\nconnects to a water closet fixture drain, the drain shall\nconnect horizontally to the horizontal wet-vent system.\nNot more than one wet-vented fixture drain shall\ndischarge upstream of the dry-vented fixture drain\nconnection.\n\n912.2.2 Vertical wet vent. The dry-vent connection for a\nvertical wet-vent system shall be an individual vent or\ncommon vent for the most upstream fixture drain.\n\n9-5\n"
    },
    {
        "page": 98,
        "text": "VENTS\n\n912.3 Size. The dry vent serving the wet vent shall be sized\nased on the largest required diameter of pipe within the\nwet-vent system served by the dry vent. The wet vent shall\ne of a size not less than that specified in Table 912.3, based\non the fixture unit discharge to the wet vent.\n\nTABLE 912.3\nWETVENT SIZE\n\nIZE DRAINAGE FIXTURE UNIT LOAD.\n\n[| _WET- VENT PIPES\n(inches) i |__(dfu)\n3 I\n\n2 4\n2\",\n3 12\n\nFor SI: | inch = 25.4 mm.\n\nSECTION 913\nWASTE STACK VENT\n\n913.1 Waste stack vent permitted. A waste stack shall be\nconsidered to be a vent for all of the fixtures discharging to\nthe stack where installed in accordance with the require-\nments of this section.\n\n913.2 Stack installation. The waste stack shall be vertical,\nand both horizontal and vertical offsets shall be prohibited\nbetween the lowest fixture drain connection and the highest\nfixture drain connection. Fixture drains shall connect sepa-\nrately to the waste stack. The stack shall not receive the\ndischarge of water closets or urinals.\n\n913.3 Stack vent. A stack vent shall be provided for the\nwaste stack. The size of the stack vent shall be not less than\nthe size of the waste stack. Offsets shall be permitted in the\nstack vent, shall be located not less than 6 inches (152 mm)\nabove the flood level of the highest fixture and shall be in\naccordance with Section 905.2. The stack vent shall be\npermitted to connect with other stack vents and vent stacks in\naccordance with Section 904.5.\n\n913.4 Waste stack size. The waste stack shall be sized based\non the total discharge to the stack and the discharge within a\nbranch interval in accordance with Table 913.4. The waste\nstack shall be the same size throughout its length.\n\nTABLE 913.4\nWASTE STACK VENT SIZE\n\nT\n-— _ [— MAMUN RI OF\nFf sTACKSIZE - DRAINAGE FIXTURE UNITS (dfu)\n\n(inches) | Total discharge into Total discharge\nLE _“one-branch-interval—| lor stack\nWw, | l 1,1 __ 2\n2 2 4\n2\", No limit 8\n3 No limit 24\n4 No limit 50\n5 No limit 75\n6 No limit 100\n\nFor SI: | inch = 25.4 mm.\n\n9-6\n\nSECTION 914\nCIRCUIT VENTING\n\n914.1 Circuit vent permitted. Not more than eight fixtures\nconnected to a horizontal branch drain shall be permitted to\nbe circuit vented. Each fixture drain shall connect horizon-\ntally to the horizontal branch being circuit vented. The\nhorizontal branch drain shall be classified as a vent from the\nmost downstream fixture drain connection to the most\nupstream fixture drain connection to the horizontal branch.\n\n914.1.1 Multiple circuit-vented branches. Circuit-\nvented horizontal branch drains are permitted to be\nconnected together. Each group of not more than eight\nfixtures shall be considered to be a separate circuit vent\nand shall conform to the requirements of this section.\n\n914.2 Vent connection. The circuit vent connection shall be\nlocated between the two most upstream fixture drains. The\nvent shall connect to the horizontal branch and shall be\ninstalled in accordance with Section 905. The circuit vent\npipe shall not receive the discharge of any soil or waste.\n\n914.3 Slope and size of horizontal branch. The slope of the\nvent section of the horizontal branch drain shall be not\ngreater than one unit vertical in 12 units horizontal (8.3-\npercent slope). The entire length of the vent section of the\nhorizontal branch drain shall be sized for the total drainage\ndischarge to the branch.\n\n914.3.1 Size of multiple circuit vent. Each separate\ncircuit-vented horizontal branch that is interconnected\nshall be sized independently in accordance with Section\n914.3. The downstream circuit-vented horizontal branch\nshall be sized for the total discharge into the branch,\nincluding the upstream branches and the fixtures within\nthe branch.\n\n914.4 Relief vent. A relief vent shall be provided for circuit-\nvented horizontal branches receiving the discharge of four or\nmore water closets and connecting to a drainage stack that\nreceives the discharge of soil or waste from upper horizontal\nbranches.\n\n914.4.1 Connection and installation. The relief vent\nshall connect to the horizontal branch drain between the\nstack and the most downstream fixture drain of the circuit\nvent. The relief vent shall be installed in accordance with\nSection 905.\n\n914.4.2 Fixture drain or branch. The relief vent is\npermitted to be a fixture drain or fixture branch for\nfixtures located within the same branch interval as the\ncircuit-vented horizontal branch. The maximum\ndischarge to a relief vent shall be four fixture units.\n\n914.5 Additional fixtures. Fixtures, other than the circuit-\nvented fixtures, are permitted to discharge to the horizontal\nbranch drain. Such fixtures shall be located on the same\nfloor as the circuit-vented fixtures and shall be either indi-\nvidually or common vented.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 99,
        "text": "SECTION 915\nCOMBINATION WASTE AND VENT SYSTEM\n\n915.1 Type of fixtures. A combination waste and vent\nsystem shall not serve fixtures other than floor drains, sinks,\nlavatories and drinking fountains. Combination waste and\nvent systems shall not receive the discharge from a clinical\nsink.\n\n915.2 Installation. The only vertical pipe of a combination\nwaste and vent system shall be the connection between the\nfixture drain and the horizontal combination waste and vent\npipe. The vertical distance shall not exceed 8 feet (2438\nmm).\n\n915.2.1 Slope. The slope of a horizontal combination\nwaste and vent pipe shall not exceed one-half unit vertical\nin 12 units horizontal (4-percent slope) and shall be not\nless than that indicated in Table 704.1.\n\n915.2.2 Size and length. The size of a combination waste\nand vent pipe shall be not less than that indicated in Table\n915.2.2. The horizontal length of a combination waste\nand vent system shall be unlimited.\n\nTABLE 915.2.2\nSIZE OF COMBINATION WASTE AND VENT PIPE\n\nDIAMETER PIPE\n\n(inches)\n2 3 4\n2\", 6 26\n3 12 31\n4 20 50\n5 160 250\n6 360 575\n\nFor SI: 1 inch = 25.4 mm,\n\n915.2.3 Connection. The combination waste and vent\nsystem shall be provided with a dry vent connected at any\npoint within the system or the system shall connect to a\nhorizontal drain that serves vented fixtures located on the\nsame floor. Combination waste and vent systems connect-\ning to building drains receiving only the discharge from\none or more stacks shall be provided with a dry vent. The\nvent connection to the combination waste and vent pipe\nshall extend vertically to a point not less than 6 inches\n(152 mm) above the flood level rim of the highest fixture\nbeing vented before offsetting horizontally.\n\n915.2.4 Vent size. The vent shall be sized for the total\ndrainage fixture unit load in accordance with Section\n906.2.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nVENTS\n\n915.2.5 Fixture branch or drain. The fixture branch or\nfixture drain shall connect to the combination waste and\nvent within a distance specified in Table 909.1. The\ncombination waste and vent pipe shall be considered to be\nthe vent for the fixture.\n\nSECTION 916\nISLAND FIXTURE VENTING\n\n916.1 Limitation. Island fixture venting shall not be permit-\nted for fixtures other than sinks and lavatories. Residential\nkitchen sinks with a dishwasher waste connection, a food\nwaste disposer, or both, in combination with the kitchen sink\nwaste, shall be permitted to be vented in accordance with\nthis section.\n\n916.2 Vent connection. The island fixture vent shall connect\nto the fixture drain as required for an individual or common\nvent. The vent shall rise vertically to above the drainage\noutlet of the fixture being vented before offsetting horizon-\ntally or vertically downward. The vent or branch vent for\nmultiple island fixture vents shall extend to a point not less\nthan 6 inches (152 mm) above the highest island fixture\nbeing vented before connecting to the outside vent terminal.\n\n916.3 Vent installation below the fixture flood level rim.\nThe vent located below the flood level rim of the fixture\nbeing vented shall be installed as required for drainage\npiping in accordance with Chapter 7, except for sizing. The\nvent shall be sized in accordance with Section 906.2. The\nlowest point of the island fixture vent shall connect full size\nto the drainage system. The connection shall be to a vertical\ndrain pipe or to the top half of a horizontal drain pipe. Clean-\nouts shall be provided in the island fixture vent to permit\nrodding of all vent piping located below the flood level rim\nof the fixtures. Rodding in both directions shall be permitted\nthrough a cleanout.\n\nSECTION 917\nSINGLE-STACK VENT SYSTEM\n\n917.1 Single-stack vent system permitted. A drainage\nstack shall serve as a single-stack vent system where sized\nand installed in accordance with Sections 917.2 through\n917.9. The drainage stack and branch piping shall be the\nvents for the drainage system. The drainage stack shall have\na stack vent.\n\n917.2 Stack size. Drainage stacks shall be sized in accor-\ndance with Table 917.2. Stacks shall be uniformly sized\nbased on the total connected drainage fixture unit load. The\nstack vent shall be the same size as the drainage stack. A 3-\ninch (76 mm) stack shall serve not more than two water\nclosets.\n\n9-7\n"
    },
    {
        "page": 100,
        "text": "VENTS\n\nTABLE 917.2\nSINGLE STACK SIZE\n\na= MCR\nL STACK SIZE _ x\nStacks less than - piace otectiS Stacks 160 feet and\n\n(inches) in heignt - lessthan 160 — parece era!\n_ 75 feet in height ~ feet in height greater in height\n\n3 NP “NP\n4 225 24 NP\n5 480 225 24\n6 1,015 480 225\n8 2,320 1,015 480\n10 4,500 2,320 1,015\n12 8,100 4,500 2,320\n15 13,600 8,100 4,500\n\nNP =Not permitted.\nFor SI: 1 inch = 25.4 mm, | foot = 304.8 mm.\n\n917.3 Branch size. Horizontal branches connecting to a\nsingle-stack vent system shall be sized in accordance with\nTable 710.1(2). Not more than one water closet shall\ndischarge into a 3-inch (76 mm) horizontal branch at a point\nwithin a developed length of 18 inches (457 mm) measured\nhorizontally from the stack.\n\nWhere a water closet is within 18 inches (457 mm)\nmeasured horizontally from the stack and not more than one\nfixture with a drain size of not more than 1'/, inches (38 mm)\nconnects to a 3-inch (76 mm) horizontal branch, the branch\ndrain connection to the stack shall be made with a sanitary tee.\n\n917.4 Length of horizontal branches. The length of hori-\nzontal branches shall conform to the requirements of\nSections 917.4.1 through 917.4.3.\n\n917.4.1 Water closet connection. Water closet connec-\ntions shall be not greater than 4 feet (1219 mm) in\ndeveloped length measured horizontally from the stack.\n\nException: Where the connection is made with a sani-\ntary tee, the maximum developed length shall be 8 feet\n(2438 mm).\n\n917.4.2 Fixture connections. Fixtures other than water\nclosets shall be located not greater than 12 feet (3657\nmm) in developed length, measured horizontally from the\nstack,\n\n917.4.3 Vertical piping in branch. The length of vertical\npiping in a fixture drain connecting to a horizontal branch\nshall not be considered in computing the fixture’s\ndistance in developed length measured horizontally from\nthe stack.\n\n917.5 Minimum vertical piping size from fixture. The\nvertical portion of piping in a fixture drain to a horizontal\nbranch shall be 2 inches (51 mm). The minimum size of the\nvertical portion of piping for a water-supplied urinal or\nstandpipe shall be 3 inches (76 mm). The maximum vertical\ndrop shall be 4 feet (1219 mm). Fixture drains that are not\nincreased in size, or have a vertical drop in excess of 4 feet\n(1219 mm), shall be individually vented.\n\n917.6 Additional venting required. Additional venting\nshall be provided where more than one water closet\n\n9-8\n\ndischarges to a horizontal branch and where the distance\nfrom a fixture trap to the stack exceeds the limits in Section\n917.4. Where additional venting is required, the fixture(s)\nshall be vented by individual vents, common vents, wet\nvents, circuit vents, or a combination waste and vent pipe.\nThe dry vent extensions for the additional venting shall\nconnect to a branch vent, vent stack, stack vent, air admit-\ntance valve, or shall terminate outdoors.\n\n917.7 Stack offsets. Where fixture drains are not connected\nbelow a horizontal offset in a stack, a horizontal offset shall\nnot be required to be vented. Where horizontal branches or\n\nfixture drains are connected below a horizontal offset in a\n\nstack, the offset shall be vented in accordance with Section\n907. Fixture connections shall not be made to a stack within\n2 feet (610 mm) above or below a horizontal offset.\n\n917.8 Prohibited lower connections. Stacks greater than 2\nbranch intervals in height shall not receive the discharge of\nhorizontal branches on the lower two floors. There shall not\nbe connections to the stack between the lower two floors and\na distance of not less than 10 pipe diameters downstream\nfrom the base of the single stack vented system.\n\n917.9 Sizing building drains and sewers. The building\ndrain and building sewer receiving the discharge of a single\nstack vent system shall be sized in accordance with Table\n710.1(1).\n\nSECTION 918\nAIR ADMITTANCE VALVES\n\n918.1 General. Vent systems utilizing air admittance valves\nshall comply with this section. Stack-type air admittance\nvalves shall conform to ASSE 1050. Individual and branch-\ntype air admittance valves shall conform to ASSE 1051.\n\n918.2 Installation. The valves shall be installed in accor-\ndance with the requirements of this section and the\nmanufacturer’s instructions. Air admittance valves shall be\ninstalled after the DWV testing required by Section 312.2 or\n312.3 has been performed.\n\n918.3 Where permitted. Individual, branch and circuit\nvents shall be permitted to terminate with a connection to an\nindividual or branch-type air admittance valve in accordance\nwith Section 918.3.1. Stack vents and vent stacks shall be\npermitted to terminate to stack-type air admittance valves in\naccordance with Section 918.3.2.\n\n918.3.1 Horizontal branches. Individual and branch-\ntype air admittance valves shall vent only fixtures that are\non the same floor level and connect to a horizontal\nbranch drain. Where the horizontal branch is located\nmore than four branch intervals from the top of the stack,\nthe horizontal branch shall be provided with a relief vent\nthat shall connect to a vent stack or stack vent, or extend\noutdoors to the open air. The relief vent shall connect to\nthe horizontal branch drain between the stack and the\nmost downstream fixture drain connected to the horizon-\ntal branch drain. The relief vent shall be sized in\naccordance with Section 906.2 and installed in accor-\ndance with Section 905. The relief vent shall be permitted\nto serve as the vent for other fixtures.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    }
]