[
    {
        "page": 101,
        "text": "918.3.2 Stack. Stack-type air admittance valves shall be\nprohibited from serving as the vent terminal for vent\nstacks or stack vents that serve drainage stacks having\nmore than six branch intervals.\n\n918.4 Location. Individual and branch-type air admittance\nvalves shall be located not less than 4 inches (102 mm)\nabove the horizontal branch drain or fixture drain being\nvented. Stack-type air admittance valves shall be located not\nless than 6 inches (152 mm) above the flood level rim of the\nhighest fixture being vented. The air admittance valve shall\nbe located within the maximum developed length permitted\nfor the vent. The air admittance valve shall be installed not\nless than 6 inches (152 mm) above insulation materials.\n\n918.5 Access and ventilation. Access shall be provided to\nall air admittance valves. Such valves shall be installed in a\nlocation that allows air to enter the valve.\n\n918.6 Size. The air admittance valve shall be rated in accor-\ndance with the standard for the size of the vent to which the\nvalve is connected.\n\n918.7 Vent required. Within each plumbing system, not\nless than one stack vent or vent stack shall extend outdoors to\nthe open air.\n\n918.8 Prohibited installations. Air admittance valves shall\nnot be installed in nonneutralized special waste systems as\ndescribed in Chapter 8 except where such valves are in\ncompliance with ASSE 1049, are constructed of materials\napproved in accordance with Section 702.5, and are tested\nfor chemical resistance in accordance with ASTM F1412.\nAir admittance valves shall not be located in spaces utilized\nas supply or return air plenums. Air admittance valves shall\nnot be used to vent sumps or tanks except where the vent\nsystem for the sump or tank has been designed by an engi-\nneer. Air admittance valves shall not be installed on outdoor\nvent terminals for the sole purpose of reducing clearances to\ngravity air intakes or mechanical air intakes.\n\nSECTION 919\nENGINEERED VENT SYSTEMS\n919.1 General. Engineered vent systems shall comply with\n\nthis section and the design, submittal, approval, inspection\nand testing requirements of Section 316.\n\nVENTS\n\n919.2 Individual branch fixture and individual fixture\nheader vents. The maximum developed length of individual\nfixture vents to vent branches and vent headers shall be\ndetermined in accordance with Table 919.2 for the minimum\npipe diameters at the indicated vent airflow rates.\n\nThe individual vent airflow rate shall be determined in\naccordance with the following:\n\nO10 = Nin Qv (Equation 9-1)\nFor SI: Q,,,=N,,, Q, (0.4719 Lis)\nwhere:\n\nN,,»= Number of fixtures per header (or vent branch) ~ total\nnumber of fixtures connected to vent stack.\n\nO,,,= Vent branch or vent header airflow rate (cfm).\n0, Total vent stack airflow rate (cfm).\n\nO, (gpm) = 27.8 r,\"7 (1-r,) D®?\n\nQ, (cfm) = 0.134 O,(gpm)\n\nwhere:\nD = Drainage stack diameter (inches).\nO,,= Design discharge load (gpm).\nr, = Wastewater flow area to total area.\na\n27.8 D’?\n\nIndividual vent airflow rates are obtained by equally\ndistributing Q,, into one-half the total number of fixtures on\nthe branch or header for more than two fixtures; for an odd\nnumber of total fixtures, decrease by one; for one fixture,\napply the full value of Q,,,.\n\nIndividual vent developed length shall be increased by 20\npercent of the distance from the vent stack to the fixture vent\nconnection on the vent branch or header.\n\nSECTION 920\nCOMPUTERIZED VENT DESIGN\n\n920.1 Design of vent system. The sizing, design and layout\nof the vent system shall be permitted to be determined by\napproved computer program design methods.\n\nTABLE 919.2\nMINIMUM DIAMETER AND MAXIMUM LENGTH OF INDIVIDUAL\nBRANCH FIXTURE VENTS AND INDIVIDUAL FIXTURE HEADER VENTS FOR SMOOTH PIPES\n\n\"DIAMETER Lets\n~ OF VENT PIPE Maximum developed length of vent (feet) |\nfinches) gp 3 la 5] 6 (7) 8 8 ot ite 43 4a 16 7 18 | 18 20\n\nY, 9 25 123 8 5) 4 3 2°49 Vad) poor 4 TIT\n, 100 88 47 30 20 15 10 9 7 6 5 4 3 3 3 2 2 1\n1 — — 100 94 65 48 37 29 24 20 17 14 12 #1 9 7 6\nV/, 100 87 73 62 53 46 40 36 32 29 26 23 21\n1'/, 100 96 84 75 65 60 S54 49 45\n2 100\n\nFor SI: 1 inch = 25.4 mm, | cubic foot per minute = 0.4719 L/s, 1 foot = 304.8 mm.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\n9-9\n"
    },
    {
        "page": 102,
        "text": "VENTS\n\n920.2 System capacity. The vent system shall be based on\nthe air capacity requirements of the drainage system under a\npeak load condition.\n\n9-10 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 103,
        "text": "CHAPTER 10\nTRAPS, INTERCEPTORS AND SEPARATORS\n\nUser note:\n\nAbout this chapter: Chapter 10 regulates the design of fixture traps, methods for preventing evaporation of trap seals in traps and the\nrequired locations for interceptors and separators. The trap seal of a trap is an essential feature of a drainage system to prevent odors from\nthe drainage piping from entering the building. The discharge of various processes, such as cooking and laundry, creates the need for\nequipment to retain detrimental greases and solids from entering the drainage systems.\n\nSECTION 1001\nGENERAL\n\n1001.1 Scope. This chapter shall govern the material and\ninstallation of traps, interceptors and separators.\n\nSECTION 1002\nTRAP REQUIREMENTS\n\n1002.1 Fixture traps. Each plumbing fixture shall be sepa-\nrately trapped by a liquid-seal trap, except as otherwise\npermitted by this code. The vertical distance from the fixture\noutlet to the trap weir shall not exceed 24 inches (610 mm),\nand the horizontal distance shall not exceed 30 inches (610\nmm) measured from the centerline of the fixture outlet to the\ncenterline of the inlet of the trap. The height of a clothes\nwasher standpipe above a trap shall conform to Section\n802.4.3. A fixture shall not be double trapped.\n\nExceptions:\n\n1. This section shall not apply to fixtures with inte-\ngral traps.\n\n2. A combination plumbing fixture is permitted to be\ninstalled on one trap, provided that one compart-\nment is not more than 6 inches (152 mm) deeper\nthan the other compartment and the waste outlets\nare not more than 30 inches (762 mm) apart.\n\n3. Floor drains in multilevel parking structures that\ndischarge to a building storm sewer shall not be\nrequired to be individually trapped. Where floor\ndrains in multilevel parking structures are required\nto discharge to a combined building sewer system,\nthe floor drains shall not be required to be individ-\nually trapped provided that they are connected to a\nmain trap in accordance with Section 1103.1.\n\n1002.2 Design of traps. Fixture traps shall be self-scouring.\nFixture traps shall not have interior partitions, except where\nsuch traps are integral with the fixture or where such traps\nare constructed of an approved material that is resistant to\ncorrosion and degradation. Slip joints shall be made with an\napproved elastomeric gasket and shall be installed only on\nthe trap inlet, trap outlet and within the trap seal.\n\n1002.3 Prohibited traps. The following types of traps are\nprohibited:\n\n1. Traps that depend on moving parts to maintain the\nseal.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\n2. Bell traps.\nCrown-vented traps.\n\n4. Traps not integral with a fixture and that depend on\ninterior partitions for the seal, except those traps\nconstructed of an approved material that is resistant\nto corrosion and degradation.\n\n5. “S” traps.\n\nDrum traps.\n\ni\n\nException: Drum traps used as solids interceptors\nand drum traps serving chemical waste systems shall\nnot be prohibited.\n\n1002.4 Trap seals. Each fixture trap shall have a liquid seal\nof not less than 2 inches (51 mm) and not more than 4 inches\n(102 mm), or deeper for special designs relating to accessi-\nble fixtures.\n\n1002.4.1 Trap seal protection. Trap seals of emergency\nfloor drain traps and trap seals subject to evaporation\nshall be protected by one of the methods in Sections\n1002.4.1.1 through 1002.4.1.5.\n\n1002.4.1.1 Potable water-supplied trap seal primer\nvalve. A potable water-supplied trap seal primer valve\nshall supply water to the trap. Water-supplied trap seal\nprimer valves shall conform to ASSE 1018. The\ndischarge pipe from the trap seal primer valve shall\nconnect to the trap above the trap seal on the inlet side\nof the trap.\n\n1002.4.1.2 Reclaimed or graywater-supplied trap\nseal primer valve. A reclaimed or graywater-supplied\ntrap seal primer valve shall supply water to the trap.\nWater-supplied trap seal primer valves shall conform\nto ASSE 1018. The quality of reclaimed or graywater\nsupplied to trap seal primer valves shall be in accor-\ndance with the requirements of the manufacturer of the\ntrap seal primer valve. The discharge pipe from the\ntrap seal primer valve shall connect to the trap above\nthe trap seal, on the inlet side of the trap.\n\n1002.4.1.3 Wastewater-supplied trap primer\ndevice. A wastewater-supplied trap primer device\nshall supply water to the trap. Wastewater-supplied\ntrap primer devices shall conform to ASSE 1044. The\ndischarge pipe from the trap seal primer device shall\nconnect to the trap above the trap seal on the inlet side\nof the trap.\n\n10-1\n"
    },
    {
        "page": 104,
        "text": "TRAPS, INTERCEPTORS AND SEPARATORS\n\n1002.4.1.4 Barrier-type trap seal protection device.\nA barrier-type trap seal protection device shall protect\nthe floor drain trap seal from evaporation. Barrier-type\nfloor drain trap seal protection devices shall conform\nto ASSE 1072. The devices shall be installed in accor-\ndance with the manufacturer’s instructions.\n\n1002.4.1.5 Fixture drain connection for trap prim-\ning. A fixture drain from a lavatory or hand sink shall\nserve as a method of providing trap seal protection for\nan emergency floor drain, a trench drain, or a floor\nsink where such fixtures are located in the same room.\nA fixture drain from a drinking fountain shall serve as\na method of providing trap seal protection for an emer-\ngency floor drain, a trench drain, or a floor sink where\nsuch fixtures are in the same room or in a room adja-\ncent to the room having the drinking fountain. The\nfixture drain shall not be routed on or above the\nsurface of the floor and shall connect to the floor drain,\ntrench drain, or floor sink at a point that is below the\nflood level rim and above the inlet to the trap of the\nreceiving fixture.\n\n1002.5 Size of fixture traps. Fixture trap size shall be suffi-\ncient to drain the fixture rapidly and not less than the size\nindicated in Table 709.1. A trap shall not be larger than the\ndrainage pipe into which the trap discharges.\n\n1002.6 Building traps. Building (house) traps shall be\nprohibited.\n\n1002.7 Trap setting and protection. Traps shall be set level\nwith respect to the trap seal and, where necessary, shall be\nprotected from freezing.\n\n1002.8 Recess for trap connection. A recess provided for\nconnection of the underground trap, such as one serving a\nbathtub in slab-type construction, shall have sides and a\nbottom of corrosion-resistant, insect- and verminproof\nconstruction.\n\n1002.9 Acid-resisting traps. Where a vitrified clay or other\nbrittleware, acid-resisting trap is installed underground, such\ntrap shall be embedded in concrete extending 6 inches (152\nmm) beyond the bottom and sides of the trap.\n\n1002.10 Plumbing in mental health centers. In mental\nhealth centers, pipes and traps shall not be exposed.\n\nSECTION 1003\nINTERCEPTORS AND SEPARATORS\n\n1003.1 Where required. Interceptors and separators shall be\nprovided to prevent the discharge of oil, grease, sand and\nother substances harmful or hazardous to the public sewer,\nthe private sewage system or the sewage treatment plant or\nprocesses.\n\n1003.2 Approval. The size, type and location of each inter-\nceptor and of each separator shall be designed and installed\nin accordance with the manufacturer’s instructions and the\nrequirements of this section based on the anticipated condi-\ntions of use. Wastes that do not require treatment or\nseparation shall not be discharged into any interceptor or\nseparator.\n\n10-2\n\n1003.3 Grease interceptors. Grease interceptors shall\ncomply with the requirements of Sections 1003.3.1 through\n1003.3.8.\n\n1003.3.1 Grease interceptors and automatic grease\nremoval devices required. A grease interceptor or auto-\nmatic grease removal device shall be required to receive\nthe drainage from fixtures and equipment with grease-\nladen waste located in food preparation areas, such as in\nrestaurants, hotel kitchens, hospitals, school kitchens,\nbars, factory cafeterias and clubs. Fixtures and equipment\nshall include pot sinks, prerinse sinks; soup kettles or\nsimilar devices; wok stations; floor drains or sinks into\nwhich kettles are drained; automatic hood wash units and\ndishwashers without prerinse sinks. Grease interceptors\nand automatic grease removal devices shall receive waste\nonly from fixtures and equipment that allow fats, oils or\ngrease to be discharged. Where lack of space or other\nconstraints prevent the installation or replacement of a\ngrease interceptor, one or more grease interceptors shall\nbe permitted to be installed on or above the floor and\nupstream of an existing grease interceptor.\n\n1003.3.2 Food waste disposers restriction. A food waste\ndisposer shall not discharge to a grease interceptor.\n\n1003.3.3 Additives to grease interceptors. Dispensing\nsystems that dispense interceptor performance additives\nto grease interceptors shall not be installed except where\nsuch systems dispense microbes for the enhancement of\naerobic bioremediation of grease and other organic mate-\nrial, or for inhibiting growth of pathogenic organisms by\nanaerobic methods. Such microbial dispensing systems\nshall be installed only where the grease interceptor manu-\nfacturer’s instructions allow such systems and the\nsystems conform to ASME A112.14.6. Systems that\ndischarge emulsifiers, chemicals or enzymes to grease\ninterceptors shall be prohibited.\n\n1003.3.4 Grease interceptors and automatic grease\nremoval devices not required. A grease interceptor or an\nautomatic grease removal device shall not be required for\nindividual dwelling units or any private living quarters.\n\n1003.3.5 Hydromechanical grease interceptors, fats,\noils and greases disposal systems and automatic grease\nremoval devices. Hydromechanical grease interceptors;\nfats, oils, and greases disposal systems and automatic\ngrease removal devices shall be sized in accordance with\nASME A112.14.3, ASME A112.14.4, ASME A112.14.6,\nCSA B481.3 or PDI G101. Hydromechanical grease\ninterceptors; fats, oils, and greases disposal systems and\nautomatic grease removal devices shall be designed and\ntested in accordance with ASME A112.14.3, ASME\nA112.14.4, CSA B481.1, PDI. G101 or PDI G102. Hydro-\nmechanical grease interceptors; fats, oils, and greases\ndisposal systems and automatic grease removal devices\nshall be installed in accordance with the manufacturer’s\ninstructions. Where manufacturer’s instructions are not\nprovided, hydromechanical grease interceptors; fats, oils,\nand greases disposal systems and automatic grease\nremoval devices shall be installed in compliance with\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 105,
        "text": "ASME A112.14.3, ASME A112.14.4, ASME A112.14.6,\nCSA B481.3 or PDIGIO1.\n\n1003.3.5.1 Grease interceptor capacity. Grease inter-\nceptors shall have the grease retention capacity\nindicated in Table 1003.3.5.1 for the flow-through\nrates indicated.\n\nTABLE 1003.3.5.1\nCAPACITY OF GREASE INTERCEPTORS*\n\n[TOTAL FLOW-THROUGH RATING | GREASE RETENTION CAPACITY —\n(gpm) (pounds)\n\na\n6 12\n14\n\n9 [—t8—\n10 20\n12 24\n14 28\n15 30\n18 36\n20 40\n25 50\n35 70\n50 100\n75 150\n100 200\n\nFor SI: 1 gallon per minute = 3.785 L/m, 1 pound = 0.454 kg.\na. For total flow-through ratings greater than 100 (gpm), double the flow-\nthrough rating to determine the grease retention capacity (pounds).\n\n1003.3.5.2 Rate of flow controls. Grease interceptors\nshall be equipped with devices to control the rate of\nwater flow so that the water flow does not exceed the\nrated flow. The flow-control device shall be vented\nand terminate not less than 6 inches (152 mm) above\nthe flood rim level or be installed in accordance with\nthe manufacturer’s instructions.\n\n1003.3.6 Automatic grease removal devices. Where\nautomatic grease removal devices are installed, such\ndevices shall be located downstream of each fixture or\nmultiple fixtures in accordance with the manufacturer’s\ninstructions. The automatic grease removal device shall\nbe sized to pretreat the measured or calculated flows for\nall connected fixtures or equipment. Ready access shall\nbe provided for inspection and maintenance.\n\n1003.3.7 Gravity grease interceptors and gravity\ngrease interceptors with fats, oils, and greases disposal\nsystems. The required capacity of gravity grease intercep-\ntors and gravity grease interceptors with fats, oils, and\ngreases disposal systems shall be determined by multiply-\ning the peak drain flow into the interceptor in gallons per\nminute by a retention time of 30 minutes. Gravity grease\ninterceptors shall be designed and tested in accordance\nwith IAPMO/ANSI Z1001. Gravity grease interceptors\nwith fats, oils, and greases disposal systems shall be\ndesigned and tested in accordance with ASME A112.14.6\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nTRAPS, INTERCEPTORS AND SEPARATORS\n\nand IAPMO/ANSI Z1001. Gravity grease interceptors\nand gravity grease interceptors with fats, oils, and greases\ndisposal systems shall be installed in accordance with\nmanufacturer’s instructions. Where manufacturer’s\ninstructions are not provided, gravity grease interceptors\nand gravity grease interceptors with fats, oils, and greases\ndisposal systems shall be installed in compliance with\nASME A112.14.6 and IAPMO/ANSI Z1001.\n\n1003.3.8 Direct connection. The discharge piping from a\ngrease interceptor shall be directly connected to the sani-\ntary drainage system.\n\n1003.4 Oil separators required. At repair garages where\nfloor or trench drains are provided, car washing facilities,\nfactories where oily and flammable liquid wastes are\nproduced and hydraulic elevator pits, oil separators shall be\ninstalled into which oil-bearing, grease-bearing or flamma-\nble wastes shall be discharged before emptying into the\nbuilding drainage system or other point of disposal.\n\nException: An oil separator is not required in hydraulic\nelevator pits where an approved alarm system is installed.\nSuch alarm systems shall not terminate the operation of\npumps utilized to maintain emergency operation of the\nelevator by fire fighters.\n\n1003.4.1 Separation of liquids. A mixture of treated or\nuntreated light and heavy liquids with various specific\ngravities shall be separated in an approved receptacle.\n\n1003.4.2 Oil separator design. Oil separators shall be\nlisted and labeled, or designed in accordance with\nSections 1003.4.2.1 and 1003.4.2.2.\n\n1003.4.2.1 General design requirements. Oil separa-\ntors shall have a depth of not less than 2 feet (610 mm)\nbelow the invert of the discharge drain. The outlet\nopening of the separator shall have not less than an 18-\ninch (457 mm) water seal.\n\n1003.4.2.2 Garages and service stations. Where\nautomobiles are serviced, greased, repaired or washed\nor where gasoline is dispensed, oil separators shall\nhave a capacity of not less than 6 cubic feet (0.168 m*)\nfor the first 100 square feet (9.3 m°) of area to be\ndrained, plus 1 cubic foot (0.028 m*) for each addi-\ntional 100 square feet (9.3 m’) of area to be drained\ninto the separator. Parking garages in which servicing,\nrepairing or washing is not conducted, and in which\ngasoline is not dispensed, shall not require a separator.\nAreas of commercial garages utilized only for storage\nof automobiles are not required to be drained through a\nseparator.\n\n1003.5 Sand interceptors in commercial establishments.\nSand and similar interceptors for heavy solids shall be\ndesigned and located so as to be provided with ready access\nfor cleaning, and shall have a water seal of not less than 6\ninches (152 mm).\n\n1003.6 Clothes washer discharge interceptor. Clothes\nwashers shall discharge through an interceptor that is\nprovided with a wire basket or similar device, removable for\ncleaning, that prevents passage into the drainage system of\nsolids '/, inch (12.7 mm) or larger in size, string, rags,\n\n10-3\n"
    },
    {
        "page": 106,
        "text": "TRAPS, INTERCEPTORS AND SEPARATORS\n\nbuttons or other materials detrimental to the public sewage\nsystem.\n\nExceptions:\n\n1. Clothes washers in individual dwelling units shall\nnot be required to discharge through an\ninterceptor.\n\n2. A single clothes washer designed for use in indi-\nvidual dwelling units and installed in a location\nother than an individual dwelling unit shall not be\nrequired to discharge through an interceptor.\n\n1003.7 Bottling establishments. Bottling plants shall\ndischarge process wastes into an interceptor that will provide\nfor the separation of broken glass or other solids before\ndischarging waste into the drainage system.\n\n1003.8 Slaughterhouses. Slaughtering room and dressing\nroom drains shall be equipped with approved separators. The\nseparator shall prevent the discharge into the drainage\nsystem of feathers, entrails and other materials that cause\nclogging.\n\n1003.9 Venting of interceptors and separators. Intercep-\ntors and separators shall be designed so as not to become air\nbound. Interceptors and separators shall be vented in accor-\ndance with one of the methods in Chapter 9.\n\n1003.10 Access and maintenance of interceptors and\nseparators. Access shall be provided to each interceptor and\nseparator for service and maintenance. Interceptors and\nseparators shall be maintained by periodic removal of accu-\nmulated grease, scum, oil, or other floating substances and\nsolids deposited in the interceptor or separator.\n\nSECTION 1004\nMATERIALS, JOINTS AND CONNECTIONS\n\n1004.1 General. The materials and methods utilized for the\nconstruction and installation of traps, interceptors and sepa-\nrators shall comply with this chapter and the applicable\nprovisions of Chapters 4 and 7. The fittings shall not have\nledges, shoulders or reductions capable of retarding or\nobstructing flow of the piping.\n\n10-4\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 107,
        "text": "CHAPTER 11\nSTORM DRAINAGE\n\nUser note:\n\nAbout this chapter: Rainfall onto buildings must be removed and directed to a location that can accommodate storm water. Chapter 11\nspecifies the design rainfall event for the geographic area and provides sizing methods for piping and gutter systems to convey the storm\nwater away from the building. Included in this chapter are regulations for piping materials and subsoil drainage systems.\n\nSECTION 1101\nGENERAL\n\n1101.1 Scope. The provisions of this chapter shall govern\nthe materials, design, construction and installation of storm\ndrainage.\n\n1101.2 Disposal. Rainwater from roofs and storm water\nfrom paved areas, yards, courts and courtyards shall drain to\nan approved place of disposal. For one- and two-family\ndwellings, and where approved, storm water is permitted to\ndischarge onto flat areas, such as streets or lawns, provided\nthat the storm water flows away from the building.\n\n1101.3 Prohibited drainage. Storm water shall not be\ndrained into sewers intended for sewage only.\n\n1101.4 Tests. The conductors and the building storm drain\nshall be tested in accordance with Section 312.\n\n1101.5 Change in size. The size of a drainage pipe shall not\nbe reduced in the direction of flow.\n\n1101.6 Fittings and connections. Connections and changes\nin direction of the storm drainage system shall be made with\napproved drainage-type fittings in accordance with Table\n706.3. The fittings shall not obstruct or retard flow in the\nsystem.\n\n[BS] 1101.7 Roof design. Roofs shall be designed for the\nmaximum possible depth of water that will pond thereon as\ndetermined by the relative levels of roof deck and overflow\nweirs, scuppers, edges or serviceable drains in combination\nwith the deflected structural elements. In determining the\nmaximum possible depth of water, all primary roof drainage\nmeans shall be assumed to be blocked. The maximum possi-\nble depth of water on the roof shall include the height of the\nwater required above the inlet of the secondary roof drainage\nmeans to achieve the required flow rate of the secondary\ndrainage means to accommodate the design rainfall rate as\nrequired by Section 1106.\n\n1101.8 Cleanouts required. Cleanouts shall be installed in\nthe storm drainage system and shall comply with the provi-\nsions of this code for sanitary drainage pipe cleanouts.\n\nException: Subsurface drainage system.\n\n1101.9 Backwater valves. Storm drainage systems shall be\nprovided with backwater valves as required for sanitary\ndrainage systems in accordance with Section 714.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nSECTION 1102\nMATERIALS\n\n1102.1 General. The materials and methods utilized for the\nconstruction and installation of storm drainage systems shall\ncomply with this section and the applicable provisions of\nChapter 7.\n\n1102.2 Inside storm drainage conductors. Inside storm\ndrainage conductors installed above ground shall conform to\none of the standards listed in Table 702.1.\n\n1102.3 Underground building storm drain pipe. Under-\nground building storm drain pipe shall conform to one of the\nstandards listed in Table 702.2.\n\n1102.4 Building storm sewer pipe. Building storm sewer\npipe shall conform to one of the standards listed in Table\n1102.4.\n\nTABLE 1102.4\nBUILDING STORM SEWER PIPE\n\nAcrylonitrile butadiene styrene\n\" (ABS) plastic pipe in IPS diame-\n_ters, including Schedule 40, DR\n-22(PS 200) and DR 24 (PS 140);\n\nwith a solid, cellular core or\ncomposite wall\n\nASTM D2661; ASTM F628;\nASTM F1488; CSA B181.1;\nCSA B182.1\n\n‘ASTM A74, ASTM A888;\nCISPI 301\n\nASTM C14; ASTM C76;\nCSA A257.1; CSA A257.2\nASTM B75; ASTM B88;\nASTM B251; ASTM B306\nASTM F667;\n\nASTM F2306/F2306M;\nASTM F2648/F2648M\n\nASTM F2881; CSA B182.13\n\n_Cast-iron pipe\n\nConcrete pipe\n\nCopper or copper-alloy tubing\n(Type K, L, M or DWV)\n\nPolyethylene (PE) plastic pipe\n\nPolypropylene (PP) pipe\nPolyvinyl chloride (PVC) plastic\npipe (Type DWV, SDR26,\n\nSDR35, SDR41, PS50 or ASTM D2665; ASTM D3034;\n\nPS100) in IPS diameters, includ-\ning Schedule 40, DR 22 (PS\n200) and DR 24 (PS 140); witha\nsolid, cellular core or composite\nwall\n\nStainless steel drainage systems,\nType 316L\n\nVitrified clay pipe\n\nASTM F891; ASTM F1488;\nCSA B181.2; CSA B182.2;\nCSA B182.4\n\nASME A112.3.1\n\nASTM C4; ASTM C700\n"
    },
    {
        "page": 108,
        "text": "STORM DRAINAGE\n\n1102.5 Subsoil drain pipe. Subsoil drains shall be open-\njointed, horizontally split or perforated pipe conforming to\none of the standards listed in Table 1102.5.\n\nTABLE 1102.5\nSUBSOIL DRAIN PIPE\n\nMATERLAL \\s ANDARD\nms | STM A74; ASTM ASS; |\neld ieee | ee | CISPI 301\n\n\"| ASTM F405; ASTM F667; -\nCSA B182.1; CSA B182.6;\nCSA B182.8\n\nASTM D2729; ASTM D3034;\nASTM F891; CSA B182.2;\nCSA B182.4\n\nPolyethylene (PE) plastic pipe\n\nPolyvinyl chloride (PVC) plas-\ntic pipe (type sewer pipe,\nSDR35, PS25, PS50 or PS100)\nStainless steel drainage\n\nsystems, Type 316L ASME A112.3.1\n\nVitrified clay pipe ASTM C4; ASTM C700\n\n1102.6 Roof drains. Roof drains shall conform to ASME\nA112.3.1 or ASME A112.6.4. Roof drains, other than\nsiphonic roof drains, shall be tested and rated in accordance\nwith ASME A112.6.4 or ASPE/IAPMO Z1034.\n\n1102.7 Fittings. Pipe fittings shall be approved for installa-\ntion with the piping material installed, and shall conform to\nthe respective pipe standards or one of the standards listed in\nTable 1102.7. The fittings shall not have ledges, shoulders or\nreductions capable of retarding or obstructing flow in the\npiping. Threaded drainage pipe fittings shall be of the\nrecessed drainage type.\n\nSECTION 1103\nTRAPS\n\n1103.1 Main trap. Leaders and storm drains connected to a\ncombined sewer shall be trapped. Individual storm water\ntraps shall be installed on the storm water drain branch serv-\ning each conductor, or a single trap shall be installed in the\nmain storm drain just before its connection with the\ncombined building sewer or the public sewer. Leaders and\nstorm drains connected to a building storm sewer shall not\nbe required to be trapped.\n\n1103.2 Material. Storm water traps shall be of the same\nmaterial as the piping system to which they are attached.\n\n1103.3 Size. Traps for individual conductors shall be the\nsame size as the horizontal drain to which they are\nconnected.\n\n1103.4 Cleanout. A cleanout shall be installed on the build-\ning side of the trap and shall be provided with access.\n\nSECTION 1104\nCONDUCTORS AND CONNECTIONS\n\n1104.1 Prohibited use. Conductor pipes shall not be used as\nsoil, waste or vent pipes, and soil, waste or vent pipes shall\nnot be used as conductors.\n\n11-2\n\nTABLE 1102.7\nPIPE FITTINGS\n\na ——\nAcrylonitrile butadiene styrene ASTM D2661; ASTM D3311;\nCSA B181.1\n\n(ABS) plastic\n_XKSMEBI164; ASME B16.12;\n\nCast iron ASTM A74; ASTM A888;\n7 CISPI 301\n\n— —— —__—. — |\nCoextruded composite ABS and\ndrain DR-PS in PS35, PS50, ASTM D2751 |\nPS100, PS140, PS200 t +\n\n1 a\nCoextruded composite ABS\n\n: _ ASTM D2661; ASTM D3311; =\n\nDWV Schedule 40 IPS pipe ‘ASTM F628 7\n(solid or cellular core) 7\n\nCoextruded composite PVC\n\nDWV Schedule 40 IPS-DR, ASTM D2665; ASTM D3311;\n\nPS140, PS200 ASTM F891\n\n(solid or cellular core)\n\nCoextruded composite PVC\n\nsewer and drain DR-PS in\n\nPS35, PS50, PS100, PS140, “STM D3034\n\nPS200\nASMEBI16.15; ASME B16.18;\nASME B16.22;\n\nCopper or copper alloy ASME B16.23;\nASME B16.26;\nASME B16.29\n\nGray iron and ductile iron AWWA C110/A21.10\n\nMalleable iron ASME B16.3\n\nPlastic, general ASTM F409\n\nASTM F2306/F2306M\n\nASTM D2665; ASTM D3311;\nASTM F1866\n\nPolyethylene (PE) plastic pipe\nPolyvinyl chloride (PVC)\nplastic\n\nStainless steel drainage\n\nsystems, Type 316L ASME A112.3.1\n\nASME B16.9; ASME B16.11;\n\nSteel ASME B16.28\n\n1104.2 Floor drains. Floor drains shall not be connected to a\nstorm drain.\n\nSECTION 1105\nROOF DRAINS\n\n1105.1 General. Roof drains shall be installed in accordance\nwith the manufacturer’s instructions. The inside opening for\nthe roof drain shall not be obstructed by the roofing\nmembrane material.\n\n1105.2 Roof drain flow rate. The published roof drain flow\nrate, based on the head of water above the roof drain, shall be\nused to size the storm drainage system in accordance with\nSection 1106. The flow rate used for sizing the storm drain-\nage piping shall be based on the maximum anticipated\nponding at the roof drain.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 109,
        "text": "SECTION 1106\nSIZE OF CONDUCTORS,\nLEADERS AND STORM DRAINS\n\n1106.1 General. The size of the vertical conductors and\nleaders, building storm drains, building storm sewers and\nany horizontal branches of such drains or sewers shall be\nbased on the 100-year hourly rainfall rate indicated in\nFigures 1106.1(1) through 1106.1(5) or on other rainfall\nrates determined from approved local weather data.\n\n1106.2 Size of storm drain piping. Vertical and horizontal\nstorm drain piping shall be sized based on the flow rate\nthrough the roof drain. The flow rate, as calculated in accor-\ndance with Section 1106.2.1, shall be checked against the\nroof drain manufacturer’s published flow rate for the specific\nroof drain model and size to verify that the selected roof\ndrain will handle the anticipated flow. The flow rate in storm\ndrain piping shall not exceed that specified in Table 1106.2.\n\n1106.2.1 Rainfall rate conversion method. The rainfall\nrate falling on a roof surface shall be converted to a gallon\nper minute (L/m) flow rate in accordance with Equation\n11-1.\n\nGPM = R x A x 0.0104\n\nwhere:\n\n(Equation 11-1)\n\nR = Rainfall intensity in inches (mm) per hour.\nA = Roof area in square feet (m’).\n\n1106.3 Vertical leader sizing. Vertical leaders shall be sized\nbased on the flow rate from horizontal gutters or the maxi-\nmum flow rate through roof drains. The flow rate through\nvertical leaders shall not exceed that specified in Table\n1106.3.\n\n1106.4 Vertical walls. In sizing roof drains and storm drain-\nage piping, one-half of the area of any vertical wall that\ndiverts rainwater to the roof shall be added to the projected\nroof area for inclusion in calculating the required size of\nvertical conductors, leaders and horizontal storm drainage\n\npiping.\n\nSTORM DRAINAGE\n\nTABLE 1106.3\nVERTICAL LEADER SIZING\n\n[SIZE OF LEADER (inches) CAPACITY (gpm) |\np27 -—30—_ >\n2x2 | 30 ~©«4\n\nHE 30\n\n2\", 5\n\n2s x 2\", [54\n3 92\n\n2x4 92\n\n2p x3 92\n\n4 192\n\n3x4\"), 192\n\n31, x4 192\n\n5 360\n\n4x5 360\n\n4'/, x At, 360\n\n6 563\n\n5x6 563\n\n51, x 5/5 563\n\n8 1208\n\n6x8 1208\n\nFor SI: 1 inch = 25.4 mm, | gallon per minute = 3.785 L/m.\n\n1106.5 Parapet wall scuppers. Where scuppers are used for\nprimary roof drainage or for secondary (emergency over-\nflow) roof drainage or both, the quantity, size, location and\ninlet elevation of the scuppers shall be chosen to prevent the\ndepth of ponding water on the roof from exceeding the maxi-\nmum water depth that the roof was designed for as\ndetermined by Section 1611.1 of the /nternational Building\nCode. Scupper openings shall be not less than 4 inches (102\nmm) in height and have a width that is equal to or greater\nthan the circumference of a roof drain sized for the same roof\narea. The flow through the primary system shall not be\nconsidered when locating and sizing secondary scuppers.\n\nTABLE 1106.2\nSTORM DRAIN PIPE SIZING\n\nI = ——————capaciry (gpm) —\n\n— PIPE SIZE (inches)\n\nSLOPE OF HORIZONTAL DRAIN\n\n+ , [VERTICAL DRAIN ‘I,, inch per foot ‘/, inch per foot 4/, inch per foot ‘finch per foot\n2 34 15 77 31 44\n3 87 39 35 79 Il\n4 180 81 115 163 231\n5 311 117 165 234 331\n6 538 243 344 487 689\n8 1,117 505 714 1,010 1,429\n10 2,050 927 1,311 1,855 2,623\n12 3,272 1,480 2,093 2,960 4,187\n15 5,543 2,508 3,546 5,016 7,093\n\nFor SI: 1 inch = 25.4 mm, | foot = 304.8 mm, | gallon per minute = 3.785 L/m.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 110,
        "text": "a RO te td tw pte teen Peer a Se te gr seme ee\nsee ree,\nrmass tear were scan navn sunray prance neh aS WRI waTIN I\ncemeenaes mimes one me sareevreeri einen: cane?\n"
    },
    {
        "page": 111,
        "text": "Nn rb end ot wang smn See\n\nfH\n\nRO are et nent ent Aten Regen\nrevere,\nenn HATA RNS ACLNIRAL UROL HAIL\n\nne peupaniescrumamn tues\n\neenrae caaneaarl RA dhumea: saern erarre\n"
    },
    {
        "page": 112,
        "text": "eae semen,\n\nme em ae tee nd pie men arin\n\nnese meg\neras reseenanccenem Sarna D2\n\neientaae naa uaana aR!\n\n"
    },
    {
        "page": 113,
        "text": "soon Rao ae De bd hd rp A\n\net Sed te # pe Mn iB\n\nsawn acta tate Mow eases reruns rence ee ORIEN\n\nen aewmenrean. puaman.crer ue ne peupaniescrumamn tues ne eae eatiam: acces oy\n"
    },
    {
        "page": 114,
        "text": "fi\n\nu\ni\n"
    },
    {
        "page": 115,
        "text": "1106.6 Size of roof gutters. Horizontal gutters shall be sized\nbased on the flow rate from the roof surface. The flow rate in\nhorizontal gutters shall not exceed that specified in Table\n1106.6.\n\nSECTION 1107\nSIPHONIC ROOF DRAINAGE SYSTEMS\n\n1107.1 General. Siphonic roof drains and drainage systems\nshall be designed in accordance with ASME A112.6.9 and\nASPE 45.\n\nSECTION 1108\nSECONDARY (EMERGENCY) ROOF DRAINS\n\n1108.1 Secondary (emergency overflow) drains or scup-\npers. Where roof drains are required, secondary (emergency\noverflow) roof drains or scuppers shall be provided where\nthe roof perimeter construction extends above the roof in\nsuch a manner that water will be entrapped if the primary\ndrains allow buildup for any reason. Where primary and\nsecondary roof drains are manufactured as a single assem-\nbly, the inlet and outlet for each drain shall be independent.\n\n1108.2 Separate systems required. Secondary roof drain\nsystems shall have the end point of discharge separate from\nthe primary system. Discharge shall be above grade, in a\nlocation that would normally be observed by the building\noccupants or maintenance personnel.\n\nSTORM DRAINAGE\n\n1108.3 Sizing of secondary drains. Secondary (emergency)\nroof drain systems shall be sized in accordance with Section\n1106 based on the rainfall rate for which the primary system\nis sized. Scuppers shall be sized to prevent the depth of\nponding water from exceeding that for which the roof was\ndesigned as determined by Section 1101.7. Scuppers shall\nhave an opening dimension of not less than 4 inches (102\nmm) in height and have an opening width equal to the\ncircumference of the roof drain required for the area served.\nThe flow through the primary system shall not be considered\nwhen sizing the secondary roof drain system.\n\nSECTION 1109\nCOMBINED SANITARY AND\nSTORM PUBLIC SEWER\n\n1109.1 General. Where the public sewer is a combined\nsystem for both sanitary and storm water, the storm sewer\nshall be connected independently to the public sewer.\n\nSECTION 1110\nCONTROLLED FLOW ROOF DRAIN SYSTEMS\n\n1110.1 General. The roof of a structure shall be designed for\nthe storage of water where the storm drainage system is engi-\nneered for controlled flow. The controlled flow roof drain\nsystem shall be an engineered system in accordance with this\nsection and the design, submittal, approval, inspection and\ntesting requirements of Section 316.1. The controlled flow\n\nTABLE 1106.6\nHORIZONTAL GUTTER SIZING\n\nGUTTER DIMENSIONS? (inches) \"SLOPE (inch per foot) | CAPACITY (gpm).\nTx 27, ty t 26\n17x24, 4 40\n4 “fe | 39\n27], x3 ye : 55\n27,3 yf 87\n5 bye 74\n4x2\", Y, 106\n3x 3\"/, \", 156\n6 \"Y 110\n3x5 Y, 157\n3x5 Y 225\n8 Ne 172\n8 Ye 247\n4, x6 4, 348\n4), x 6 Y 494\n10 Ne 331\n10 Vy 472\n5x8 %, 651\n4x10 Y 1055\n\nFor SI: | inch = 25.4 mm, | foot = 304.8 mm, | gallon per minute = 3.785 L/m, 1 inch per foot = 83.3 mm/m.\na. Dimensions are width by depth for rectangular shapes. Single dimensions are diameters of a semicircle.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\n11-9\n"
    },
    {
        "page": 116,
        "text": "STORM DRAINAGE\n\nsystem shall be designed based on the required rainfall rate\nin accordance with Section 1106.1.\n\n1110.2 Control devices. The control devices shall be\ninstalled so that the rate of discharge of water per minute\nshall not exceed the values for continuous flow as indicated\nin Section 1110.1.\n\n1110.3 Installation. Runoff control shall be by control\ndevices. Control devices shall be protected by strainers.\n\n1110.4 Minimum number of roof drains. Not less than two\nroof drains shall be installed in roof areas 10,000 square feet\n(929 m’) or less and not less than four roof drains shall be\ninstalled in roofs over 10,000 square feet (929 m’) in area.\n\nSECTION 1111\nSUBSOIL DRAINS\n\n1111.1 Subsoil drains. Subsoil drains shall be open-jointed,\nhorizontally split or perforated pipe conforming to one of the\nstandards listed in Table 1102.5. Such drains shall be not less\nthan 4 inches (102 mm) in diameter. Where the building is\nsubject to backwater, the subsoil drain shall be protected by\nan accessibly located backwater valve. Subsoil drains shall\ndischarge to a trapped area drain, sump, dry well or\napproved location above ground. The subsoil sump shall not\nbe required to have either a gastight cover or a vent. The\nsump and pumping system shall comply with Section\n1113.1.\n\nSECTION 1112\nBUILDING SUBDRAINS\n\n1112.1 Building subdrains. Building subdrains located\nbelow the public sewer level shall discharge into a sump or\nreceiving tank, the contents of which shall be automatically\nlifted and discharged into the drainage system as required for\nbuilding sumps. The sump and pumping equipment shall\ncomply with Section 1113.1.\n\nSECTION 1113\nSUMPS AND PUMPING SYSTEMS\n\n1113.1 Pumping system. The sump pump, pit and discharge\npiping shall conform to Sections 1113.1.1 through 1113.1.4.\n\n1113.1.1 Pump capacity and head. The sump pump\nshall be of a capacity and head appropriate to anticipated\nuse requirements.\n\n1113.1.2 Sump pit. The sump pit shall be not less than 18\ninches (457 mm) in diameter and not less than 24 inches\n(610 mm) in depth, unless otherwise approved. The pit\nshall be provided with access and shall be located such\nthat all drainage flows into the pit by gravity. The sump\npit shall be constructed of tile, steel, plastic, cast iron,\nconcrete or other approved material, with a removable\ncover adequate to support anticipated loads in the area of\nuse. The pit floor shall be solid and provide permanent\nsupport for the pump.\n\n11-10\n\n1113.1.3 Electrical. Electrical service outlets, where\nrequired, shall meet the requirements of NFPA 70.\n\n1113.1.4 Piping. Discharge piping shall meet the require-\nments of Section 1102.2, 1102.3 or 1102.4 and shall\ninclude a gate valve and a full flow check valve. Pipe and\nfittings shall be the same size as, or larger than, the pump\ndischarge tapping.\nException: In one- and two-family dwellings, only a\ncheck valve shall be required, located on the discharge\npiping from the pump or ejector.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 117,
        "text": "CHAPTER 12\nSPECIAL PIPING AND STORAGE SYSTEMS\n\nUser note:\n\nAbout this chapter: Chapter 12 specifies the standards covering the installation of nonflammable medical gas piping systems and\nnonmedical oxygen piping systems.\n\nSECTION 1201\nGENERAL\n\n1201.1 Scope. The provisions of this chapter shall govern\nthe design and installation of piping and storage systems for\nnonflammable medical gas systems and nonmedical oxygen\nsystems. All maintenance and operations of such systems\nshall be in accordance with the /nternational Fire Code.\n\nSECTION 1202\nMEDICAL GASES\n[F] 1202.1 Nonflammable medical gases. Nonflammable\nmedical gas systems, inhalation anesthetic systems and\n\nvacuum piping systems shall be installed, tested and labeled\nin accordance with NFPA 99.\n\nExceptions:\n\n1. This section shall not apply to portable systems or\ncylinder storage.\n\n2. Vacuum system exhaust terminations shall comply\nwith the International Mechanical Code.\n\nSECTION 1203\nOXYGEN SYSTEMS\n\n[F] 1203.1 Design and installation. Nonmedical oxygen\nsystems shall be designed and installed in accordance with\nNFPA 51 and NFPA 55.\n\n2021 INTERNATIONAL PLUMBING CODE® 12-1\n"
    },
    {
        "page": 118,
        "text": "12-2 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 119,
        "text": "CHAPTER 13\nNONPOTABLE WATER SYSTEMS\n\nUser note:\n\nAbout this chapter: Storm water and some liquid waste from a building can be a source of nonpotable water that can be used to reduce\nthe volume of potable water supplied to the building. Chapter 13 provides the requirements for storage, treatment and distribution of this\nresource. This chapter also regulates the piping systems for reclaimed water supplied by a wastewater treatment facility.\n\nSECTION 1301\nGENERAL\n\n]_ 1301.1 General. The provisions of Chapter 13 shall govern\nthe materials, design, construction and installation of\nsystems for the collection, storage, treatment and distribution\nof nonpotable water. For nonpotable rainwater systems, the\nprovisions of CSA B805/ICC 805 shall be an alternative for\nregulating the materials, design, construction and installation\nof systems for rainwater collection, storage, treatment and\ndistribution of nonpotable water. The use and application of\nnonpotable water shall comply with laws, rules and ordi-\nnances applicable in the jurisdiction.\n\n1301.2 Water quality. Nonpotable water for each end use\napplication shall meet the minimum water quality require-\nments as established for the intended application by the laws,\nrules and ordinances applicable in the jurisdiction. Where\nnonpotable water from different sources is combined in a\nsystem, the system shall comply with the most stringent of\nthe requirements of this code that are applicable to such\nsources.\n\n1301.2.1 Residual disinfectants. Where chlorine is used\nfor disinfection, the nonpotable water shall contain not\nmore than 4 ppm (4 mg/L) of chloramines or free chlorine\nwhen tested in accordance with ASTM D1253. Where\nozone is used for disinfection, the nonpotable water shall\nnot contain gas bubbles having elevated levels of ozone at\nthe point of use.\n\nException: Reclaimed water sources shall not be\nrequired to comply with these requirements.\n\n1301.2.2 Filtration required. Nonpotable water utilized\nfor water closet and urinal flushing applications shall be\nfiltered by a 100-micron (0.1 mm) or finer filter.\n\nException: Reclaimed water sources shall not be\nrequired to comply with these requirements.\n\n1301.3 Signage required. Nonpotable water outlets such as\nhose connections, open-ended pipes and faucets shall be\nidentified at the point of use for each outlet with signage that\nreads as follows: “Nonpotable water is utilized for [applica-\ntion name]. CAUTION: NONPOTABLE WATER — DO\nNOT DRINK.” The words shall be legibly and indelibly\nprinted on a tag or sign constructed of corrosion-resistant\nwaterproof material or shall be indelibly printed on the\nfixture. The letters of the words shall be not less than 0.5\ninch (12.7 mm) in height and in colors in contrast to the\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nbackground on which they are applied. In addition to the\nrequired wordage, the pictograph shown in Figure 1301.3\nshall appear on the signage required by this section.\n\nFIGURE 1301.3\nPICTOGRAPH—DO NOT DRINK\n\n1301.4 Permits. Permits shall be required for the construc-\ntion, installation, alteration and repair of nonpotable water\nsystems. Construction documents, engineering calculations,\ndiagrams and other such data pertaining to the nonpotable\nwater system shall be submitted with each permit\napplication.\n\n1301.5 Potable water connections. Where a potable system\nis connected to a nonpotable water system, the potable water\nsupply shall be protected against backflow in accordance\nwith Section 608.\n\n1301.6 Components and materials. Piping, plumbing\ncomponents and materials used in collection and conveyance\nsystems shall be of material approved by the manufacturer\nfor the intended application.\n\n1301.7 Insect and vermin control. The system shall be\nprotected to prevent the entrance of insects and vermin into\nstorage tanks and piping systems. Screen materials shall be\ncompatible with contacting system components and shall not\naccelerate the corrosion of system components.\n\n1301.8 Freeze protection. Where sustained freezing\ntemperatures occur, provisions shall be made to keep storage\ntanks and the related piping from freezing.\n\n13-1\n"
    },
    {
        "page": 120,
        "text": "NONPOTABLE WATER SYSTEMS\n\n1301.9 Nonpotable water storage tanks. Nonpotable water\nstorage tanks shall comply with Sections 1301.9.1 through\n1301.9.10.\n\n1301.9.1 Location. Any storage tank or portion thereof\nthat is above grade shall be protected from direct expo-\nsure to sunlight by one of the following methods:\n\n1. Tank construction using opaque, UV-resistant\nmaterials such as heavily tinted plastic, fiberglass,\nlined metal, concrete, wood, or painted to prevent\nalgae growth.\n\n2. Specially constructed sun barriers.\n3. Installation in garages, crawl spaces or sheds.\n\n1301.9.2 Materials. Where collected on site, water shall\nbe collected in an approved tank constructed of durable,\nnonabsorbent and corrosion-resistant materials. The stor-\nage tank shall be constructed of materials compatible with\nany disinfection systems used to treat water upstream of\nthe tank and with any systems used to maintain water\nquality in the tank. Wooden storage tanks that are not\nequipped with a makeup water source shall be provided\nwith a flexible liner.\n\n1301.9.3 Foundation and supports. Storage tanks shall\nbe supported on a firm base capable of withstanding the\nweight of the storage tank when filled to capacity. Storage\ntanks shall be supported in accordance with the /nterna-\ntional Building Code.\n\n1301.9.3.1 Ballast. Where the soil can become satu-\nrated, an underground storage tank shall be ballasted,\nor otherwise secured, to prevent the tank from floating\nout of the ground when empty. The combined weight\nof the tank and hold-down ballast shall meet or exceed\nthe buoyancy force of the tank. Where the installation\nrequires a foundation, the foundation shall be flat and\nshall be designed to support the weight of the storage\ntank when full, consistent with the bearing capability\nof adjacent soil.\n\n1301.9.3.2 Structural support. Where installed below\ngrade, storage tank installations shall be designed to\nwithstand earth and surface structural loads without\ndamage and with minimal deformation when empty or\nfilled with water.\n\n1301.9.4 Makeup water. Where an uninterrupted supply\nis required for the intended application, potable or\nreclaimed water shall be provided as a source of makeup\nwater for the storage tank. The makeup water supply shall\nbe protected against backflow in accordance with Section\n608. A fill-open valve located on the makeup water\nsupply line to the storage tank shall be provided. Inlets to\nthe storage tank shall be controlled by fill valves or other\nautomatic supply valves installed to prevent the tank from\noverflowing and to prevent the water level from dropping\nbelow a predetermined point. Where makeup water is\nprovided, the water level shall not be permitted to drop\nbelow the source water inlet or the intake of any attached\npump.\n1301.9.5 Overflow. The storage tank shall be equipped\nwith an overflow pipe having a diameter not less than that\n\n13-2\n\nshown in Table 606.5.4. The overflow pipe shall be\nprotected from insects or vermin and shall discharge in a\nmanner consistent with storm water runoff requirements\nof the jurisdiction. The overflow pipe shall discharge at a\nsufficient distance from the tank to avoid damaging the\ntank foundation or the adjacent property. Drainage from\noverflow pipes shall be directed to prevent freezing on\nroof walkways. The overflow drain shall not be equipped\nwith a shutoff valve. A cleanout shall be provided on each\noverflow pipe in accordance with Section 708.\n\n1301.9.6 Access. Not less than one access opening shall\nbe provided to allow inspection and cleaning of the tank\ninterior. Access openings shall have an approved locking\ndevice or other approved method of securing access.\nBelow-grade storage tanks, located outside of the build-\ning, shall be provided with a manhole either not less than\n24 inches (610 mm) square or with an inside diameter not\nless than 24 inches (610 mm). Manholes shall extend not\nless than 4 inches (102 mm) above ground or shall be\ndesigned to prevent water infiltration. Finished grade\nshall be sloped away from the manhole to divert surface\nwater. Manhole covers shall be secured to prevent unau-\nthorized access. Service ports in manhole covers shall be\nnot less than 8 inches (203 mm) in diameter and shall be\nnot less than 4 inches (102 mm) above the finished grade\nlevel. The service port shall be secured to prevent unau-\nthorized access.\n\nException: Treated-water storage tanks that are less\nthan 800 gallons (3028 L) in volume and installed\nbelow grade shall not be required to be equipped with\na manhole provided that the tank has a service port of\nnot less than 8 inches (203 mm) in diameter.\n\n1301.9.7 Venting. Storage tanks shall be provided with a\nvent sized in accordance with Chapter 9 and based on the\naggregate diameter of all tank influent pipes. The reser-\nvoir vent shall not be connected to sanitary drainage\nsystem vents. Vents shall be protected from contamina-\ntion by means of an approved cap or U-bend installed\nwith the opening directed downward. Vent outlets shall\nextend not less than 4 inches (102 mm) above grade or as\nnecessary to prevent surface water from entering the stor-\nage tank. Vent openings shall be protected against the\nentrance of vermin and insects in accordance with the\nrequirements of Section 1301.7.\n\n1301.9.8 Draining of tanks. Tanks shall be provided\nwith a means of emptying the contents for the purpose of\nservice or cleaning. Tanks shall be drained by using a\npump or by a drain located at the lowest point in the tank.\nThe tank drain pipe shall discharge as required for over-\nflow pipes and shall not be smaller in size than specified\nin Table 606.5.7. Not less than one cleanout shall be\nprovided on each drain pipe in accordance with Section\n708.\n\n1301.9.9 Marking and signage. Each nonpotable water\nstorage tank shall be labeled with its rated capacity. The\ncontents of storage tanks shall be identified with the\nwords “CAUTION: NONPOTABLE WATER — DO\nNOT DRINK.” Where an opening is provided that could\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 121,
        "text": "allow the entry of personnel, the opening shall be marked\nwith the words, “DANGER — CONFINED SPACE.”\nMarkings shall be indelibly printed on the tank or ona tag\nor sign constructed of corrosion-resistant waterproof\nmaterial that is mounted on the tank. The letters of the\nwords shall be not less than 0.5 inch (12.7 mm) in height\nand shall be of a color in contrast with the background on\nwhich they are applied.\n\n1301.9.10 Storage tank tests. Storage tanks shall be\ntested in accordance with the following:\n\nStorage tanks shall be filled with water to the overflow\nline prior to and during inspection. Seams and joints shall\nbe left exposed and the tank shall remain watertight with-\nout leakage for a period of 24 hours.\n\n1. After 24 hours, supplemental water shall be intro-\nduced for a period of 15 minutes to verify proper\ndrainage of the overflow system and that there are\nno leaks.\n\n2. The tank drain shall be observed for proper\noperation.\n\n3. The makeup water system shall be observed for\nproper operation and successful automatic shutoff\nof the system at the refill threshold shall be\nverified.\n\n1301.10 System abandonment. If the owner of an on-site\nnonpotable water reuse system or rainwater collection and\nconveyance system elects to cease use of, or fails to properly\nmaintain such system, the system shall be abandoned and\nshall comply with the following:\n\n1. All system piping connecting to a utility-provided\nwater system shall be removed or disabled.\n\n2. The distribution piping system shall be replaced with\nan approved potable water supply piping system.\nWhere an existing potable pipe system is already in\nplace, the fixtures shall be connected to the existing\nsystem.\n\n3. The storage tank shall be secured from accidental\n\naccess by sealing or locking tank inlets and access\npoints, or filling with sand or equivalent.\n\n1301.11 Trenching requirements for nonpotable water\npiping. Nonpotable water collection and distribution piping\nand reclaimed water piping shall be separated from the\nbuilding sewer and potable water piping underground by 5\nfeet (1524 mm) of undisturbed or compacted earth. Nonpota-\nble water collection and distribution piping shall not be\nlocated in, under or above cesspools, septic tanks, septic tank\ndrainage fields or seepage pits. Buried nonpotable water\npiping shall comply with the requirements of Section 306.\n\nExceptions:\n\n1. The required separation distance shall not apply\nwhere the bottom of the nonpotable water pipe\nwithin 5 feet (1524 mm) of the sewer is not less\nthan 12 inches (305 mm) above the top of the\nhighest point of the sewer and the pipe materials\nconform to Table 702.3.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nNONPOTABLE WATER SYSTEMS\n\n2. The required separation distance shall not apply\nwhere the bottom of the potable water service pipe\nwithin 5 feet (1524 mm) of the nonpotable water\npipe is not less than 12 inches (305 mm) above the\ntop of the highest point of the nonpotable water\npipe and the pipe materials comply with the\nrequirements of Table 605.4.\n\n3. Nonpotable water pipe is permitted to be located\nin the same trench with a building sewer, provided\nthat such sewer is constructed of materials that\ncomply with the requirements of Table 702.2.\n\n4. The required separation distance shall not apply\nwhere a nonpotable water pipe crosses a sewer\npipe, provided that the pipe is sleeved to not less\nthan 5 feet (1524 mm) horizontally from the sewer\npipe centerline on both sides of such crossing, with\npipe materials that comply with Table 702.2.\n\n5. The required separation distance shall not apply\nwhere a potable water service pipe crosses a\nnonpotable water pipe, provided that the potable\nwater service pipe is sleeved for a distance of not\nless than 5 feet (1524 mm) horizontally from the\ncenterline of the nonpotable pipe on both sides of\nsuch crossing, with pipe materials that comply\nwith Table 702.2.\n\n6. Irrigation piping located outside of a building and\ndownstream of the backflow preventer is not\nrequired to meet the trenching requirements where\nnonpotable water is used for outdoor applications.\n\n1301.12 Outdoor outlet access. Sillcocks, hose bibbs, wall\nhydrants, yard hydrants and other outdoor outlets supplied\nby nonpotable water shall be located in a locked vault or\nshall be operable only by means of a removable key.\n\nSECTION 1302\nON-SITE NONPOTABLE WATER REUSE SYSTEMS\n\n1302.1 General. The provisions of ASTM E2635 and\nSection 1302 shall govern the construction, installation,\nalteration and repair of on-site nonpotable water reuse\nsystems for the collection, storage, treatment and distribution\nof on-site sources of nonpotable water as permitted by the\n\njurisdiction.\n\n1302.2 Sources. On-site nonpotable water reuse systems\nshall collect waste discharge from only the following\nsources: bathtubs, showers, lavatories, clothes washers and\nlaundry trays. Where approved and as appropriate for the\nintended application, water from other nonpotable sources\nshall be collected for reuse by on-site nonpotable water reuse\nsystems.\n\n1302.2.1 Prohibited sources. Wastewater containing\nurine or fecal matter shall not be diverted to on-site\nnonpotable water reuse systems and shall discharge to the\nsanitary drainage system of the building or premises in\naccordance with Chapter 7. Reverse osmosis system\nreject water, water softener discharge water, kitchen sink\n\n13-3\n"
    },
    {
        "page": 122,
        "text": "NONPOTABLE WATER SYSTEMS\n\nwastewater, dishwasher wastewater and wastewater\ndischarged from wet-hood scrubbers shall not be\ncollected for reuse in an on-site nonpotable water reuse\nsystem.\n\n1302.3 Traps. Traps serving fixtures and devices discharg-\ning wastewater to on-site nonpotable water reuse systems\nshall comply with Section 1002.4.\n\n1302.4 Collection pipe. On-site nonpotable water reuse\nsystems shall utilize drainage piping approved for use in\nplumbing drainage systems to collect and convey untreated\nwater for reuse. Vent piping approved for use in plumbing\nventing systems shall be utilized for vents in the graywater\nsystem. Collection and vent piping materials shall comply\nwith Section 702.\n\n1302.4.1 Installation. Collection piping conveying\nuntreated water for reuse shall be installed in accordance\nwith Section 704.\n\n1302.4.2 Joints. Collection piping conveying untreated\nwater for reuse shall utilize joints approved for use with\nthe distribution piping and appropriate for the intended\napplications as specified in Section 705.\n\n1302.4.3 Size. Collection piping conveying untreated\nwater for reuse shall be sized in accordance with drainage\nsizing requirements specified in Section 710.\n\n1302.4.4 Marking. Additional marking of collection\npiping conveying untreated water for reuse shall not be\nrequired beyond that required for sanitary drainage, waste\nand vent piping by Chapter 7.\n1302.5 Filtration. Untreated water collected for reuse shall\nbe filtered as required for the intended end use. Filters shall\nbe provided with access for inspection and maintenance.\nFilters shall utilize a pressure gauge or other approved\nmethod to provide indication when a filter requires servicing\nor replacement. Filters shall be installed with shutoff valves\nimmediately upstream and downstream to allow for isolation\nduring maintenance.\n\n1302.6 Disinfection and treatment. Where the intended\napplication for nonpotable water collected on site for reuse\nrequires disinfection or other treatment or both, it shall be\ndisinfected as needed to ensure that the required water qual-\nity is delivered at the point of use. Nonpotable water\n\ncollected on site containing untreated graywater shall be\nretained in collection reservoirs for not longer than 24 hours.\n\n1302.6.1 Graywater used for fixture flushing. Gray-\nwater used for flushing water closets and urinals shall be\ndisinfected and treated by an on-site water reuse treat-\nment system complying with NSF 350.\n\n1302.7 Storage tanks. Storage tanks utilized in on-site\nnonpotable water reuse systems shall comply with Sections\n1301.9, 1302.7.1 and 1302.7.2.\n\n1302.7.1 Location. Storage tanks shall be located with a\nminimum horizontal distance between various elements\nas indicated in Table 1302.7.1.\n\n1302.7.2 Outlets. Outlets shall be located not less than 4\ninches (102 mm) above the bottom of the storage tank and\nshall not skim water from the surface.\n\n1302.8 Valves. Valves shall be supplied on on-site nonpota-\nble water reuse systems in accordance with Sections\n1302.8.1 and 1302.8.2.\n\n1302.8.1 Bypass valve. One three-way diverter valve\nlisted and labeled to NSF 50 or other approved device\nshall be installed on collection piping upstream of each\nstorage tank, or drainfield, as applicable, to divert\nuntreated on-site reuse sources to the sanitary sewer to\nallow servicing and inspection of the system. Bypass\nvalves shall be installed downstream of fixture traps and\nvent connections. Bypass valves shall be marked to indi-\ncate the direction of flow, connection and storage tank or\ndrainfield connection. Bypass valves shall be provided\nwith access that allows for removal. Two shutoff valves\nshall not be installed to serve as a bypass valve.\n\n1302.8.2 Backwater valve. One or more backwater\nvalves shall be installed on each overflow and tank drain\npipe. Backwater valves shall be in accordance with\nSection 714.\n\n1302.9 Pumping and control system. Mechanical equip-\nment including pumps, valves and filters shall be easily\naccessible and removable in order to perform repair, mainte-\nnance and cleaning. The minimum flow rate and flow\npressure delivered by the pumping system shall be appropri-\nate for the application and in accordance with Section 604.\n\nTABLE 1302.7.1\nLOCATION OF NONPOTABLE\nWATER REUSE STORAGE TANKS\n\nELEMENT\n\nMINIMUM HORIZONTAL DISTANCE FROM STORAGE TANK (feet) |\n\nCritical root zone (CRZ) of protected trees\n\nLot line adjoining private lots\n\nPublic water main\nSeepage pits\nSeptic tanks\nStreams and lakes\nWater service\n\nWater wells\n\nFor SI: 1 foot = 304.8 mm.\n\n13-4\n\n10\n\n50\n\n50\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 123,
        "text": "1302.10 Water pressure-reducing valve or regulator.\nWhere the water pressure supplied by the pumping system\nexceeds 80 psi (552 kPa) static, a pressure-reducing valve\nshall be installed to reduce the pressure in the nonpotable\nwater distribution system piping to 80 psi (552 kPa) static or\nless. Pressure-reducing valves shall be specified and\ninstalled in accordance with Section 604.8.\n\n1302.11 Distribution piping. Distribution piping utilized in\non-site nonpotable water reuse systems shall comply with\nSections 1302.11.1 through 1302.11.3.\n\nException: Irrigation piping located outside of the build-\ning and downstream of a backflow preventer.\n\n1302.11.1 Materials, joints and connections. Distribu-\ntion piping shall conform to the standards and\nrequirements specified in Section 605.\n\n1302.11.2 Design. On-site nonpotable water reuse distri-\nbution piping systems shall be designed and sized in\naccordance with Section 604 for the intended application.\n\n1302.11.3 Labeling and marking. On-site nonpotable\nwater distribution piping labeling and marking shal\ncomply with Section 608.9.\n\n1302.12 Tests and inspections. Tests and inspections shal\nbe performed in accordance with Sections 1302.12.1 through\n1302.12.6.\n\n1302.12.1 Collection pipe and vent test. Drain, waste\nand vent piping used for on-site water reuse systems shal\nbe tested in accordance with Section 312.\n\n1302.12.2 Storage tank test. Storage tanks shall be tested\nin accordance with Section 1301.9.10.\n\n1302.12.3 Water supply system test. The testing o\nmakeup water supply piping and distribution piping shal\nbe conducted in accordance with Section 312.5.\n\n1302.12.4 Inspection and testing of backflow preven-\ntion assemblies. The testing of backflow preventers and\nbackwater valves shall be conducted in accordance with\nSection 312.10.\n\n1302.12.5 Inspection of vermin and insect protection.\nInlets and vents to the system shall be inspected to verify\nthat each is protected to prevent the entrance of insects\nand vermin into the storage tank and piping systems in\naccordance with Section 1301.7.\n\n1302.12.6 Water quality test. The quality of the water\nfor the intended application shall be verified at the point\nof use in accordance with the requirements of the\njurisdiction.\n\n1302.13 Operation and maintenance manuals. Operation\nand maintenance materials shall be supplied with nonpotable\non-site water reuse systems in accordance with Sections\n1302.13.1 through 1302.13.4.\n\n1302.13.1 Manual. A detailed operations and mainte-\nnance manual shall be supplied in hardcopy form with all\nsystems.\n\n1302.13.2 Schematics. The manual shall include a\ndetailed system schematic, and the locations and a list of\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nNONPOTABLE WATER SYSTEMS\n\nall system components, including manufacturer and\nmodel number.\n\n1302.13.3 Maintenance procedures. The manual shall\nprovide a schedule and procedures for all system compo-\nnents requiring periodic maintenance. Consumable parts,\nincluding filters, shall be noted along with part numbers.\n\n1302.13.4 Operations procedures. The manual shall\ninclude system startup and shutdown procedures. The\nmanual shall include detailed operating procedures for the\nsystem.\n\nSECTION 1303\nNONPOTABLE RAINWATER\nCOLLECTION AND DISTRIBUTION SYSTEMS\n\n1303.1 General. The provisions of Section 1303 shall\ngovern the construction, installation, alteration and repair of\nrainwater collection and conveyance systems for the collec-\ntion, storage, treatment and distribution of rainwater for\nnonpotable applications, as permitted by the jurisdiction.\n\n1303.1.1 Fire protection systems. The storage, treatment\nand distribution of nonpotable water to be used for fire\nprotection systems shall be in accordance with the Jnter-\nnational Fire Code.\n\n1303.2 Collection surface. Rainwater shall be collected\nonly from above-ground impervious roofing surfaces\nconstructed from approved materials and where approved,\nvehicular parking or pedestrian walking surfaces.\n\n1303.3 Debris excluders. Downspouts and leaders shall be\nconnected to a debris excluder or equivalent device that is\ndesigned to remove leaves, sticks, pine needles and similar\ndebris to prevent such from entering the storage tank.\n\n1303.4 First-flush diverter. First-flush diverters shall oper-\nate automatically and shall not rely on manually operated\nvalves or devices. Diverted rainwater shall not be drained to\nthe roof surface, and shall be discharged in a manner consis-\ntent with the storm water runoff requirements of the\n\njurisdiction. First-flush diverters shall be provided with\n\naccess for maintenance and service.\n\n1303.5 Roof gutters and downspouts. Gutters and down-\nspouts shall be constructed of materials that are compatible\nwith the collection surface and the rainwater quality for the\ndesired end use. Joints shall be watertight.\n\n1303.5.1 Slope. Roof gutters, leaders and rainwater\ncollection piping shall slope continuously toward collec-\ntion inlets. Gutters and downspouts shall have a slope of\nnot less than '/, inch per foot (10.4 mm/m) along their\nentire length, and shall not permit the collection or pool-\ning of water at any point.\nException: Siphonic drainage systems installed in\naccordance with the manufacturer’s instructions shall\nnot be required to have a slope.\n1303.5.2 Size. Gutters and downspouts shall be installed\nand sized in accordance with Section 1106.6 and local\nrainfall rates.\n\n13-5\n"
    },
    {
        "page": 124,
        "text": "NONPOTABLE WATER SYSTEMS\n\n1303.5.3 Cleanouts. Cleanouts shall be provided in the\nwater conveyance system to allow access to all filters,\nflushes, pipes and downspouts.\n\n1303.6 Drainage. Water drained from the roof washer or\ndebris excluder shall not be drained to the sanitary sewer.\nSuch water shall be diverted from the storage tank and\ndischarge in a location that will not cause erosion or damage\nto property in accordance with the Jnternational Building\nCode. Roof washers and debris excluders shall be provided\nwith an automatic means of self-draining between rain\nevents, and shall not drain onto roof surfaces.\n\n1303.7 Collection pipe. Rainwater collection and convey-\nance systems shall utilize drainage piping approved for use\nwithin plumbing drainage systems to collect and convey\ncaptured rainwater. Vent piping approved for use within\nplumbing venting systems shall be utilized for vents within\nthe rainwater system. Collection and vent piping materials\nshall comply with Section 702.\n\n1303.7.1 Installation. Collection piping conveying\ncaptured rainwater shall be installed in accordance with\nSection 704.\n\n1303.7.2 Joints. Collection piping conveying captured\nrainwater shall utilize joints approved for use with the\ndistribution piping and appropriate for the intended appli-\ncations as specified in Section 705.\n\n1303.7.3 Size. Collection piping conveying captured rain-\nwater shall be sized in accordance with drainage sizing\nrequirements specified in Section 710.\n\n1303.7.4 Marking. Additional marking of collection\npiping conveying captured rainwater for reuse shall not\nbe required beyond that required for sanitary drainage,\nwaste and vent piping by Chapter 7.\n\n1303.8 Filtration. Collected rainwater shall be filtered as\nrequired for the intended end use. Filters shall be provided\nwith access for inspection and maintenance. Filters shall\nutilize a pressure gauge or other approved method to provide\nindication when a filter requires servicing or replacement.\nFilters shall be installed with shutoff valves installed imme-\ndiately upstream and downstream to allow for isolation\nduring maintenance.\n\n1303.9 Disinfection. Where the intended application for\nrainwater requires disinfection or other treatment or both, it\nshall be disinfected as needed to ensure that the required\nwater quality is delivered at the point of use. Where chlorine\nis used for disinfection or treatment, water shall be tested for\nresidual chlorine in accordance with ASTM D1253. The\nlevels of residual chlorine shall not exceed that allowed for\nthe intended use in accordance with the requirements of the\njurisdiction.\n\n1303.10 Storage tanks. Storage tanks utilized in nonpotable\nrainwater collection and conveyance systems shall comply\nwith Sections 1301.9 and 1303.10.1 through 1303.10.3.\n\n1303.10.1 Location. Storage tanks shall be located with a\nminimum horizontal distance between various elements\nas indicated in Table 1303.10.1.\n\n13-6\n\nTABLE 1303.10.1\nLOCATION OF RAINWATER STORAGE TANKS\n\nMINIMUM HORIZONTAL DISTANCE\nFROM STORAGE TANK (feet)\n\neee | ELEMENT\n\n_ Critical root zone (CRZ) of\n\nprotected trees 2\nLot line adjoining private lots 5\nSeepage pits 5\nSeptic tanks 5\n\nFor SI: 1 foot = 304.8 mm.\n\n1303.10.2 Inlets. Storage tank inlets shall be designed to\nintroduce collected rainwater into the tank with minimum\nturbulence, and shall be located and designed to avoid\nagitating the contents of the storage tank.\n\n1303.10.3 Outlets. Outlets shall be located not less than 4\ninches (102 mm) above the bottom of the storage tank and\nshall not skim water from the surface.\n\n1303.11 Valves. Valves shall be supplied on rainwater\ncollection and conveyance systems in accordance with\nSection 1303.11.1.\n\n1303.11.1 Backwater valve. Backwater valves shall be\ninstalled on each overflow and tank drain pipe. Backwater\nvalves shall be in accordance with Section 714.\n\n1303.12 Pumping and control system. Mechanical equip-\nment including pumps, valves and filters shall be provided\nwith access that allows for removal in order to perform\nrepair, maintenance and cleaning. The minimum flow rate\nand flow pressure delivered by the pumping system shall be\nappropriate for the application and in accordance with\nSection 604.\n\n1303.13 Water pressure-reducing valve or regulator.\nWhere the water pressure supplied by the pumping system\nexceeds 80 psi (552 kPa) static, a pressure-reducing valve\nshall be installed to reduce the pressure in the rainwater\ndistribution system piping to 80 psi (552 kPa) static or less.\nPressure-reducing valves shall be specified and installed in\naccordance with Section 604.8.\n\n1303.14 Distribution piping. Distribution piping utilized in\nrainwater collection and conveyance systems shall comply\nwith Sections 1303.14.1 through 1303.14.3.\n\nException: Irrigation piping located outside of the build-\ning and downstream of a backflow preventer.\n\n1303.14.1 Materials, joints and connections. Distribu-\ntion piping shall conform to the standards and\nrequirements specified in Section 605 for nonpotable\nwater.\n\n1303.14.2 Design. Distribution piping systems shall be\ndesigned and sized in accordance with Section 604 for the\nintended application.\n\n1303.14.3 Labeling and marking. Nonpotable rainwater\ndistribution piping labeling and marking shall comply\nwith Section 608.9.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 125,
        "text": "1303.15 Tests and inspections. Tests and inspections shall\nbe performed in accordance with Sections 1303.15.1 through\n1303.15.9.\n\n1303.15.1 Roof gutter inspection and test. Roof gutters\nshall be inspected to verify that the installation and slope\nare in accordance with Section 1303.5.1. Gutters shall be\ntested by pouring not less than 1 gallon (3.8 L) of water\ninto the end of the gutter opposite the collection point.\nThe gutter being tested shall not leak and shall not retain\nstanding water.\n\n1303.15.2 First-flush diverter test. First-flush diverters\nshall be tested by introducing water into the collection\nsystem upstream of the diverter. Proper diversion of the\nfirst amount of water shall be in accordance with the\nrequirements of Section 1303.4.\n\n1303.15.3 Collection pipe and vent test. Drain, waste\nand vent piping used for rainwater collection and convey-\nance systems shall be tested in accordance with Section\n312.\n\n1303.15.4 Storage tank test. Storage tanks shall be tested\nin accordance with Section 1301.9.10.\n\n1303.15.5 Water supply system test. The testing of\nmakeup water supply piping and distribution piping shall\nbe conducted in accordance with Section 312.5.\n\n1303.15.6 Inspection and testing of backflow preven-\ntion assemblies. The testing of backflow preventers and\nbackwater valves shall be conducted in accordance with\nSection 312.10.\n\n1303.15.7 Inspection of vermin and insect protection.\nInlets and vents to the system shall be inspected to verify\nthat each is protected to prevent the entrance of insects\nand vermin into the storage tank and piping systems in\naccordance with Section 1301.7.\n\n1303.15.8 Water quality test. The quality of the water\nfor the intended application shall be verified at the point\nof use in accordance with the requirements of the\njurisdiction.\n\n1303.15.9 Collected raw rainwater quality. ASTM\nE2727 shall be used to determine what, if any, site condi-\ntions impact the quality of collected raw rainwater and\nwhether those site conditions require treatment of the raw\nwater for the intended end use or make the water unsuit-\nable for specific end uses.\n\n1303.16 Operation and maintenance manuals. Operation\nand maintenance manuals shall be supplied with rainwater\ncollection and conveyance systems in accordance with\nSections 1303.16.1 through 1303.16.4.\n1303.16.1 Manual. A detailed operations and mainte-\nnance manual shall be supplied in hardcopy form with all\nsystems.\n1303.16.2 Schematics. The manual shall include a\ndetailed system schematic, and the locations and a list of\n\nall system components, including manufacturer and\nmodel number.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nNONPOTABLE WATER SYSTEMS\n\n1303.16.3 Maintenance procedures. The manual shall\nprovide a maintenance schedule and procedures for all\nsystem components requiring periodic maintenance.\nConsumable parts, including filters, shall be noted along\nwith part numbers.\n\n1303.16.4 Operations procedures. The manual shall\ninclude system startup and shutdown procedures, as well\nas detailed operating procedures.\n\nSECTION 1304\nRECLAIMED WATER SYSTEMS\n\n1304.1 General. The provisions of this section shall govern\nthe construction, installation, alteration and repair of systems\nsupplying nonpotable reclaimed water.\n\n1304.2 Water pressure-reducing valve or regulator.\nWhere the reclaimed water pressure supplied to the building\nexceeds 80 psi (552 kPa) static, a pressure-reducing valve\nshall be installed to reduce the pressure in the reclaimed\nwater distribution system piping to 80 psi (552 kPa) static or\nless. Pressure-reducing valves shall be specified and\ninstalled in accordance with Section 604.8.\n\n1304.3 Reclaimed water systems. The design of the\nreclaimed water systems shall conform to accepted engi-\nneering practice.\n1304.3.1 Distribution piping. Distribution piping shall\ncomply with Sections 1304.3.1.1 through 1304.3.1.3.\n\nException: Irrigation piping located outside of the\nbuilding and downstream of a backflow preventer.\n\n1304.3.1.1 Materials, joints and connections. Distri-\nbution piping conveying reclaimed water shall\nconform to standards and requirements specified in\nSection 605 for nonpotable water.\n\n1304.3.1.2 Design. Distribution piping systems shall\nbe designed and sized in accordance with Section 604\nfor the intended application.\n\n1304.3.1.3 Labeling and marking. Nonpotable distri-\nbution piping labeling and marking shall comply with\nSection 608.9.\n\n1304.4 Tests and inspections. Tests and inspections shall be\nperformed in accordance with Sections 1304.4.1 and\n1304.4.2.\n\n1304.4.1 Water supply system test. The testing of\nmakeup water supply piping and reclaimed water distri-\nbution piping shall be conducted in accordance with\nSection 312.5.\n\n1304.4.2 Inspection and testing of backflow prevention\nassemblies. The testing of backflow preventers shall be\nconducted in accordance with Section 312.10.\n\n13-7\n"
    },
    {
        "page": 126,
        "text": "13-8 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 127,
        "text": "CHAPTER 14\nSUBSURFACE GRAYWATER SOIL ABSORPTION SYSTEMS\n\nUser note:\n\nAbout this chapter: Chapter 14 provides regulations for disposing of nonpotable water to underground landscape irrigation piping. Testing\nprocedures are provided to assess the capability of the soil to accept the volume of flow. This chapter covers the regulations, types and\n\nmaterial standards for the piping of these systems.\n\nSECTION 1401\nGENERAL\n\n1401.1 Scope. The provisions of this chapter shall govern\nthe materials, design, construction and installation of subsur-\nface graywater soil absorption systems connected to\nnonpotable water from on-site water reuse systems.\n\n1401.2 Materials. Above-ground drain, waste and vent\npiping for subsurface graywater soil absorption systems shall\nconform to one of the standards listed in Table 702.1.\nSubsurface graywater soil absorption systems, underground\nbuilding drainage and vent pipe shall conform to one of the\nstandards listed in Table 702.2.\n\n1401.3 Tests. Drain, waste and vent piping for subsurface\ngraywater soil absorption systems shall be tested in accor-\ndance with Section 312.\n\n1401.4 Inspections. Subsurface graywater soil absorption\nsystems shall be inspected in accordance with Section 108.\n\n1401.5 Disinfection. Disinfection shall not be required for\non-site nonpotable water reuse for subsurface graywater soil\nabsorption systems.\n\n1401.6 Coloring. On-site nonpotable water reuse for subsur-\nface graywater soil absorption systems shall not be required\nto be dyed.\n\nSECTION 1402\nSYSTEM DESIGN AND SIZING\n\n1402.1 Sizing. The system shall be sized in accordance with\nthe sum of the output of all water sources connected to the\nsubsurface graywater soil absorption system. Where graywa-\nter collection piping is connected to subsurface landscape\nirrigation systems, graywater output shall be calculated\naccording to the gallons-per-day-per-occupant number based\non the type of fixtures connected. The graywater discharge\nshall be calculated by the following equation:\n\nC=AxB (Equation 14-1)\nwhere:\nA = Number of occupants:\n\nResidential—Number of occupants shall be determined by\nthe actual number of occupants, but not less than two occu-\npants for one bedroom and one occupant for each additional\nbedroom.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nCommercial—Number of occupants shall be determined by\nthe International Building Code.\n\nB= Estimated flow demands for each occupant:\n\nResidential—25 gallons per day (94.6 Lpd) per occupant for\nshowers, bathtubs and lavatories and 15 gallons per day\n(56.7 Lpd) per occupant for clothes washers or laundry trays.\n\nCommercial—Based on type of fixture or water use records\nminus the discharge of fixtures other than those discharging\ngraywater.\n\nC =Estimated graywater discharge based on the total\nnumber of occupants.\n\n1402.2 Percolation tests. The permeability of the soil in the\nproposed absorption system shall be determined by percola-\ntion tests or permeability evaluation.\n\n1402.2.1 Percolation tests and procedures. Not fewer\nthan three percolation tests in each system area shall be\nconducted. The holes shall be spaced uniformly in rela-\ntion to the bottom depth of the proposed absorption\nsystem. More percolation tests shall be made where\nnecessary, depending on system design.\n\n1402.2.1.1 Percolation test hole. The test hole shall\nbe dug or bored. The test hole shall have vertical sides\nanda horizontal dimension of 4 inches to 8 inches (102\nmm to 203 mm). The bottom and sides of the hole\nshall be scratched with a sharp-pointed instrument to\nexpose the natural soil. Loose material shall be\nremoved from the hole and the bottom shall be covered\nwith 2 inches (51 mm) of gravel or coarse sand.\n\n1402.2.1.2 Test procedure, sandy soils. The hole\nshall be filled with clear water to not less than 12\ninches (305 mm) above the bottom of the hole for tests\nin sandy soils. The time for this amount of water to\nseep away shall be determined, and this procedure\nshall be repeated if the water from the second filling of\nthe hole seeps away in 10 minutes or less. The test\nshall proceed as follows: Water shall be added to a\npoint not more than 6 inches (152 mm) above the\ngravel or coarse sand. Thereupon, from a fixed refer-\nence point, water levels shall be measured at 10-\nminute intervals for a period of 1 hour. Where 6 inches\n(152 mm) of water seeps away in less than 10 minutes,\na shorter interval between measurements shall be used,\nbut in no case shall the water depth exceed 6 inches\n\n14-1\n"
    },
    {
        "page": 128,
        "text": "SUBSURFACE GRAYWATER SOIL ABSORPTION SYSTEMS\n\n(152 mm). Where 6 inches (152 mm) of water seeps\naway in less than 2 minutes, the test shall be stopped\nand a rate of less than 3 minutes per inch (7.2 s/mm)\nshall be reported. The final water level drop shall be\nused to calculate the percolation rate. Soils not meet-\ning the requirements of this section shall be tested in\naccordance with Section 1402.2.1.3.\n\n1402.2.1.3 Test procedure, other soils. The hole shall\nbe filled with clear water, and a minimum water depth\nof 12 inches (305 mm) shall be maintained above the\nbottom of the hole for a 4-hour period by refilling\nwhenever necessary or by use of an automatic siphon.\nWater remaining in the hole after 4 hours shall not be\nremoved. Thereafter, the soil shall be allowed to swell\nnot less than 16 hours or more than 30 hours. Immedi-\nately after the soil swelling period, the measurements\nfor determining the percolation rate shall be made as\nfollows: any soil sloughed into the hole shall be\nremoved and the water level shall be adjusted to 6\ninches (152 mm) above the gravel or coarse sand.\nThereupon, from a fixed reference point, the water\nlevel shall be measured at 30-minute intervals for a\nperiod of 4 hours, unless two successive water level\ndrops do not vary by more than '/,, inch (1.59 mm).\nNot fewer than three water level drops shall be\nobserved and recorded. The hole shall be filled with\nclear water to a point not more than 6 inches (152 mm)\nabove the gravel or coarse sand whenever it becomes\nnearly empty. Adjustments of the water level shall not\nbe made during the three measurement periods except\nto the limits of the last measured water level drop.\nWhere the first 6 inches (152 mm) of water seeps away\nin less than 30 minutes, the time interval between\nmeasurements shall be 10 minutes and the test run for\n1 hour. The water depth shall not exceed 5 inches (127\nmm) at any time during the measurement period. The\ndrop that occurs during the final measurement period\nshall be used in calculating the percolation rate.\n\n1402.2.1.4 Mechanical test equipment. Mechanical\npercolation test equipment shall be of an approved\ntype.\n1402.2.2 Permeability evaluation. Soil shall be evalu-\nated for estimated percolation based on structure and\n\ntexture in accordance with accepted soil evaluation prac-\ntices. Borings shall be made in accordance with Section\n1402.2.1.1 for evaluating the soil.\n\n1402.3 Subsurface graywater soil absorption site loca-\ntion. The surface grade of all soil absorption systems shall\nbe located at a point lower than the surface grade of any\nwater well or reservoir on the same or adjoining lot. Where\nthis is not possible, the site shall be located so surface water\ndrainage from the site is not directed toward a well or reser-\nvoir. The soil absorption system shall be located with a\nminimum horizontal distance between various elements as\nindicated in Table 1402.3. Private sewage disposal systems\nin compacted areas, such as parking lots and driveways, are\nprohibited. Surface water shall be diverted away from any\nsoil absorption site on the same or neighboring lots.\n\nSECTION 1403\nINSTALLATION\n\n1403.1 Installation. Absorption systems shall be installed in\naccordance with Sections 1403.1.1 through 1403.1.5.\n\n1403.1.1 Absorption area. The total absorption area\nrequired shall be computed from the estimated daily gray-\nwater discharge and the design-loading rate based on the\npercolation rate for the site. The required absorption area\nequals the estimated graywater discharge divided by the\ndesign-loading rate from Table 1403.1.1.\n\nTABLE 1403.1.1\nDESIGN LOADING RATE\n\nPERCOLATION RATE DESIGN LOADING FACTOR\npo {minutes per inch) (gallons per square foot per day,\n\n0 to less than 10 i\n\n10 to less than 30 0.8\n30 to less than 45 0.72\n45 to 60 0.4\n\nFor SI: 1 minute per inch = min/25.4 mm,\n1 gallon per square foot = 40.7 L/m’,\n1403.1.2 Seepage trench excavations. Seepage trench\nexcavations shall be not less than 1 foot (305 mm) in\nwidth and not greater than 5 feet (1524 mm) in width.\nTrench excavations shall be spaced not less than 2 feet\n\nTABLE 1402.3\nLOCATION OF SUBSURFACE GRAYWATER SOIL ABSORPTION SYSTEM\n\nELEMENT ———— Storage tank {feet} Absorption field (feet)\n~ Buildings 5 2 |\n\n. —f, . 3\nPublic water main 10 10\nSeepage pits 5 5\nSeptic tanks 0 5\nStreams and lakes 50 50\nWater service 5 5\nWater wells 50 100\n\nFor SI: 1 foot = 304.8 mm.\n\n14-2\n\n2021 INTERNATIONAL PLUMBING CODE®\n\n"
    },
    {
        "page": 129,
        "text": "(610 mm) apart. The soil absorption area of a seepage\ntrench shall be computed by using the bottom of the\ntrench area (width) multiplied by the length of pipe. Indi-\nvidual seepage trenches shall be not greater than 100 feet\n(30 480 mm) in developed length.\n\n1403.1.3 Seepage bed excavations. Seepage bed excava-\ntions shall be not less than 5 feet (1524 mm) in width and\nhave more than one distribution pipe. The absorption area\nof a seepage bed shall be computed by using the bottom\nof the trench area. Distribution piping in a seepage bed\nshall be uniformly spaced not greater than 5 feet (1524\nmm) and not less than 3 feet (914 mm) apart, and greater\nthan 3 feet (914 mm) and not less than 1 foot (305 mm)\nfrom the sidewall or headwall.\n\n1403.1.4 Excavation and construction. The bottom of a\ntrench or bed excavation shall be level. Seepage trenches\nor beds shall not be excavated where the soil is so wet that\nsuch material rolled between the hands forms a soil wire.\nSmeared or compacted soil surfaces in the sidewalls or\nbottom of seepage trench or bed excavations shall be\nscarified to the depth of smearing or compaction and the\nloose material removed. Where rain falls on an open\nexcavation, the soil shall be left until sufficiently dry so a\nsoil wire will not form when soil from the excavation\nbottom is rolled between the hands. The bottom area shall\nthen be scarified and loose material removed.\n\n1403.1.5 Aggregate and backfill. Not less than 6 inches\n(152 mm) in depth of aggregate, ranging in size from '/,\nto 2'/, inches (12.7 mm to 64 mm), shall be laid into the\ntrench below the distribution piping elevation. The aggre-\ngate shall be evenly distributed not less than 2 inches (51\nmm) in depth over the top of the distribution pipe. The\naggregate shall be covered with approved synthetic mate-\nrials or 9 inches (229 mm) of uncompacted marsh hay or\nstraw. Building paper shall not be used to cover the aggre-\ngate. Not less than 9 inches (229 mm) of soil backfill shall\nbe provided above the covering.\n\n1403.2 Distribution piping. Distribution piping shall be not\nless than 3 inches (76 mm) in diameter. Materials shall\ncomply with Table 1403.2. The top of the distribution pipe\nshall be not less than 8 inches (203 mm) below the original\nsurface. The slope of the distribution pipes shall be not less\nthan 2 inches (51 mm) and not greater than 4 inches (102\nmm) per 100 feet (30 480 mm).\n\nTABLE 1403.2\nDISTRIBUTION PIPE\n\nPolyvinyl chloride (PVC) plastic pipe ASTM D2729\nPolyvinyl chloride (PVC) plastic pipe with a\n3.5-inch O.D. and solid cellular core or ASTM F1488\n\ncomposite wal\n\nFor SI: 1 inch = 25.4 mm.\n\n1403.2.1 Joints. Joints in distribution pipe shall be made\nin accordance with Section 705.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nMA STANDARD\n\nee ee ee ee\n\nSUBSURFACE GRAYWATER SOIL ABSORPTION SYSTEMS\n\n14-3\n"
    },
    {
        "page": 130,
        "text": "14-4 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 131,
        "text": "CHAPTER 15\nREFERENCED STANDARDS\n\nUser note:\n\nAbout this chapter: This code contains numerous references to standards that are used to provide requirements for materials and methods of\nconstruction. Chapter 15 contains a comprehensive list of all standards that are referenced in this code. These standards, in essence, are part of\nthis code to the extent of the reference to the standard.\n\nThis chapter lists the standards that are referenced in various sections of this document. The standards are listed herein by the promulgating\nagency of the standard, the standard identification, the effective date and title, and the section or sections of this document that reference the\nstandard. The application of the referenced standards shall be as specified in Section 102.8.\n\nANSI American National Standards Institute\n25 West 43rd Street, 4th Floor\nNew York, NY 10036\nA118.10—14: Specifications for Load Bearing, Bonded, Waterproof Membranes for Thin Set Ceramic Tile and Dimension Stone\nInstallation\n421.5.2.5, 421.5.2.6\nZ21.22—99 (R2003): Relief Valves for Hot Water Supply Systems with Addenda Z21.22a—2000 (R2003) and Z21.22b—2001 (R2003)\n504.2, 504.4, 504.4.1\n\nASHRAE ASHRAE\n1791 Tullie Circle NE\nAtlanta, GA 30329\nASHRAE 18—2008 (RA13): Method of Testing for Rating Drinking-Water Coolers with Self-contained Mechanical Refrigeration\n(ANSI/ASHRAE Approved)\n410.1\n\nASME American Society of Mechanical Engineers\nTwo Park Avenue\nNew York, NY 10016-5990\nA112.1.2—2022: Air Gaps in Plumbing Systems (For Plumbing Fixtures and Water Connection Receptors)\n406.1, 409.2, Table 608.1, 608.14.1\nA112.1.3—2000 (R2020): Air Gap Fittings for Use with Plumbing Fixtures, Appliances and Appurtenances\n406.1, 409.2, Table 608.1, 608.14.1, 1102.6\nA112.3.1—2007 (R2022): Stainless Steel Drainage Systems for Sanitary, DWV, Storm and Vacuum Applications Above and Below\n\nGround\n413.1, Table 702.1, Table 702.2, Table 702.3, Table 702.4, Table 1102.4, Table 1102.5, 1102.6, Table\n\n1102.7\n\nA112.4.1—2009 (R2019): Water Heater Relief Valve Drain Tubes\n504.6\n\nA112.4.2—2020/CSA B45.16—20: Water Closet Personal Hygiene Devices\n412.9\n\nA112.4.3—1999 (R2020): Plastic Fittings for Connecting Water Closets to the Sanitary Drainage System\n405.4\n\nA112.4.4—2017: Plastic Push-Fit Drain, Waste, and Vent (DWV) Fittings\n705.2.4\n\nA112.4.14—2004 (R2019): Manually Operated, Quarter-Turn Shutoff Valves for Use in Plumbing Systems\nTable 605.7\n\nA112.6.1M —1997(R2017): Floor Affixed Supports for Off-the-Floor Plumbing Fixtures for Public Use\n405.4.3\n\n2021 INTERNATIONAL PLUMBING CODE® 15-1\n"
    },
    {
        "page": 132,
        "text": "REFERENCED STANDARDS\n\nASME—continued\nA112.6.2—2022: Framing-Affixed Supports for Off-the-Floor Water Closets with Concealed Tanks\n\n405.4.3\n\nA112.6.3—2019: Floor and Trench Drains\n413.1\n\nA112.6.4—2003 (R2020): Roof, Deck, and Balcony Drains\n1102.6\n\nA112.6.7—2010 (R2020): Sanitary Floor Sinks\n414.1\n\nA112.6.9—2005 (R2020): Siphonic Roof Drains\n1107.1\n\nA112.14.1—2003 (R2022): Backwater Valves\n714.2\n\nA112.14.3—2021: Grease Interceptors\n1003.3.5\n\nA112.14.4—2001 (R2022): Grease Removal Devices\n1003.3.5\n\nA112.14.6—2010 (R2020): FOG (Fats, Oils and Greases) Disposal Systems\n1003.3, 1003.3.5, 1003.3.7\n\nA112.18.1—2020/CSA B125.1—2020: Plumbing Supply Fittings\n412.1, 412.2, 412.3, 412.4, 412.6, 412.8, Table 605.7, 607.4, 608.2\nA112.18.2—2019/CSA B125.2—19: Plumbing Waste Fittings\n412.1.2, 421.3.1\nA112.18.3—2002 (R2020): Performance Requirements for Backflow Protection Devices and Systems in Plumbing Fixture Fittings\n412.2, 412.6\nA112.18.6—2021/CSA B125.6—21: Flexible Water Connectors\n605.6\nA112.19.1—2020/CSA B45.2—20: Enameled Cast Iron and Enameled Steel Plumbing Fixtures\n407.1, 410.1, 418.1, 419.1, 421.1, 422.1\nA112.19.2—2020/CSA B45.1—20: Ceramic Plumbing Fixtures\n401.2, 405.10, 407.1, 408.1, 410.1, 418.1, 419.1, 421.1, 422.1, 424.1, 425.1\nA112.19.3—2021/CSA B45.4—2021: Stainless Steel Plumbing Fixtures\n405.9, 407.1, 408.1, 410.1, 418.1, 419.1, 421.1, 425.1\nA112.19.5—2021/CSA B45.15— 2021: Flush Valves and Spuds for Water Closets, Urinals, and Tanks\n415.4\nA112.19.7—2012/CSA B45.10—2012 (R2021): Hydromassage Bathtub Systems\n426.1, 426.4\n\nA112.19.12—2019: Wall Mounted and Pedestal Mounted, Adjustable, Elevating, Tilting and Pivoting Lavatory, Sink and Shampoo Bowl\nCarrier Systems and Drain Waste Systems\n419.4\n\nA112.19.14—2013 (R2018): Six-liter Water Closets Equipped with a Dual Flushing Device\n425.1\n\nA112.19.15—2012 (R2017): Bathtub/Whirlpool Bathtubs with Pressure Sealed Doors\n407.4, 426.6\n\nA112.19.19—2021: Vitreous China Nonwater Urinals\n424.1\n\nA112.21.3—1985 (R2017): Hydrants for Utility and Maintenance Use\nTable 608.1, 608.14.6\n\nA112.36.2M—1991 (R2017): Cleanouts\n708.1.11.2\n\nASME A112.3.4—2020/CSA B45.9—20: Macerating Toilet Systems and Waste Pumping Systems for Plumbing Fixtures\n405.5, 712.4.1\n\n15-2 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 133,
        "text": "REFERENCED STANDARDS\n\nASME—continued\nASSE 1002—2020/ASME A112.1002—2020/CSA B125.12—2020: Anti-Siphon Fill Valves for Water Closet Tanks\n415.3.1, Table 608.1\nASSE 1016—2020/ASME A112.1016—2020/CSA B125.16—2020: Performance Requirements for Automatic Compensating Valves for\nIndividual Showers and Tub/Shower Combinations\n412.3, 412.4, 607.4\nASSE 1037—2015/ASME A112.1037—2015/CSA B125.37—2015: Pressurized Flushing Devices for Plumbing Fixtures\n415.2\nASSE 1070—2020/ASME A112.1070—2020/CSA B125.1070—20: Water Temperature Limiting Devices\n408.3, 412.5, 412.10, 419.5, 423.3, 607.1.2\nB1.20.1—2019: Pipe Threads, General Purpose (inch)\n605.10.3, 605.12.4, 605.14.3, 605.17.1, 705.2.3, 705.5.4, 705.8.1, 705.10.3\nB16.3—2021: Malleable Iron Threaded Fittings Classes 150 and 300\nTable 1102.7\nB16.4—2021: Gray Iron Threaded Fittings Classes 125 and 250\nTable 605.5, Table 702.4, Table 1102.7\nB16.9—2018: Factory-Made Wrought Steel Buttwelding Fittings\nTable 605.5, Table 702.4, Table 1102.7\nB16.11—2021: Forged Fittings, Socket-Welding and Threaded\nTable 605.5, Table 702.4, Table 1102.7\nB16.12—2009 (R2019): Cast Iron Threaded Drainage Fittings\nTable 702.4, Table 1102.7\nB16.15—2018: Cast Alloy Threaded Fittings: Class 125 and 250\nTable 605.5, Table 702.4, Table 1102.7\nB16.18—2018: Cast Copper Alloy Solder Joint Pressure Fittings\nTable 605.5, Table 702.4, Table 1102.7\nB16.22—2018: Wrought Copper and Copper Alloy Solder Joint Pressure Fittings\nTable 605.5, Table 702.4, Table 1102.7\nB16.23—2021: Cast Copper Alloy Solder Joint Drainage Fittings DWV\nTable 702.4, Table 1102.7\nB16.26—2018: Cast Copper Alloy Fittings for Flared Copper Tubes\nTable 605.5, Table 702.4, Table 1102.7\nB16.28—1994: Wrought Steel Buttwelding Short Radius Elbows and Returns\nTable 605.5, Table 702.4, Table 1102.7\n\nB16.29—2017: Wrought Copper and Wrought Copper Alloy Solder Joint Drainage Fittings (DWV)\nTable 702.4, Table 1102.7\n\nB16.34—2020: Valves—Flanged, Threaded and Welding End\n\nTable 605.7\nB16.51—2018: Copper and Copper Alloy Press-Connect Pressure Fittings\nTable 605.5\nASPE American Society of Plumbing Engineers\n\n6400 Shafer Ct, Suite 350\nRosemont, IL 60018-4914\n\n45—2013: Siphonic Roof Drainage Systems\n1107.1\n\nASPE/IAPMO Z1034—2015: Test Method for Evaluating Roof Drain Performance\n1102.6\n\n2021 INTERNATIONAL PLUMBING CODE® 15-3\n"
    },
    {
        "page": 134,
        "text": "REFERENCED STANDARDS\n\nASSE ASSE International\n\n18927 Hickory Creek Drive, Suite 220\nMokena, IL 60448\n1001—2017: Performance Requirements for Atmospheric Type Vacuum Breakers\n415.2, Table 608.1, 608.14.6, 608.17.4.1\n1003—09: Performance Requirements for Water Pressure Reducing Valves\n604.8\n1004—2016: Performance Requirements for Commercial Dishwashing Machines\n409.1\n1005—99: Performance Requirements for Water Heater Drain Valves\n501.3\n1008—06: Performance Requirements for Plumbing Aspects of Food Waste Disposer Units\n413.1\n1010—04: Performance Requirements for Water Hammer Arresters\n604.9\n1011—2016: Performance Requirements for Hose Connection Vacuum Breakers\nTable 608.1, 608.14.6\n1012—09: Performance Requirements for Backflow Preventers with Intermediate Atmospheric Vent\nTable 608.1, 608.14.3, 608.17.2, 608.17.10\n1013—2011: Performance Requirements for Reduced Pressure Principle Backflow Preventers and Reduced Pressure Principle Fire\nProtection Backflow Preventers\nTable 608.1, 608.14.2, 608.17.2\n1015—2017: Performance Requirements for Double Check Backflow Prevention Assemblies and Double Check Fire Protection\nBackflow Prevention Assemblies\n607.1.2, Table 608.1, 608.14.7\n1017—2009: Performance Requirements for Temperature Actuated Mixing Valves for Hot Water Distribution Systems\n501.2, 613.1\n1018—2001: Performance Requirements for Trap Seal Primer Valves; Potable Water Supplied\n1002.4.1.2\n1019—2011 (R2016): Performance Requirements for Vacuum Breaker Wall Hydrants, Freeze Resistant, Automatic Draining Type\nTable 608.1, 608.14.6\n1020—04: Performance Requirements for Pressure Vacuum Breaker Assembly\nTable 608.1, 608.14.5\n1022—2017: Performance Requirements for Backflow Preventer for Beverage Dispensing Equipment\nTable 608.1, 608.17.1.1, 608.17.1.2\n1024—2017: Performance Requirements for Dual Check Valve Type Backflow Preventers, Anti-siphon-type, Residential Applications\n605.3.1, Table 608.1, 608.14.9, 608.17.1.2\n1035—08: Performance Requirements for Laboratory Faucet Backflow Preventers\nTable 608.1, 608.14.6\n1044—2015: Performance Requirements for Trap Seal Primer Devices—Drainage Types and Electronic Design Types\n1002.4.1.3\n1047—2011: Performance Requirements for Reduced Pressure Detector Fire Protection Backflow Prevention Assemblies\nTable 608.1, 608.14.2\n1048—2011: Performance Requirements for Double Check Detector Fire Protection Backflow Prevention Assemblies\nTable 608.1, 608.14.7\n\n1049—2009: Performance Requirements for Individual and Branch Type Air Admittance Valves for Chemical Waste Systems\n\n901.3, 918.8\n\n1050—2009: Performance Requirements for Stack Air Admittance Valves for Sanitary Drainage Systems\n918.1\n\n1051—2009: Performance Requirements for Individual and Branch Type Air Admittance Valves for Sanitary Drainage Systems\n918.1\n\n15-4 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 135,
        "text": "REFERENCED STANDARDS\n\nASSE—continued\n1052—2016: Performance Requirements for Hose Connection Backflow Preventers\nTable 608.1, 608.14.6\n\n1055—2018: Performance Requirements for Chemical Dispensing Systems\n608.14.8\n\n1056—2013: Performance Requirements for Spill Resistant Vacuum Breaker\nTable 608.1, 608.14.5\n\n1060—2017: Performance Requirements for Outdoor Enclosures for Fluid Conveying Components\n608.15.1\n\n1061—2015: Performance Requirements for Push Fit Fittings\nTable 605.5, 605.14.4, 605.16.3\n\n1062—2017: Performance Requirements for Temperature Actuated, Flow Reduction (TAFR) Valves to Individual Supply Fittings\n412.7\n\n1064—2006 (R2011): Performance Requirements for Backflow Prevention Assembly Field Test Kits\n312.10.2\n\n1066—1997: Performance Requirements for Individual Pressure Balancing In-line Valves for Individual Fixture Fittings\n604.11\n\n1069—05: Performance Requirements for Automatic Temperature Control Mixing Valves\n412.4\n\n1071—2012: Performance Requirements for Temperature Actuated Mixing Valves for Plumbed Emergency Equipment\n411.3, 412.10, 412.5, 419.5, 423.3, 607.1.2\n\n1072—07: Performance Requirements for Barrier Type Floor Drain Tap Seal Protection Devices\n1002.4.1.4\n\n1079—2005: Performance Requirements for Dielectric Pipe Unions\n605.23.1, 605.23.3\n\n1081—2014: Performance Requirements for Backflow Preventers with Integral Pressure Reducing Boiler Feed Valve and Intermediate\nAtmospheric Vent Style for Domestic and Light Commercial Water Distribution Systems\n608.14.3, 608.17.2\n\n1082—2018: Performance Requirements for Water Heaters with Integral Temperature Control Devices for Hot Water Distribution\nSystems.\n412.10, 607.1.1\n1084—2018: Performance Requirements for Water Heaters with Temperature Limiting Capacity\n412.5, 607.1.2\n\n1085—2018: Performance Requirements for Water Heaters for Emergency Equipment\n411.3, 607.1.1, 607.1.2\n\n5013—2015: Performance Requirements for Testing Reduced Pressure Principle Backflow Prevention Assembly (RPA) and Reduced\nPressure Fire Protection Backflow Preventers (RFP)\n312.10.2\n\n5015—2015: Performance Requirements for Testing Double Check Valve Backflow Prevention Assemblies (DC) and Double Check Fire\nProtection Backflow Prevention Assemblies (DCF)\n312.10.2\n\n5020—2015: Performance Requirements for Testing Pressure Vacuum Breaker Assemblies (PVBA)\n312.10.2\n5047—2015: Performance Requirements for Testing Reduced Pressure Detector Fire Protection Backflow Prevention Assemblies\n(RPDA)\n312.10.2\n5048—2015: Performance Requirements for Testing Double Check Valve Detector Assembly (DCDA)\n312.10.2\n5052—98: Performance Requirements for Testing Hose Connection Backflow Preventers\n312.10.2\n5056—2015: Performance Requirements for Testing Spill Resistant Vacuum Breaker (SRVB)\n312.10.2\nASSE 1002—2020/ASME A112.1002—2020/CSA B125.12—2020: Anti-Siphon Fill Valves for Water Closet Tanks\n415.3.1, Table 608.1\n\n2021 INTERNATIONAL PLUMBING CODE® 15-5\n"
    },
    {
        "page": 136,
        "text": "REFERENCED STANDARDS\n\nASSE—continued\nASSE 1016—2020/ASME A112.1016—2020/CSA B125.16—2020: Performance Requirements for Automatic Compensating Valves for\nIndividual Showers and Tub/Shower Combinations\n\n412.3, 412.4, 607.4\nASSE 1037—2015/ASME A112.1037—2015/CSA B125.37—15: Pressurized Flushing Devices for Plumbing Fixtures\n\n415.2\nASSE 1070—2020/ASME A112.1070—2020/CSA B125.1070—20: Water Temperature Limiting Devices\n\n408.3, 412.5, 412.10, 419.5, 423.3, 607.1.2\n\nASTM ASTM International\n\n100 Barr Harbor Drive, P.O. Box C700\nWest Conshohocken, PA 19428-2959\nA53/A53M—2018: Specification for Pipe, Steel, Black and Hot-dipped, Zinc-coated Welded and Seamless\nTable 605.3, Table 605.4, Table 702.1\nA74—17: Specification for Cast-iron Soil Pipe and Fittings\nTable 702.1, Table 702.2, Table 702.3, Table 702.4, 708.1.6, Table 1102.4, Table 1102.5, Table 1102.7\nA269/A269M-15a: Standard Specification for Seamless and Welded Austenitic Stainless Steel Tubing for General Service\nTable 605.3\nA312/A312M—2018: Specification for Seamless, Welded, and Heavily Cold Worked Austenitic Stainless Steel Pipes\nTable 605.3, Table 605.4, Table 605.5, 605.22.2\nA733—16: Specification for Welded and Seamless Carbon Steel and Austenitic Stainless Steel Pipe Nipples\nTable 605.8\nA778/A778M—16: Specification for Welded Unannealed Austenitic Stainless Steel Tubular Products\nTable 605.3, Table 605.4, Table 605.5\nA888—2018: Specification for Hubless Cast-iron Soil Pipe and Fittings for Sanitary and Storm Drain, Waste, and Vent Piping\nApplication\nTable 702.1, Table 702.2, Table 702.3, Table 702.4, Table 1102.4, Table 1102.5, Table 1102.7\nB32—08(2014): Specification for Solder Metal\n605.12.3, 605.13.6, 705.5.3, 705.6.1\nB42—15a: Specification for Seamless Copper Pipe, Standard Sizes\nTable 605.3, Table 605.4, Table 702.1\nB43—15: Specification for Seamless Red Brass Pipe, Standard Sizes\nTable 605.4, Table 702.1\nB75/B75M—11: Specification for Seamless Copper Tube\nTable 605.3, Table 605.4, Table 702.1, Table 702.2, Table 702.3, Table 1102.4\nB88—2016: Specification for Seamless Copper Water Tube\nTable 605.3, Table 605.4, Table 702.1, Table 702.2, Table 702.3, Table 1102.4\nB152/B152M—13: Specification for Copper Sheet, Strip Plate and Rolled Bar\n402.3, 415.3.3, 902.2\nB251/B251M—2017: Specification for General Requirements for Wrought Seamless Copper and Copper-alloy Tube\nTable 605.3, Table 605.4, Table 702.1, Table 702.2, Table 702.3, Table 1102.4\nB302—17: Specification for Threadless Copper Pipe, Standard Sizes\nTable 605.3, Table 605.4, Table 702.1\nB306—13: Specification for Copper Drainage Tube (DWV)\nTable 702.1, Table 702.2, Table 1102.4\nB447—12a: Specification for Welded Copper Tube\nTable 605.3, Table 605.4\nB687—1999(2016): Specification for Brass, Copper and Chromium-plated Pipe Nipples\nTable 605.8\nB813—16: Specification for Liquid and Paste Fluxes for Soldering of Copper and Copper Alloy Tube\n605.12.3, 605.13.6, 705.5.3, 705.6.1\nB828—2016: Practice for Making Capillary Joints by Soldering of Copper and Copper Alloy Tube and Fittings\n605.12.3, 605.13.6, 705.5.3, 705.6.1\n\n15-6 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 137,
        "text": "REFERENCED STANDARDS\n\nASTM—continued\nC4—04(2018): Specification for Clay Drain Tile and Perforated Clay Drain Tile\nTable 702.3, Table 1102.4, Table 1102.5\nC14—15a: Specification for Nonreinforced Concrete Sewer, Storm Drain and Culvert Pipe\nTable 702.3, Table 1102.4\nC76—2018A: Specification for Reinforced Concrete Culvert, Storm Drain and Sewer Pipe\nTable 702.3, Table 1102.4\nC425—2004(2018): Specification for Compression Joints for Vitrified Clay Pipe and Fittings\n705.11, 705.16\nC443—2012(2017): Specification for Joints for Concrete Pipe and Manholes, Using Rubber Gaskets\n705.4, 705.16\nC564—14: Specification for Rubber Gaskets for Cast-iron Soil Pipe and Fittings\n705.3.2, 705.3.3, 705.16\nC700—2018: Specification for Vitrified Clay Pipe, Extra Strength, Standard Strength, and Perforated\nTable 702.3, Table 702.4, Table 1102.4, Table 1102.5\nC1053—2000(2015): Specification for Borosilicate Glass Pipe and Fittings for Drain, Waste, and Vent (DWV) Applications\nTable 702.1, Table 702.4\nC1173—2018: Specification for Flexible Transition Couplings for Underground Piping System\n705.2.1, 705.5, 705.10.1, 705.11, 705.12.2, 705.16\nC1277—2018: Specification for Shielded Coupling Joining Hubless Cast-iron Soil Pipe and Fittings\n705.3.3\nC1440—2017: Specification for Thermoplastic Elastomeric (TPE) Gasket Materials for Drain, Waste, and Vent (DWV), Sewer, Sanitary\nand Storm Plumbing Systems\n705.16\nC1460—2017: Specification for Shielded Transition Couplings for Use with Dissimilar DWV Pipe and Fittings Above Ground\n705.16\nC1461—2008(2017): Specification for Mechanical Couplings Using Thermoplastic Elastomeric (TPE) Gaskets for Joining Drain, Waste\nand Vent (DWV) Sewer, Sanitary and Storm Plumbing Systems for Above and Below Ground Use\n705.19\nC1540—2018: Specification for Heavy Duty Shielded Couplings Joining Hubless Cast-iron Soil Pipe and Fittings\n705.3.3\nC1563—2008(2017): Standard Test Method for Gaskets for Use in Connection with Hub and Spigot Cast Iron Soil Pipe and Fittings for\nSanitary Drain, Waste, Vent and Storm Piping Applications\n705.3.2\nD1253—14: Standard Test Method For Residual Chlorine in Water\n1301.2.1, 1303.9\nD1527—99(2005): Specification for Acrylonitrile-Butadiene-Styrene (ABS) Plastic Pipe, Schedules 40 and 80\nTable 605.3\nD1785—2015E1: Specification for Poly (Vinyl Chloride) (PVC) Plastic Pipe, Schedules 40, 80 and 120\nTable 605.3\nD2235—2004(2016): Specification for Solvent Cement for Acrylonitrile-Butadiene-Styrene (ABS) Plastic Pipe and Fittings\n605.10.2, 705.2.2\nD2239—12a: Specification for Polyethylene (PE) Plastic Pipe (SIDR-PR) Based on Controlled Inside Diameter\nTable 605.3\nD2241—15: Specification for Poly (Vinyl Chloride) (PVC) Pressure-rated Pipe (SDR-Series)\nTable 605.3\nD2282—99(2005): Specification for Acrylonitrile-Butadiene-Styrene (ABS) Plastic Pipe (SDR-PR)\nTable 605.3\nD2464—15: Specification for Threaded Poly (Vinyl Chloride) (PVC) Plastic Pipe Fittings, Schedule 80\nTable 605.5, 605.21.3\nD2466—2017: Specification for Poly (Vinyl Chloride) (PVC) Plastic Pipe Fittings, Schedule 40\nTable 605.5\n\nD2467—15: Specification for Poly (Vinyl Chloride) (PVC) Plastic Pipe Fittings, Schedule 80\nTable 605.5\n\n2021 INTERNATIONAL PLUMBING CODE® 15-7\n"
    },
    {
        "page": 138,
        "text": "REFERENCED STANDARDS\n\nASTM—continued\nD2468—96a: Specification for Acrylonitrile-Butadiene-Styrene (ABS) Plastic Pipe Fittings, Schedule 40\nTable 605.5\n\nD2564—2012(2018): Specification for Solvent Cements for Poly (Vinyl Chloride) (PVC) Plastic Piping Systems\n605.21.3, 705.10.2, 705.14.2\nD2609—15: Specification for Plastic Insert Fittings for Polyethylene (PE) Plastic Pipe\nTable 605.5\nD2657—2007(2015): Practice for Heat Fusion-joining of Polyolefin Pipe and Fitting Waste, and Vent Pipe and Fittings\n605.18.2, 705.12.1\nD2661—14E1: Specification for Acrylonitrile-Butadiene-Styrene (ABS) Schedule 40 Plastic Drain, Waste, and Vent Pipe and Fittings\nTable 702.1, Table 702.2, Table 702.3, Table 702.4, 705.2.2, Table 1102.4, Table 1102.7\nD2665—2014: Specification for Poly (Vinyl Chloride) (PVC) Plastic Drain, Waste, and Vent Pipe and Fittings\nTable 702.1, Table 702.2, Table 702.3, Table 702.4, Table 1102.4, Table 1102.7\nD2672—14: Specification for Joints for IPS PVC Pipe Using Solvent Cement\nTable 605.3\nD2680—01(2014): Standard Specification for Acrylonitrile-Butadiene-Styrene (ABS) and Poly(Vinyl Chloride) (PVC) Composite Sewer\nPiping\nTable 702.3\nD2683—14: Standard Specification for Socket-type Polyethylene Fittings for Outside Diameter-controlled Polyethylene Pipe and Tubing\nTable 605.5, Table 702.4, 716.5\nD2729—2017: Specification for Poly (Vinyl Chloride) (PVC) Sewer Pipe and Fittings\nTable 1102.5, Table 1403.2\nD2737—2012a: Specification for Polyethylene (PE) Plastic Tubing\nTable 605.3\nD2751—05: Specification for Acrylonitrile-Butadiene-Styrene (ABS) Sewer Pipe and Fittings\nTable 702.3, Table 702.4, Table 1102.7\nD2846/D2846M—2017BE1: Specification for Chlorinated Poly (Vinyl Chloride) (CP VC) Plastic Hot- and Cold-Water Distribution\nSystems\nTable 605.3, Table 605.4, Table 605.5, 605.14.2, 605.15.2\nD2855—2015: Standard Practice for Making Solvent-cemented Joints with Poly (Vinyl Chloride) (PVC) Pipe and Fittings\n605.21.3, 705.10.2\nD2949—10: Specification for 3.25-in. Outside Diameter Poly (Vinyl Chloride) (PVC) Plastic Drain, Waste, and Vent Pipe and Fittings\nTable 702.1, Table 702.2, Table 702.3, Table 702.4, Table 1102.7\nD3034—2016: Specification for Type PSM Poly (Vinyl Chloride) (PVC) Sewer Pipe and Fittings\nTable 702.3, Table 702.4, Table 1102.4, Table 1102.5, Table 1102.7\nD3035—15: Standard Specification for Polyethylene (PE) Plastic Pipe (DR-PR) Based on Controlled Outside Diameter\nTable 605.3\nD3138—2016: Standard Specification for Solvent Cements for Transition Joints Between Acrylonitrile-Butadiene-Styrene (ABS) and\nPoly (Vinyl Chloride) (PVC) Non-pressure Piping Components\n705.16.4\nD3139—98(2011): Specification for Joints for Plastic Pressure Pipes Using Flexible Elastomeric Seals\n605.10.1, 605.22.1\nD3212—07(2013): Specification for Joints for Drain and Sewer Plastic Pipes Using Flexible Elastomeric Seals\n705.2.1, 705.10.1, 705.12.2, 705.15\nD3261—2016: Specification for Butt Heat Fusion Polyethylene (PE) Plastic Fittings for Polyethylene (PE) Plastic Pipe and Tubing\nTable 605.5\nD3311—2017: Specification for Drain, Waste and Vent (DWV) Plastic Fittings Patterns\nTable 1102.7\nD4068—2017: Specification for Chlorinated Polyethlene (CPE) Sheeting for Concealed Water-containment Membrane\n421.5.2.2\nD4551—2017: Specification for Poly (Vinyl Chloride) (PVC) Plastic Flexible Concealed Water-containment Membrane\n421.5.2.1\n\nE2635—14: Standard Practice for Water Conservation Through In-Situ Water Reclamation\n1302.1\n\n15-8 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 139,
        "text": "REFERENCED STANDARDS\n\nASTM—continued\n\nE2727—2018: Standard Practice for the Assessment of Rainwater Quality\n1303.15.9\n\nF405—05: Specification for Corrugated Polyethylene (PE) Pipe and Fittings\nTable 1102.5, Table 1403.2\n\nF409—2017: Specification for Thermoplastic Accessible and Replaceable Plastic Tube and Tubular Fittings\n412.1.2, Table 1102.7\n\nF437—15: Specification for Threaded Chlorinated Poly (Vinyl Chloride) (CPVC) Plastic Pipe Fittings, Schedule 80\nTable 605.5\n\nF438—2017: Specification for Socket-type Chlorinated Poly (Vinyl Chloride) (CPVC) Plastic Pipe Fittings, Schedule 40\nTable 605.5\n\nF439—13: Standard Specification for Chlorinated Poly (Vinyl Chloride) (CPVC) Plastic Pipe Fittings, Schedule 80\nTable 605.5\n\nF441/F441M—15: Specification for Chlorinated Poly (Vinyl Chloride) (CP VC) Plastic Pipe,Schedules 40 and 80\nTable 605.3, Table 605.4\n\nF442/F442M—13el1: Specification for Chlorinated Poly (Vinyl Chloride) (CP VC) Plastic Pipe (SDR-PR)\nTable 605.3, Table 605.4\n\nF477—14: Specification for Elastomeric Seals (Gaskets) for Joining Plastic Pipe\n605.23, 705.16\n\nF493—14: Specification for Solvent Cements for Chlorinated Poly (Vinyl Chloride) (CPVC) Plastic Pipe and Fittings\n605.14.2, 605.15.2\n\nF628—2012E2: Specification for Acrylonitrile-Butadiene-Styrene (ABS) Schedule 40 Plastic Drain, Waste, and Vent Pipe with a Cellular\n\nCore\n\nTable 702.1, Table 702.2, Table 702.3, Table 702.4, 705.2.2, Table 1102.4, Table 1102.7\nF656—2015: Specification for Primers for Use in Solvent Cement Joints of Poly (Vinyl Chloride) (PVC) Plastic Pipe and Fittings\n605.21.3, 705.10.2, 705.14.2\nF667/F667M—2016: Standard Specification for 3 through 24 in. Corrugated Polyethylene Pipe and Fittings\nTable 1102.4, Table 1102.5\nF714—2013: Specification for Polyethylene (PE) Plastic Pipe (SDR-PR) Based on Outside Diameter\nTable 702.3\nF876—2017: Specification for Cross-linked Polyethylene (PEX) Tubing\nTable 605.3, Table 605.4\nF877—2018A: Specification for Cross-linked Polyethylene (PEX) Hot- and Cold-water Distribution Systems\nTable 605.5\nF891—2016: Specification for Coextruded Poly (Vinyl Chloride) (PVC) Plastic Pipe with a Cellular Core\nTable 702.1, Table 702.2, Table 702.3, Table 1102.4, Table 1102.5, Table 1102.7\nF1055—2016A: Standard Specification for Electrofusion Type Polyethylene Fittings for Outside Diameter Controlled Polyethylene and\nCross-linked Polyethylene Pipe and Tubing\nTable 605.5\nF1281—2017: Specification for Cross-linked Polyethylene/Aluminum/ Cross-linked Polyethylene (PEX-AL-PEX) Pressure Pipe\nTable 605.3, Table 605.4, Table 605.5, 605.20.1, Table E105.1\nF1282—2017: Specification for Polyethylene/Aluminum/Polyethylene (PE-AL-PE) Composite Pressure Pipe\nTable 605.3, Table 605.4, Table 605.5, 605.20.1\nF1412—2016: Specification for Polyolefin Pipe and Fittings for Corrosive Waste Drainage\nTable 702.1, Table 702.2, Table 702.4, 705.13.1, 901.3\nF1476—07(2013): Standard Specification for Performance of Gasketed Mechanical Couplings for Use in Piping Applications\nTable 605.5, 605.13.3, 605.17.3, 605.22.2, 605.22.3\nF1488—2014E1: Specification for Coextruded Composite Pipe\nTable 702.1, Table 702.2, Table 702.3, Table 1102.4, Table 1403.2\n\nF1504—2014: Standard Specification for Folded Poly (Vinyl Chloride) (PVC) for Existing Sewer and Conduit Rehabilitation\n717.6\n\n2021 INTERNATIONAL PLUMBING CODE® 15-9\n"
    },
    {
        "page": 140,
        "text": "REFERENCED STANDARDS\n\nASTM—continued\n\nF1548—2001(2018): Standard Specification for the Performance of Fittings for Use with Gasketed Mechanical Couplings Used in Piping\n\nApplications\n\nTabl\n\nle 605.5\n\nF1673—2010(2016): Standard Specification for Polyvinylidene Fluoride (PVDF) Corrosive Waste Drainage Systems\n\nTabl\n\nle 702.1, Table 702.2, Table 702.3, Table 702.4, 705.14.1\n\nF1807—2018: Specification for Metal Insert Fittings Utilizing a Copper Crimp Ring for SDR9 Cross-linked Polyethylene (PEX) Tubing\n\nand SDR9 Polyethy!\nTabl\n\nene of Raised Temperature (PE-RT) Tubing\nle 605.5\n\nF1866—2018: Specification for Poly (Vinyl Chloride) (PVC) Plastic Schedule 40 Drainage and DWV Fabricated Fittings\n\nTabl\n\nF1871—2011: Standar\nRehabilitation\n717.\n\nle 702.4, Table 1102.7\n‘d Specification for Folded/Formed Poly (Vinyl Chloride) Pipe Type A for Existing Sewer and Conduit\n\n6\n\nF1960—2018: Specification for Cold Expansion Fittings with PEX Reinforcing Rings for Use with Cross-linked Polyethylene (PEX)\n\nTubing\nTab!\n\nle 605.5\n\nF1970—2018: Special Engineered Fittings, Appurtenances or Valves for Usein Poly (Vinyl Chloride) (PVC) OR Chlorinated Poly (Vinyl\n\nChloride) (CPVC) S\nTab!\n\nystems\nle 605.7\n\nF1974—09(2015): Specification for Metal Insert Fittings for Polyethylene/Aluminum/Polyethylene and Cross-linked Polyethylene/\nAluminum/Cross-linked Polyethylene Composite Pressure Pipe\n\nTab!\n\nle 605.5, 605.20.1\n\nF1986—2001(2011): Specification for Multilayer Pipe, Type 2, Compression Fittings and Compression Joints for Hot and Cold Drinking\n\nWater Systems\nTab!\n\nle 605.3, Table 605.4, Table 605.5\n\nF2080—2016: Specifications for Cold-expansion Fittings with Metal Compression-sleeves for Cross-linked Polyethylene (PEX) Pipe\n\nTab!\n\nF2098—2015: Standard\n\nle 605.5\nSpecification for Stainless Steel Clamps for Securing SDR9 Cross-linked Polyethylene (PEX) Tubing to Metal\n\nInsert and Plastic Fittings\n\nTab!\n\nle 605.5\n\nF2159—2018: Specification for Plastic Insert Fittings Utilizing a Copper Crimp Ring for SDR9 Cross-linked Polyethylene (PEX) Tubing\nand SDR9 Polyethylene of Raised Temperature (PE-RT) Tubing\n\nTab\n\nF2262—09: Specificatio\n\nTab!\nF2306/F2306M—2018:\nand Subsurface Drai\nTab!\n\nF2389—2017A: Specifi\nTab!\n\ne 605.5\nn for Cross-linked Polyethylene/Aluminum/Cross-linked Polyethylene Tubing OD Controlled SDR9\nle 605.3, Table 605.4\n12” to 60” Annular Corrugated Profile-wall Polyethylene (PE) Pipe and Fittings for Gravity Flow Storm Sewer\ninage Applications\nle 1102.4, Table 1102.7\n\ncation for Pressure-rated Polypropylene (PP) Piping Systems\nle 605.3, Table 605.4, Table 605.5, Table 605.7, 605.19.1\n\nF2434—14: Standard Specification for Plastic Insert Fittings Utilizing a Copper Crimp Ring for SDR9 Cross-linked Polyethylene (PEX)\nTubing and SDR9 Cross-linked Polyethylene/Aluminum/ Cross-linked Polyethylene (PEX AL-PEX) Tubing\n\nTab!\n\nle 605.5\n\nF2561—17: Standard Practice for Rehabilitation of a Sewer Service Lateral and its Connection to the Main Using a One Piece Main and\n\nLateral Cured-in-PI:\n718.\n\nace Liner\n1\n\nF2599—16: Standard Practice for The Sectional Repair of Damaged Pipe by Means of an Inverted Cured-in-Place Liner\n\n718.\n\nF2648/F2648M—2017:\nand Fittings for Lan\nTabl\n\nF2735—2009(2016): St:\n\n1\n\nStandard Specification for 2 to 60 inch [50 to 1500 mm] Annular Corrugated Profile Wall Polyethylene (PE) Pipe\nid Drainage Applications\nle 1102.4\n\nandard Specification for Plastic Insert Fittings for SDR9 Cross-linked Polyethylene (PEX) and Polyethylene of\n\nRaised Temperature (PE-RT) Tubing\n\nTabl\n\n15-10\n\nle 605.5\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 141,
        "text": "REFERENCED STANDARDS\n\nASTM—continued\n\nF2736—13e1: Standard Specification for 6 to 30 in. [152 to 762 mm] Polypropylene (PP) Corrugated Single Wall Pipe and Double Wall\nPipe\nTable 702.3\nF2764/F2764M—2018: Standard Specification for 30 to 60 in. [750 to 1500 mm] Polypropylene (PP) Triple Wall Pipe and Fittings for\nNon-pressure Sanitary Sewer Applications\nTable 702.3\n\nF2769—2018: Polyethylene or Raised Temperature (PE-RT) Plastic Hot- and Cold-water Tubing and Distribution Systems\nTable 605.3, Table 605.4, Table 605.5\nF2831—2012(2017): Standard Practice for Internal Non Structural Epoxy Barrier Coating Material Used in Rehabilitation of Metallic\nPressurized Piping Systems\n601.5\nF2855—12: Standard Specification for Chlorinated Poly (Vinyl Chloride)/Aluminum/Chlorinated Poly (Vinyl Chloride) (CPVC/AL/\nCPVC) Composite Pressure Tubing\nTable 605.3, Table 605.4\nF2881/F2881M—2018: Standard Specification for 12 to 60 in. [300 to 1500 mm] Polypropylene (PP) Dual Wall Pipe and Fittings for Non-\npressure Storm Sewer Applications\nTable 1102.4\nF3226/F3226M— 16: Standard Specification for Metallic Press-Connect Fittings for Piping and Tubing Systems\nTable 605.5\n\nF3240—17: Standard Practice for Installation of Seamless Molded Hydrophilic Gaskets (SMHG) for Long Term Watertightness of\nCured-in-Place Rehabilitation of Main and Lateral Pipelines\n718.1\n\nAWS\n\nAmerican Welding Society\n8669 NW 36 Street, #130\nMiami, F L 33166\nA5.8M/A5.8—2011-AMDI1: Specifications for Filler Metals for Brazing and Braze Welding\n605.12.1, 605.13.1, 705.5.1, 705.6.1\n\nAWWA\n\nAmerican Water Works Association\n6666 West Quincy Avenue\nDenver, CO 80235\nC104/A21.4—16: Cement-mortar Lining for Ductile-iron Pipe and Fittings\n605.3, 605.5\nC110/A21.10—12: Ductile-iron and Gray-iron Fittings\nTable 605.5, Table 702.4, Table 1102.7\nC111/A21.11—17: Rubber-gasket Joints for Ductile-iron Pressure Pipe and Fittings\n605.11\n\nC115/A21.15—11: Flanged Ductile-iron Pipe with Ductile-iron or Gray-iron Threaded Flanges\n\nTable 605.3, Table 605.4\n\nC151/A21.51—17: Ductile-iron Pipe, Centrifugally Cast for Water\nTable 605.3, Table 605.4\n\nC153—00/A21.53—11: Ductile-iron Compact Fittings for Water Service\nTable 605.5\n\nC500—09: Standard for Metal-seated Gate Valves for Water Supply Service\nTable 605.7\n\nC504—15: Standard for Rubber-Seated Butterfly Valves\nTable 605.7\n\nC507—15: Standard for Ball Valves, 6 In. Through 60 in. (150 mm through 1,500 mm).\nTable 605.7\n\nC510—17: Double Check Valve Backflow Prevention Assembly\n\nTab!\n\n2021 INTERNATIONAL\n\ne 608.1, 608.14.7\n\nPLUMBING CODE® 15-11\n"
    },
    {
        "page": 142,
        "text": "REFERENCED STANDARDS\n\nAWWA—continued\n\nC511—17: Reduced-pressure Principle Backflow Prevention Assembly\nTable 608.1, 608.14.2, 608.17.2\n\nC651—14: Disinfecting Water Mains\n610.1\n\nC652—11: Disinfection of Water-storage Facilities\n610.1\n\nC901—16: Polyethylene (PE) Pressure Pipe and Tubing */, inch (19 mm) Through 3 inch (76 mm) for Water Service\nTable 605.3\n\nC904—16: Cross-linked Polyethylene (PEX) Pressure Tubing '/, inch (13 mm) Through 3 inch (76 mm) for Water Service\nTable 605.3\n\nCISPI Cast Iron Soil Pipe Institute\n2401 Fieldcrest Dr.\nMundelein, IL 60060\n301—18: Specification for Hubless Cast-iron Soil Pipe and Fittings for Sanitary and Storm Drain, Waste and Vent Piping Applications\nTable 702.1, Table 702.2, Table 702.3, Table 702.4, Table 1102.4, Table 1102.5, Table 1102.7\n310—18: Specification for Coupling for Use in Connection with Hubless Cast-iron Soil Pipe and Fittings for Sanitary and Storm Drain,\n\nWaste and Vent Piping Applications\n705.3.3\n\nCSA CSA Group\n\n8501 East Pleasant Valley Road\nCleveland, OH 44131-5516\n\nA257.1—14: Non-reinforced Circular Concrete Culvert, Storm Drain, Sewer Pipe and Fittings\nTable 702.3, Table 1102.4\n\nA257.2—14: Reinforced Circular Concrete Culvert, Storm Drain, Sewer Pipe and Fittings\nTable 702.3, Table 1102.4\n\nA257.3—14: Joints for Circular Concrete Sewer and Culvert Pipe, Manhole Sections and Fittings Using Rubber Gaskets\n\n705.4, 705.16\n\nASME A112.3.4—2020/CSA B45.9—20: Macerating Systems and Waste Pumping Systems for Plumbing Fixtures\n405.5, 712.4.1\n\nASME A112.4.2—2020/CSA B45.16—20: Water Closet Personal Hygiene Devices\n412.9\n\nASME A112.18.1—2018/CSA B125.1—18: Plumbing Supply Fittings\n412.1, 412.2, 412.3, 412.4, 412.6, 412.8, Table 605.7, 607.4, 608.2\n\nASME A112.18.2—2015/CSA B125.2—2015: Plumbing Waste Fittings\n412.1.2, 421.3.1\n\nASME A112.18.6—2021/CSA B125.6—21: Flexible Water Connectors\n605.6\n\nASME A112.19.1—2020/CSA B45.2—20: Enameled Cast-iron and Enameled Steel Plumbing Fixtures\n407.1, 410.1, 418.1, 419.1, 421.1, 422.1\n\nASME A112.19.2—2020/B45.1—2020: Ceramic Plumbing Fixtures\n401.2, 405.10, 407.1, 408.1, 410.1, 418.1, 419.1, 421.1, 422.1, 424.1, 425.1\n\nASME A112.19.3—2021/CSA B45.4—2021: Stainless-steel Plumbing Fixtures\n405.9, 407.1, 418.1, 419.1, 421.1, 425.1\n\nASME A112.19.5—2021/CSA B45.15—2021: Flush Valves and Spuds for Water Closets, Urinals and Tanks\n415.4\n\nASME A112.19.7—2012/CSA B45.10—2012(R2021): Hydromassage Bathtub Systems\n426.1, 426.4\n\nASSE 1002—2020/ASME A112.1002—2020/CSA B125.12—2020: Anti-Siphon Fill Valves for Water Closet Tanks\n415.3.1, Table 608.1\n\n15-12 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 143,
        "text": "REFERENCED STANDARDS\n\nCSA—continued\nASSE 1016—2020/ASME A112.1016—2020/CSA B125.16—2020: Performance Requirements for Automatic Compensating Valves for\nIndividual Showers and Tub/Shower Combinations\n412.3, 412.4, 607.4\nASSE 1037—2015/ASME A112.1037—2015/CSA B125.37—15: Pressurized Flushing Devices for Plumbing Fixtures\n415.2\nASSE 1070—2020/ASME A112.1070—2020/CSA B125.1070—20: Water Temperature Limiting Devices\n408.3, 412.5, 412.10, 419.5, 423.3, 607.1.2\nB64.1.1—11(R2016): Vacuum Breakers, Atmospheric Type (AVB)\n415.2, Table 608.1, 608.14.6, 608.17.4.1\nB64.1.2—11(R2016): Pressure Vacuum Breakers, (PVB)\nTable 608.1, 608.14.5\nB64.1.3—11(R2016): Spill Resistant Pressure Vacuum Breakers (SRPVB)\nTable 608.1, 608.14.5\nB64.2—11(R2016): Vacuum Breakers, Hose Connection Type (HCVB)\nTable 608.1, 608.14.6\nB64.2.1—11(2016): Vacuum Breakers, Hose Connection (HCVB) with Manual Draining Feature\nTable 608.1, 608.14.6\nB64.2.1.1—11(2016): Hose Connection Dual Check Vacuum Breakers (HCDVB)\nTable 608.1, 608.14.6\nB64.2.2—11(2016): Vacuum Breakers, Hose Connection Type (HCVB) with Automatic Draining Feature\nTable 608.1, 608.14.6\nB64.3—11(R2016): Backflow Preventers, Dual Check Valve Type with Atmospheric Port (DCAP)\nTable 608.1, 608.14.3, 608.17.2\nB64.4—11(R2016): Backflow Preventers, Reduced Pressure Principle Type (RP)\nTable 608.1, 608.14.2, 608.17.2\nB64.4.1—11(R2016): Reduced Pressure Principle for Fire Sprinklers (RPF)\nTable 608.1, 608.14.2\nB64.5—11(R2016): Double Check Backflow Preventers (DCVA)\nTable 608.1, 608.14.7\nB64.5.1—11(R2016): Double Check Valve Backflow Preventer for Fire Systems (DCVAF)\nTable 608.1, 608.14.7\nB64.6—11(R2016): Dual Check Valve (DuC) Backflow Preventers\n605.3.1, Table 608.1, 608.14.9\nB64.7—11(R2016): Laboratory Faucet Vacuum Breakers (LF VB)\nTable 608.1, 608.14.6\nB64.10—17: Manual for the Selection and Installation of Backflow Prevention Devices\n312.10.2\nB64.10.1—17: Maintenance and Field Testing of Backflow Preventers\n312.10.2\nB79—08(R2018): Commercial and Residential Drains and Cleanouts\n413.1\nB125.3—2018: Plumbing Fittings\n408.3, 412.4, 412.5, 415.2, 415.3.1, 423.3, Table 605.7, Table 608.1\nB137.1—17: Polyethylene (PE) Pipe, Tubing and Fittings for Cold-water Pressure Services\nTable 605.3, Table 605.5\nB137.2—17: Polyvinylchloride, PVC, Injection-moulded Gasketed Fittings for Pressure Applications\nTable 605.5\nB137.3—17: Rigid Poly (Vinyl Chloride) (PVC) Pipe for Pressure Applications\nTable 605.3, Table 605.5, 605.21.3, 705.10.2, 705.14.2\nB137.5—17: Cross-linked Polyethylene (PEX) Tubing Systems for Pressure Applications\nTable 605.3, Table 605.4, Table 605.5\n\n2021 INTERNATIONAL PLUMBING CODE® 15-13,\n"
    },
    {
        "page": 144,
        "text": "REFERENCED STANDARDS\n\nCSA—continued\nB137.6—17: CPVC Pipe, Tubing and Fittings for Hot- and Cold-water Distribution Systems\nTable 605.3, Table 605.4, Table 605.5\nB137.9—17: Polyethylene Aluminum/Polyethylene (PE-AL-PE) Composite Pressure-pipe Systems\nTable 605.3, Table 605.5, 605.20.1\nB137.10—17: Cross-linked Polyethylene/Aluminum/Cross-linked Polyethylene (PEX-AL-PEX) Composite Pressure-pipe Systems\nTable 605.3, Table 605.4, Table 605.5, 605.20.1\nB137.11—17: Polypropylene (PP-R) Pipe and Fittings for Pressure Applications\nTable 605.3, Table 605.4, Table 605.5\nB137.18—17: Polyethylene of Raised Temperature Resistance (PE-RT) Tubing Systems for Pressure Applications\nTable 605.3, Table 605.4, Table 605.5\nB181.1—18: Acrylonitrile-Butadiene-Styrene ABS Drain, Waste and Vent Pipe and Pipe Fittings\nTable 702.1, Table 702.2, Table 702.3, Table 702.4, 705.2.2, 714.2, Table 1102.4, Table 1102.7\nB181.2—18: Polyvinylchloride PVC and Chlorinated Polyvinylchloride (CPVC) Drain, Waste, and Vent Pipe and Pipe Fittings\nTable 702.1, Table 702.2, 705.10.2, 705.14.2, 714.2\nB181.3—18: Polyolefin and Polyvinylidene Fluoride (PVDF) Laboratory Drainage Systems\nTable 702.1, Table 702.2, Table 702.3, Table 702.4, 705.13.1\nB182.1—18: Plastic Drain and Sewer Pipe and Pipe Fittings\n705.10.2, 705.14.2, Table 1102.4, Table 1102.5\nB182.2—18: PSM Type Polyvinylchloride PVC Sewer Pipe and Fittings\nTable 702.3, Table 1102.4, Table 1102.5\nB182.4—18: Profile Polyvinylchloride PVC Sewer Pipe and Fittings\nTable 702.3, Table 1102.4, Table 1102.5\nB182.6—18: Profile Polyethylene (PE) Sewer Pipe and Fittings for Leak-proof Sewer Applications\nTable 1102.5\nB182.8—18: Profile Polyethylene (PE) Storm Sewer and Drainage Pipe and Fittings\nTable 1102.5\nB182.13—18: Profile Polypropylene (PP) Sewer Pipe and Fittings for Leak-proof Sewer Applications\nTable 702.3, Table 1102.4\nB356—10(R2015): Water Pressure Reducing Valves for Domestic Water Systems\n604.8\nB481.1—12(R2017): Testing and Rating of Grease Interceptors Using Lard\n1003.3.4\nB481.3—12(R2017): Sizing, Selection, Location and Installation of Grease Interceptors\n1003.3.5\nB483.1—07(R2017): Drinking Water Treatment Systems\n611.1, 611.2\nB602—16: Mechanical Couplings for Drain, Waste and Vent Pipe and Sewer Pipe\n705.2.1, 705.3.3, 705.5, 705.10.1, 705.11, 705.12.2, 705.16\nCSA B45.5—17/IAPMO Z124—2017 with errata dated August 2017: Plastic Plumbing Fixtures\n407.1, 418.1, 419.1, 419.2, 421.1, 422.1, 424.1, 425.1, 425.1.2\n\nCSA B805-18/ICC 805-2018: Rainwater Harvesting Systems\n1301.1\n\nIAPMO JAPMO Group\n\n4755 E. Philadelphia Street\nOntario, CA 91761 USA\n\nASPE/IAPMO Z1034—2015: Test Method for Evaluating Roof Drain Performance\n1102.6\n\nCSA B45.5—17/IAPMO Z124—2017 with errata dated August 2017: Plastic Plumbing Fixtures\n407.1, 418.1, 419.1, 419.2, 421.1, 422.1, 424.1, 425.1, 425.1.2\n\n15-14 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 145,
        "text": "REFERENCED STANDARDS\n\n1APMO—continued\nIAPMO/ANSI Z1157—2014e1: Ball Valves\n\nTable 605.7\nZ1001—2016: Prefabricated Gravity Grease Interceptors\n1003.3.7\nICC International Code Council, Inc.\n\n500 New Jersey Ave, NW 6th Floor\nWashington, DC 20001\nCSA B805—18/ICC 805—2018: Rainwater Harvesting Systems\n1301.1\nIBC—21: International Building Code”\n201.3, 202, 307.1, 307.2, 307.3, 308.2, 309.1, 309.2, 310.1, 310.3, 315.1, 403.1, Table 403.1, 403.1.2,\n403.3.1, 403.4, 404.1, 407.3, 421.6, 502.4, 606.5.2, 1106.5, 1301.9.3, 1303.6, 1402.1\n\nICC 900/SRCC 300—2020: Solar Thermal System Standard\n\n502.1\n\nICC A117.1—17: Accessible and Usable Buildings and Facilities\n404.2, 410.3\n\nIEBC—21: International Existing Building Code®\n102.2.1\n\nIECC—21: International Energy Conservation Code®\n313.1, 607.2.1, 607.5\n\nIFC—21: International Fire Code®\n201.3, 1201.1\n\nIFGC—21: International Fuel Gas Code®\n101.2, 201.3, 502.1, 502.1.1\n\nIMC—21: International Mechanical Code®\n201.3, 307.6, 310.1, 502.1, 502.1.1, 612.1, 1202.1\n\nIPSDC—21: International Private Sewage Disposal Code®\n\n701.2\nIRC—21: International Residential Code®\n101.2\nIS A International Safety Equipment Association\n\n1901 N. Moore Street, Suite 808\nArlington, VA 22209\nANSI/ISEA Z358.1—2014: Emergency Eyewash and Shower Equipment\n411.1\n\nMSS Manufacturers Standardization Society of the Valve and Fittings Industry, Inc.\n127 Park St. NE\nVienna, VA 22180-4602\nSP-67—2011: Butterfly Valves\nTable 605.7\nSP-70—2013: Gray Iron Gate Valves, Flanged and Threaded Ends\nTable 605.7\nSP-71—2018: Gray Iron Swing Check Valves, Flanged and Threaded Ends\nTable 605.7\nSP-72—2010a: Ball Valves with Flanged or Butt-welding Ends for General Service\nTable 605.7\nSP-78—2011: Cast Iron Plug Valves, Flanged and Threaded Ends\nTable 605.7\n\n2021 INTERNATIONAL PLUMBING CODE® 15-15\n"
    },
    {
        "page": 146,
        "text": "REFERENCED STANDARDS\n\nMSS—continued\nSP-80—2013: Bronze Gate, Globe, Angle and Check Valves\n\nTable 605.7\nSP-110—2010: Ball Valves, Threaded, Socket Welding, Solder Joint, Grooved and Flared Ends (incl. a 2010 Errata Sheet)\nTable 605.7\nSP-122—2017: Plastic Industrial Ball Valves\nTable 605.7\nSP-139—2014: Copper Alloy Gate, Globe, Angle and Check Valves for Low Pressure/Low Temperature Plumbing Applications\nTable 605.7\nNFPA National Fire Protection Association\n\n1 Batterymarch Park\nQuincy, MA 02169-7471\n\n51—18: Design and Installation of Oxygen-fuel Gas Systems for Welding, Cutting and Allied Processes\n1203.1\n55—19: Compressed Gases and Cryogenic Fluids Code\n1203.1\n70—20: National Electrical Code\n502.1, 504.3, 1113.1.3\n99—21: Health Care Facilities Code\n1202.1\n\nNGWA National Ground Water Association\n\n601 Dempsey Road\nWesterville, OH 43081\n\nNGWA/ANSI 01—14: Water Well Construction Standard\n602.3.1\n\nNSF NSF International\n\n789 N. Dixboro Road P.O. Box 130140\nAnn Arbor, MI 48105\n\n3—2017: Commercial Warewashing Equipment\n\n409.1\n14—2018: Plastic Piping System Components and Related Materials\n303.3, 611.3\n18—2016: Manual Food and Beverage Dispensing Equipment\n426.1\n42—2018: Drinking Water Treatment Units-Aesthetic Effects\n611.1, 611.3\n44—2018: Residential Cation Exchange Water Softeners\n611.1, 611.3\n50—2017: Equipment for Swimming Pools, Spas, Hot Tubs and Other Recreational Facilities\n1302.8.1\n53—2017: Drinking Water Treatment Units—Health Effects\n611.1, 611.3\n\n58—2017: Reverse Osmosis Drinking Water Treatment Systems\n611.1, 611.2, 611.3\n\n61—2018: Drinking Water System Components—Health Effects\n410.1, 412.1, 605.3, 605.4, 605.5, 605.7, 605.12.3, 605.13.6, 608.12, 611.3\n\n62—2017: Drinking Water Distillation Systems\n611.1\n\n15-16 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 147,
        "text": "REFERENCED STANDARDS\n\nNSF—continued\n184—2014: Residential Dishwashers\n\n409.1\n350—2017a: Onsite Residential and Commercial Water Reuse Treatment Systems\n1302.6.1\n359—2018: Valves for Cross-linked Polyethylene (PEX) Water Distribution Tubing Systems\nTable 605.7\n372—2016: Drinking Water Systems Components—Lead Content\n605.2.1\nPDI Plumbing and Drainage Institute\n\n800 Turnpike Street, Suite 300\nNorth Andover, MA 01845\nPDI G101 (2012): Testing and Rating Procedure for Grease Interceptors with Appendix of Sizing and Installation Data\n\n1003.3.5\nPDI G102 (2009): Testing and Certification for Grease Interceptors with Fog Sensing and Alarm Devices\n1003.3.5\nPSAI Portable Sanitation Association International\n\n2626 E. 82nd Street, Suite 175\nBloomington, MN 55425\nPSAI/ANSI Z4.3—16: Minimum Requirements for Nonsewered Waste-disposal Systems\n311.1\n\nUL UL LLC\n\n333 Pfingsten Road\nNorthbrook, IL 60062-2096\n\n399—2017: Drinking-Water Coolers—with revisions through August 2018\n410.1\n\n430—2015: Waste Disposers—with revisions through February 2018\n416.1\n\n508—2018: Industrial Control Equipment\n314.2.3\n\n1795—2016: Hydromassage Bathtubs—with revisions through December 2017\n426.1\n\n2021 INTERNATIONAL PLUMBING CODE® 15-17\n"
    },
    {
        "page": 148,
        "text": "15-18 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 149,
        "text": "APPENDIX A\nPLUMBING PERMIT FEE SCHEDULE\n\nThe provisions contained in this appendix are not mandatory unless specifically referenced in the adopting ordinance.\n\nUser note:\n\nAbout this appendix: Appendix A provides an example of a permit fee schedule that can be used by a jurisdiction.\n\nTABLE A101\nEXAMPLE OF PERMIT FEE SCHEDULE\n\nPermit Issuance\n\n1. For issuing each permit . 0.0.0... eens\n\n2. For issuing each supplemental permit ........ 0...\n\nUnit Fee Schedule\n\n1. For each plumbing fixture or trap or set of fixtures on one trap\n\n(including water, drainage piping and backflow protection thereof)...................00000.0008\n\n. For each water heater and/or vent\n\nYN HDwn WN\n\n. For each industrial waste pretreatment interceptor including its trap and vent,\n\nexcepting kitchen-type grease interceptors functioning as fixture traps ................000.0.0008\n8. For installation, alteration or repair of water-piping and/or water-treating equipment, each ..........\n9. For repair or alteration of drainage or vent piping, each fixture ............... 00.0... 0 cece eee\n\n10. For each lawn sprinkler system on any one meter including backflow protection devices therefor. ....\n\n11. For atmospheric-type vacuum breakers not included in Item 2:\n\nOVEr 5, CACN 2. ene ene n nee eee enn tenet dete eben\n\n12. For each backflow protective device other than atmospheric-type vacuum breakers:\n\n2 inches (51 mm) and smaller ...... 2.0.22 cette een e nent eens\n\nOver 2 inches (51 mm)........0. 00. t nee e eee e eee e eee\n\nOther Inspections and Fees\n\n1. Inspections outside of normal business hours (minimum charge 2 hours) ................0000005\n\n. Reinspection fee assessed under provisions of Section 108.4.3 .......... 0.0... cece eee eee ee\n\n2.\n3. Inspections for which no fee is specifically indicated (minimum charge one-halfhour)............\n4\n\n. Additional plan review required by changes, additions or revisions to approved plans\n(minimum charge one-halfhour).. 0.0.0.0... eee eee eee\n\n2021 INTERNATIONAL PLUMBING CODE®\n\n. For each building sewer and each trailer park sewer. ....... 00.000\n. Rainwater systems—per drain (inside building) ...........00.0. 0... e eee\n. For each cesspool (where permitted). 0.2... 0... cece eee eee\n\n. For each private sewage disposal system. ..... 60.62.\n\nper hour\nan each\n\nper hour\n\nper hour\n\nAPPENDIX A-1\n"
    },
    {
        "page": 150,
        "text": "APPENDIX A-2 2021 INTERNATIONAL PLUMBING CODE®\n"
    }
]