[
    {
        "page": 1,
        "text": "INTERNATIONAL\nPLUMBING\nCODE’\n\nINCLUDES\nPlumbing provisions from\nICC All7.1-2017 Standard for Accessible\n\nand Usable Buildings and Facilities j\nJ\nj PHCC BSS\nj 000 AD!\nj ama\n; SRLS Aru\n/\n"
    },
    {
        "page": 2,
        "text": "INTERNATIONAL\nPLUMBING\nCODE”\n\nINCLUDES\n\nPlumbing provisions from\n\nICC Al17.1-2017 Standard for Accessible\nand Usable Buildings and Facilities\n\nNAS\nry \\\\\nTL \\_\\\n\nINTERNATIONAL\nCODE COUNCIL\n"
    },
    {
        "page": 3,
        "text": "2021 International Plumbing Code®\n\nDate of First Publication: March 6, 2020\n\nFirst Printing: March 2020\n\nISBN: 978-1-60983-962-8 (soft-cover edition)\nISBN: 978-1-60983-963-5 (loose-leaf edition)\n\nCOPYRIGHT © 2020\nby\nINTERNATIONAL CODE COUNCIL, INC.\n\nALL RIGHTS RESERVED. This 2021 International Plumbing Code® is a copyrighted work owned by the International Code\nCouncil, Inc. (“ICC”). Without advance written permission from the ICC, no part of this book may be reproduced, distributed or\ntransmitted in any form or by any means, including, without limitation, electronic, optical or mechanical means (by way of\nexample, and not limitation, photocopying or recording by or in an information storage retrieval system). For information on use\nrights and permissions, please contact: ICC Publications, 4051 Flossmoor Road, Country Club Hills, IL 60478. Phone 1-888-\nICCSAFE (422-7233).\n\nTrademarks: “International Code Council,” the “International Code Council” logo, “ICC,” the “ICC” logo, “International\nPlumbing Code,” “IPC” and other names and trademarks appearing in this book are registered trademarks of the International\nCode Council, Inc., and/or its licensors (as applicable), and may not be used without permission.\n\nThe display of the Plumbing-Heating-Cooling Contractors—National Association (PHCC) logo in this publication indicates\nPHCC’s support through committee participation of ICC’s open governmental consensus process used to develop the Interna-\ntional Codes. This support does not imply any ownership to the copyright to the International Plumbing Code, which is held\nsolely by the International Code Council, Inc.\n\nPlumbing-Heating-Cooling Contractors—National Association (PHCC): 180 S. Washington Street — Suite 100, Falls Church,\nVA 22046; Phone: (703) 237-8100, (800) 533-7694, www.phccweb.org.\n\n7024869 PRINTED IN THE USA\n"
    },
    {
        "page": 4,
        "text": "Introduction\n\nDevelopment\n\nPREFACE\n\nThe International Plumbing Code® (IPC®) establishes minimum requirements for plumbing systems\nusing prescriptive and performance-related provisions. It is founded on broad-based principles that\nmake possible the use of new materials and new plumbing designs. This 2021 edition is fully compati-\nble with all of the International Codes® (I-Codes®) published by the International Code Council® (ICC®),\nincluding the International Building Code®, International Energy Conservation Code®, International\nExisting Building Code®, International Fire Code®, International Fuel Gas Code®, International Green\nConstruction Code®, International Mechanical Code®, International Private Sewage Disposal Code®,\nInternational Property Maintenance Code®, International Residential Code®, International Swimming\nPool and Spa Code®, International Wildland-Urban Interface Code®, International Zoning Code® and\nInternational Code Council Performance Code®.\n\nThe I-Codes, including this International Plumbing Code, are used in a variety of ways in both the\npublic and private sectors. Most industry professionals are familiar with the I-Codes as the basis of\nlaws and regulations in communities across the US and in other countries. However, the impact of the\ncodes extends well beyond the regulatory arena, as they are used in a variety of nonregulatory set-\ntings, including:\n\n¢ Voluntary compliance programs such as those promoting sustainability, energy efficiency and\ndisaster resistance.\n\n¢ The insurance industry, to estimate and manage risk, and as a tool in underwriting and rate\ndecisions.\n\n¢ Certification and credentialing of individuals involved in the fields of building design, construc-\ntion and safety.\n\n¢ Certification of building and construction-related products.\ne US federal agencies, to guide construction in an array of government-owned properties.\ne Facilities management.\n\ne “Best practices” benchmarks for designers and builders, including those who are engaged in\nprojects in jurisdictions that do not have a formal regulatory system or a governmental\nenforcement mechanism.\n\n¢ College, university and professional school textbooks and curricula.\n¢ Reference works related to building design and construction.\n\nIn addition to the codes themselves, the code development process brings together building pro-\nfessionals on a regular basis. It provides an international forum for discussion and deliberation about\nbuilding design, construction methods, safety, performance requirements, technological advances\nand innovative products.\n\nThis 2021 edition presents the code as originally issued, with changes reflected in the 2003 through\n2018 editions and with further changes approved by the ICC Code Development Process through 2019.\nA new edition such as this is promulgated every 3 years.\n\nThis code is founded on principles intended to establish provisions consistent with the scope of a\nplumbing code that adequately protects public health, safety and welfare; provisions that do not\nunnecessarily increase construction costs; provisions that do not restrict the use of new materials,\nproducts or methods of construction; and provisions that do not give preferential treatment to partic-\nular types or classes of materials, products or methods of construction.\n\n2021 INTERNATIONAL PLUMBING CODE® iii\n"
    },
    {
        "page": 5,
        "text": "Maintenance\n\nThe International Plumbing Code is kept up to date through the review of proposed changes submitted\nby code enforcement officials, industry representatives, design professionals and other interested par-\nties. Proposed changes are carefully considered through an open code development process in which\nall interested and affected parties may participate.\n\nThe ICC Code Development Process reflects principles of openness, transparency, balance, due pro-\ncess and consensus, the principles embodied in OMB Circular A-119, which governs the federal gov-\nernment’s use of private-sector standards. The ICC process is open to anyone; there is no cost to\nparticipate, and people can participate without travel cost through the ICC’s cloud-based app, cdpAc-\ncess®. A broad cross-section of interests are represented in the ICC Code Development Process. The\ncodes, which are updated regularly, include safeguards that allow for emergency action when\nrequired for health and safety reasons.\n\nIn order to ensure that organizations with a direct and material interest in the codes have a voice in\nthe process, the ICC has developed partnerships with key industry segments that support the ICC’s\nimportant public safety mission. Some code development committee members were nominated by\nthe following industry partners and approved by the ICC Board:\n\n¢ American Institute of Architects (AIA)\n\n¢ American Society of Plumbing Engineers (ASPE)\n\ne National Association of Home Builders (NAHB)\n\n¢ Plumbing Heating and Cooling Contractors (PHCC)\n\nThe code development committees evaluate and make recommendations regarding proposed\nchanges to the codes. Their recommendations are then subject to public comment and council-wide\nvotes. The ICC’s governmental members—public safety officials who have no financial or business\ninterest in the outcome—cast the final votes on proposed changes.\n\nThe contents of this work are subject to change through the code development cycles and by any\ngovernmental entity that enacts the code into law. For more information regarding the code develop-\nment process, contact the Codes and Standards Development Department of the International Code\nCouncil.\n\nWhile the I-Code development procedure is thorough and comprehensive, the ICC, its members\nand those participating in the development of the codes disclaim any liability resulting from the publi-\ncation or use of the I-Codes, or from compliance or noncompliance with their provisions. The ICC does\nnot have the power or authority to police or enforce compliance with the contents of this code.\n\nCode Development Committee Responsibilities\n(Letter Designations in Front of Section Numbers)\n\nIn each code development cycle, proposed changes to the code are considered at the Committee\nAction Hearings by the International Plumbing Code Development Committee, whose action consti-\ntutes a recommendation to the voting membership for final action on the proposed change. Proposed\nchanges to a code section that has a number beginning with a letter in brackets are considered by a\ndifferent code development committee. For example, proposed changes to code sections that have\n[BS] in front of them (e.g., [BS] 309.2) are considered by the IBC—Structural Code Development Com-\nmittee at the code development hearings.\n\nhe bracketed letter designations for committees responsible for portions of this code are as fol-\nlows:\n\nA] = Administrative Code Development Committee\nBE] = IBC—Egress Code Development Committee\n\nBG] = |BC—General Code Development Committee\n\nBS] = |BC—Structural Code Development Committee\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 6,
        "text": "[E] = International Energy Conservation Code Development Committee\n[F] = International Fire Code Development Committee\n[M] = International Mechanical Code Development Committee\n\nFor the development of the 2024 edition of the I-Codes, there will be two groups of code develop-\nment committees and they will meet in separate years, as shown in the following Code Development\nHearings Table).\n\nCode change proposals submitted for code sections that have a letter designation in front of them\nwill be heard by the respective committee responsible for such code sections. Because different com-\nmittees hold Committee Action Hearings in different years, proposals for the IPC will be heard by com-\nmittees in both the 2021 (Group A) and the 2022 (Group B) code development cycles.\n\nFor example, every section of Chapter 1 of this code is designated as the responsibility of the\nAdministrative Code Development Committee, which is part of the Group B portion of the hearings.\nThis committee will hold its Committee Action Hearings in 2022 to consider code change proposals for\nChapter 1 of all I-Codes except the International Energy Conservation Code, International Residential\nCode and International Green Construction Code. Therefore, any proposals received for Chapter 1 of\n\nthis code will be assigned to the Administrative Code Development Committee for consideration in\n2022.\n\nIt is very important that anyone submitting code change proposals understands which code devel-\nopment committee is responsible for the section of the code that is the subject of the code change\nproposal. For further information on the Code Development Committee responsibilities, please visit\nthe ICC website at https://www.iccsafe.org/products-and-services/i-codes/code-development/cur-\nrent-code-development-cycle.\n\nCODE DEVELOPMENT HEARINGS\n\nJ Group A Codes Group B Codes 1\n| (Heard in 2021, Code Change Proposals (Heard in 2022, Code Change Proposals |\nJ Deadline: January 11, 2021) Deadline: January 10, 2022)\n\nr 1 of all codes=\nexcept IECC, IRC and IgCC, administrative ma\nupdates to currently referenced standards, and\ndesignated definitions) |\n\nInternational Building Code Administrative Provisions (Chapte\n\n— Egress (Chapters 10, 11, Appendix E)\n— Fire Safety (Chapters 7, 8, 9, 14, 26)\n— General (Chapters 2-6, 12, 27-33,\n\nir Appendices A, B, C, D, K, N)\n| | el\nInternational Fire Code International Building Code 7\n\n— Structural (Chapters 15-25,\nAppendices F, G, H, I, J, L, M)\n\nInternational Fuel Gas Code International Existing Building Code\n\nInternational Mechanical Code International Energy Conservation Code—Com-\nmercial\n\nInternational Plumbing Code International Energy Conservation Code—\nResidential\n\n— 1IECC—Residential\n— IRC—Energy (Chapter 11)\n\nInternational Property Maintenance Code International Green Construction Code\n(Chapter 1)\nInternational Private Sewage Disposal Code International Residential Code\n\n— IRC—Building (Chapters 1-10,\nAppendices E, F, H, J, K, L, M, O, Q, R, S, T)\n\n(continued)\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 7,
        "text": "CODE DEVELOPMENT HEARINGS—continued\n\nGroup A Codes Vl Group B Codes\n(Heard in 2021, Code Change Proposals | (Heard in 2022, Code Change Proposals\nDeadline: January 11, 2021) Deadline: January 10, 2022)\n1\n\n[International Residential Code |\n\n—IRC—Mechanical (Chapters 12-23)\n— IRC—Plumbing (Chapters 25-33,\nAppendices G, I, N, P)\n\nInternational Swimming Pool and Spa Code\nInternational Wildland-Urban Interface Code\n\nInternational Zoning Code\n\nNote: Proposed changes to the ICC Performance Code™ will be heard by the code development com-\nmittee noted in brackets [ ] in the text of the ICC Performance Code™.\n\nMarginal Markings\n\nSolid vertical lines in the margins within the body of the code indicate a technical change from the\nrequirements of the 2018 edition. Deletion indicators in the form of an arrow (™®) are provided in the\nmargin where an entire section, paragraph, exception or table has been deleted or an item in a list of\nitems or a table has been deleted.\n\nA single asterisk [*] placed in the margin indicates that text or a table has been relocated within the\ncode. A double asterisk [**] placed in the margin indicates that the text or table immediately following\nit has been relocated there from elsewhere in the code. The following table indicates such relocations\nin the 2021 edition of the International Plumbing Code.\n\nRELOCATIONS\n2021 LOCATION 2018 LOCATION\n104.8 + 103.4\n1048-5 103.4.1\n| 107 | +10\n| 108 T 107\n109 106.6 and 106.6.1\n110 106.3.1 and 106.5.6\n111 107.5 and 107.5.1\n112 107.6 and 107.7\n114.2 109.1\n115 108\nF101.3 109.2\nF101.3.1 109.2.1\nF101.3.2 109.2.2\nF101.3.4 109.2.3\nF101.3.5 109.2.5\nF101.3.6 109.2.4\n(continued)\n\nvi 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 8,
        "text": "RELOCATIONS—continued\n\n———20210CATION 2018 LOCATION\nF101.3.7 19.2.6\nF101.4 409.41\nF101.5 109.3\nF101.5.1 109.4\nF101.5.3 109.5\nF101.7 109.6\nF101.7.1 109.6.1\nF101.7.2 109.6.2\nF101.8 109.7\n\nCoordination of the International Codes\n\nItalicized Terms\n\nAdoption\n\nThe coordination of technical provisions is one of the strengths of the ICC family of model codes. The\ncodes can be used as a complete set of complementary documents, which will provide users with full\nintegration and coordination of technical provisions. Individual codes can also be used in subsets or as\nstand-alone documents. To make sure that each individual code is as complete as possible, some tech-\nnical provisions that are relevant to more than one subject area are duplicated in some of the model\ncodes. This allows users maximum flexibility in their application of the I-Codes.\n\nWords and terms defined in Chapter 2, Definitions, are italicized where they appear in code text and\nthe Chapter 2 definition applies. Where such words and terms are not italicized, common-use defini-\ntions apply. The words and terms selected have code-specific definitions that the user should read\ncarefully to facilitate better understanding of the code.\n\nThe International Code Council maintains a copyright in all of its codes and standards. Maintaining\ncopyright allows the ICC to fund its mission through sales of books, in both print and electronic for-\nmats. The ICC welcomes adoption of its codes by jurisdictions that recognize and acknowledge the\nICC’s copyright in the code, and further acknowledge the substantial shared value of the public/private\npartnership for code development between jurisdictions and the ICC.\n\nThe ICC also recognizes the need for jurisdictions to make laws available to the public. All |-Codes\nand I-Standards, along with the laws of many jurisdictions, are available for free in a nondownloadable\nform on the ICC’s website. Jurisdictions should contact the ICC at adoptions@iccsafe.org to learn how\nto adopt and distribute laws based on the International Plumbing Code in a manner that provides nec-\nessary access, while maintaining the ICC’s copyright.\n\nTo facilitate adoption, several sections of this code contain blanks for fill-in information that needs\nto be supplied by the adopting jurisdiction as part of the adoption legislation. For this code, please see:\n\nSection 101.1. Insert: [NAME OF JURISDICTION]\n\nSection 103.1. Insert: [NAME OF DEPARTMENT]\n\nSection 115.4. Insert: [OFFENSE, DOLLAR AMOUNT, NUMBER OF DAYS]\nSection 305.4.1. Insert: [NUMBER OF INCHES IN TWO LOCATIONS]\n\nSection 903.1.1. Insert: [NUMBER OF INCHES]\n\n2021 INTERNATIONAL PLUMBING CODE® vii\n"
    },
    {
        "page": 9,
        "text": "Effective use of the International Plumbing Code\n\nviii\n\nThe International Plumbing Code (IPC) is a model code that regulates the design and installation of\nplumbing systems including the plumbing fixtures in all types of buildings except for detached one-\nand two-family dwellings and townhouses that are not more than three stories above grade in height.\nThe regulations for plumbing systems in one- and two-family dwellings and townhouses are covered\nby Chapters 25 through 33 of the International Residential Code (IRC). The IPC addresses general\nplumbing regulations, fixture requirements, water heater installations and systems for water distribu-\ntion, sanitary drainage, special wastes, venting, storm drainage and medical gases. The IPC does not\naddress fuel gas piping systems as those systems are covered by the International Fuel Gas Code\n(IFGC). The IPC also does not regulate swimming pool piping systems, process piping systems, or util-\nity-owned piping and systems. The purpose of the IPC is to the establish the minimum acceptable level\nof safety to protect life and property from the potential dangers associated with supplying potable\nwater to plumbing fixtures and outlets and the conveyance of bacteria-laden wastewater from fix-\ntures.\n\nThe IPC is primarily a specification-oriented (prescriptive) code with some performance-oriented\ntext. For example, Section 405.1 is a performance statement but Chapter 6 contains the prescriptive\nrequirements that will cause Section 405.1 to be satisfied.\n\nWhere a building contains plumbing fixtures, those fixtures requiring water must be provided with\nan adequate supply of water for proper operation. The number of required plumbing fixtures for a\nbuilding is specified by this code and is based upon the anticipated maximum number of occupants for\nthe building and the type of building occupancy. This code provides prescriptive criteria for sizing pip-\ning systems connected to those fixtures. Through the use of code-approved materials and the installa-\ntion requirements specified in this code, plumbing systems will perform their intended function over\nthe life of the building. In summary, the IPC sets forth the minimum requirements for providing safe\nwater to a building as well as a safe manner in which liquidborne wastes are carried away from a build-\ning.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 10,
        "text": "ARRANGEMENT AND FORMAT OF THE 2021 IPC\n\nThe format of the IPC allows each chapter to be devoted to a particular subject with the exception of\nChapter 3, which contains general subject matters that are not extensive enough to warrant their own\nindependent chapter.\n\nThe following table lists those subjects. The ensuing chapter-by-chapter synopsis details the scope\nand intent of the provisions of the International Plumbing Code.\n\nCHAPTER TOPICS\nChapters Subjects\n1-2 Administration and Definitions\nGeneral Regutations————}\n—— Fixtures, Faucets-and Fixture Fittings\n\nWater Heaters\n\n3\n4\n5\n6 Water-Supply and Distribution\n7\n8\n9\n\nSanitary Drainage\nIndirect/Special Waste\n\nVents\n10 Traps, Interceptors and Separators\n11 Storm Drainage\n12 Special Piping (Medical Gas)\n13 Nonpotable Water Systems\n14 Subsurface Graywater Soil Absorption\n15 Referenced Standards\nAppendices A-F Appendices\nResource A Plumbing Provisions Excerpted from ICC A117.1-2017\n\nChapter 1 Scope and Administration\n\nChapter 1 contains provisions for the application, enforcement and administration of subsequent\nrequirements of the code. In addition to establishing the scope of the code, Chapter 1 identifies which\nbuildings and structures come under its purview. Chapter 1 is largely concerned with maintaining “due\nprocess of law” in enforcing the requirements contained in the body of this code. Only through careful\nobservation of the administrative provisions can the code official reasonably expect to demonstrate\nthat “equal protection under the law” has been provided.\n\nChapter 2 Definitions\n\nChapter 2 is the repository of the definitions of terms used in the body of the code. Codes are techni-\ncal documents and every word, term and punctuation mark can impact the meaning of the code text\nand the intended results. The code often uses terms that have a unique meaning in the code and the\ncode meaning can differ substantially from the ordinarily understood meaning of the term as used\noutside of the code.\n\nThe terms defined in Chapter 2 are deemed to be of prime importance in establishing the meaning\nand intent of the code text that uses the terms. The user of the code should be familiar with and con-\nsult this chapter because the definitions are essential to the correct interpretation of the code and\nbecause the user may not be aware that a term is defined.\n\nWhere understanding of a term’s definition is especially key to or necessary for understanding of a\nparticular code provision, the term is shown in italics. This is true only for those terms that have a\nmeaning that is unique to the code. In other words, the generally understood meaning of a term or\nphrase might not be sufficient or consistent with the meaning prescribed by the code; therefore, it is\nessential that the code-defined meaning be known.\n\nGuidance regarding tense, gender and plurality of defined terms as well as guidance regarding\nterms not defined in this code is provided.\n\n2021 INTERNATIONAL PLUMBING CODE® ix\n"
    },
    {
        "page": 11,
        "text": "Chapter 3 General Regulations\n\nThe content of Chapter 3 is often referred to as “miscellaneous,” rather than general regulations. This\nis the only chapter in the code whose requirements do not interrelate. If a requirement cannot be\nlocated in another chapter, it should be located in this chapter. Chapter 3 contains safety require-\nments for the installation of plumbing and nonplumbing requirements for all types of fixtures. This\nchapter also has requirements for the identification of pipe, pipe fittings, traps, fixtures, materials and\ndevices used in plumbing systems.\n\nThe safety requirements of this chapter provide protection for the building’s structural members,\nas well as prevent undue stress and strain on pipes. The building’s structural stability is protected by\nthe regulations for cutting and notching of structural members. Additional protection for the building\noccupants includes requirements to maintain the plumbing in a safe and sanitary condition, as well as\nprivacy for those occupants.\n\nChapter 4 Fixtures, Faucets and Fixture Fittings\n\nChapter 4 regulates the minimum number of plumbing fixtures that must be provided for every type\nof building. This chapter also regulates the quality of fixtures and faucets by requiring those items to\ncomply with nationally recognized standards. Because fixtures must be properly installed so that they\nare usable by the occupants of the building, this chapter contains the requirements for the installation\nof fixtures. Because the requirements for the number of plumbing fixtures affects the design of a\nbuilding, Chapter 29 of the International Building Code (IBC) includes, verbatim, many of the require-\nments listed in Chapter 4 of this code.\n\nChapter 5 Water Heaters\n\nChapter 5 regulates the design, approval and installation of water heaters and related safety devices.\nThe intent is to minimize the hazards associated with the installation and operation of water heaters.\nAlthough this code does not regulate the size of a water heater, it does regulate all other aspects of\nthe water heater installation, such as temperature and pressure relief valves, safety drip pans, installa-\ntion and connections. Where a water heater also supplies water for space heating, this chapter regu-\nlates the maximum water temperature supplied to the water distribution system.\n\nChapter 6 Water Supply and Distribution\n\nChapter 6 regulates the supply of potable water from both public and individual sources to every fix-\nture and outlet so that it remains potable and uncontaminated. Chapter 6 also regulates the design of\nthe water distribution system, which will allow fixtures to function properly and help prevent backflow\nconditions. The unique requirements of the water supply for health care facilities are addressed sepa-\nrately. It is critical that the potable water supply system remain free of actual or potential sanitary haz-\nards by providing protection against backflow.\n\nChapter 7 Sanitary Drainage\n\nThe purpose of Chapter 7 is to regulate the materials, design and installation of sanitary drainage pip-\ning systems and connections made to the system. The intent is to design and install sanitary drainage\nsystems that will function reliably, that are neither undersized nor oversized and that are constructed\nfrom materials, fittings and connections as prescribed herein. This chapter addresses the proper use of\nfittings for directing the flow into and within the sanitary drain piping system. Materials and provisions\nnecessary for servicing the drainage system are also included in this chapter.\n\nChapter 8 Indirect/Special Waste\n\nChapter 8 regulates drainage installations that require an indirect connection to the sanitary drainage\nsystem. Fixtures and plumbing appliances, such as those associated with food preparation or handling,\n\nx 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 12,
        "text": "health care facilities and potable liquids, must be protected from contamination that can result from\nconnection to the drainage system. An indirect connection prevents sewage from backing up into a fix-\nture or appliance, thus providing protection against potential health hazards. The chapter also regu-\nlates special wastes containing hazardous chemicals. Special waste must be treated to prevent any\ndamage to the sanitary drainage piping and to protect the sewage treatment processes.\n\nChapter 9 Vents\n\nChapter 9 covers the requirements for vents and venting. Knowing why venting is required makes it\neasier to understand the intent of this chapter. Venting protects every trap against the loss of its seal.\nProvisions set forth in this chapter are geared toward limiting the pressure differentials in the drainage\nsystem to a maximum of 1 inch of water column (249 Pa) above or below atmospheric pressure (i.e.,\npositive or negative pressures).\n\nChapter 10 Traps, Interceptors and Separators\n\nChapter 10 contains design requirements and installation limitations for traps. Prohibited types of\ntraps are specifically identified. Where fixtures do not frequently replenish the water in traps, a\nmethod is provided to ensure that the water seal of the trap will be maintained. Requirements for the\ndesign and location of various types of interceptors and separators are provided. Specific venting\nrequirements are given for separators and interceptors, as those requirements are not addressed in\nChapter 9.\n\nChapter 11 Storm Drainage\n\nChapter 11 regulates the removal of storm water typically associated with rainfall. The proper installa-\ntion of a storm drainage system reduces the possibility of structural collapse of a flat roof, prevents\nthe leakage of water through the roof, prevents damage to the footings and foundation of the building\nand prevents flooding of the lower levels of the building.\n\nChapter 12 Special Piping and Storage Systems\n\nChapter 12 contains the requirements for the design, installation, storage, handling and use of non-\nflammable medical gas systems, including inhalation anesthetic and vacuum piping systems, bulk oxy-\ngen storage systems and oxygen-fuel gas systems used for welding and cutting operations. The intent\nof these requirements is to minimize the potential fire and explosion hazards associated with the\ngases used in these systems.\n\nChapter 13 Nonpotable Water Systems\nChapter 13 regulates the design and installation of nonpotable water systems, including rainwater\nhavesting systems. The reduction of potable water use in buildings has led building designers in some\njurisdictions to use nonpotable water for flushing of water closets and urinals. This chapter provides\nthe overall requirements for these systems.\n\nChapter 14 Subsurface Graywater Soil Absorption Systems\nChapter 14 regulates the design and installation of subsurface graywater soil absorption systems for\nthe disposal of on-site nonpotable water such as graywater. The reduction of potable water use in\n\nbuildings has led building designers in some jurisdictions to use on-site nonpotable water for subsur-\nface irrigation. This chapter provides the overall requirements for these systems.\n\nChapter 15 Referenced Standards\n\nChapter 15 contains a comprehensive list of all standards that are referenced in the code. The stan-\ndards are part of the code to the extent of the reference to the standard. Compliance with the refer-\n\n2021 INTERNATIONAL PLUMBING CODE® xi\n"
    },
    {
        "page": 13,
        "text": "enced standard is necessary for compliance with this code. By providing specifically adopted\nstandards, the construction and installation requirements necessary for compliance with the code can\nbe readily determined. The basis for code compliance is, therefore, established and available on an\nequal basis to the code official, contractor, designer and owner.\n\nChapter 15 is organized in a manner that makes it easy to locate specific standards. It lists all of the\nreferenced standards, alphabetically, by acronym of the promulgating agency of the standard. Each\nagency’s standards are then listed in either alphabetical or numeric order based on the standard iden-\ntification. The list also contains the title of the standard; the edition (date) of the standard referenced;\nany addenda included as part of the ICC adoption; and the section or sections of this code that refer-\nence the standard.\n\nAppendix A Plumbing Permit Fee Schedule\n\nAppendix A provides a format for a fee schedule.\n\nAppendix B Rates of Rainfall for Various Cities\n\nAppendix B provides specific rainfall rates for major cities in the United States.\n\nAppendix C Structural Safety\n\nAppendix C is provided so that the user does not have to refer to another code book for limitations for\ncutting, notching and boring of sawn lumber and cold-formed steel framing.\n\nAppendix D Degree Day and Design Temperatures\n\nAppendix D provides valuable temperature information for designers and installers of plumbing sys-\ntems in areas where freezing temperatures might exist.\n\nAppendix E Sizing of Water Piping System\n\nAppendix E provides two recognized methods for sizing the water service and water distribution pip-\ning for any structure. The method under Section E103 provides friction loss diagrams that require the\nuser to “plot” points and read values from the diagrams in order to perform the required calculations\nand necessary checks. This method is the most accurate of the two presented in this appendix. The\nmethod under Section E104 is known to be conservative; however, very few calculations are necessary\nin order to determine a pipe size that satisfies the flow requirements of any application.\n\nAppendix F Board of Appeals\n\nAppendix F provides a set of regulations for the setup and operation of a Board of Appeals.\n\nResource A Plumbing Provisions Excerpted from ICC A117.1-2017\nStandard for Accessible and Usable Buildings and Facilities\n\nBuilding accessibility is a fundamental tenet in the International Codes. The codes rely on the provi-\nsions contained in ICC A117.1 for the design and construction of accessible buildings. Accessible\nplumbing facilities and fixtures play a key role in making sure that all aspects of the building provide\nthe requisite level of accessibility. ICC A117.1 is referenced in Sections 404.2 and 410.3. For user con-\nvenience and in order to provide the information necessary to ensure an accessible plumbing design,\nplumbing design-related excerpts from ICC A117.1 have been included in this edition as resource\nmaterial after the index. This information is not part of the IPC requirements.\n\nxii 2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 14,
        "text": "TABLE OF CONTENTS\n\nCHAPTER 1 SCOPE AND\nADMINISTRATION .........++-6+ 1-1\n\nPART 1—SCOPE AND APPLICATION........... 1-1\nSection\n\n101 General... 1.0.0... eee\n\n102 Applicability. . .\n\nPART 2—ADMINISTRATION\n\nAND ENFORCEMENT ...........+.+++ 1-2\nSection\n103 Code Compliance Agency ................0.. -2\n104 Duties and Powers of the Code Official......... -2\n105 Approval........ 0.00... eee eee eee eee -3\n106 Permits... 6... 6. eee eee -3\n107 Temporary Equipment, Systems and Uses....... 5\n108 Inspections and Testing ..................0.. -5\n109 Fees... cece\n\n110 Construction Documents\n111 Notice of Approval\n112 Service Utilities ................ 0...\n113 Stop Work Order ..............0..0.000000.8\n\n114 Means of Appeals................0...200008 -7\n115 Violations -8\nCHAPTER 2 DEFINITIONS ................+.- 2-1\nSection\n201 General... 0... eee eee 2-1\n202 General Definitions ..................0..00. 2-1\nCHAPTER 3 GENERAL REGULATIONS ....... 3-1\nSection\n301 General....... eee 3-1\n302 Exclusion of Materials Detrimental\n\nto the Sewer System. ..................00. 3-1\n303. Materials............ 0... e ee eee eee 3-1\n304 Rodentproofing.....................0000008 3-2\n\n305 Protection of Pipes and Plumbing\nSystem Components\n\n306 Trenching, Excavation and Backfill............ 3-2\n\n307 Structural Safety........ 0... eee 3-3\n308 Piping Support .....................000000, 3-3\n\n2021 INTERNATIONAL PLUMBING CODE®\n\n309 Flood Hazard Resistance.................... 3-4\n310 Washroom and Toilet Room Requirements...... 3-5\n311 Toilet Facilities for Workers ................. 3-5\n312 Tests and Inspections....................00. 3-5\n313 Equipment Efficiencies ..................... 3-6\n314 Condensate Disposal . . . 3-6\n315 Penetrations............ 0. eee eee eee 3-7\n316 Alternative Engineered Design ............... 3-7\nCHAPTER 4_ FIXTURES, FAUCETS\nAND FIXTURE FITTINGS ........ 4-1\n\nSection\n401 General...... 0... eee 4-1\n402 Fixture Materials....................00000. 4-1\n403 Minimum Plumbing Facilities................ 4-1\n404 Accessible Plumbing Facilities 4-5\n405 Installation of Fixtures...................000. 4-5\n406 Automatic Clothes Washers.................. 4-7\n407 Bathtubs................. 0... eee\n408 Bidets\n409 Dishwashing Machines\n410 Drinking Fountains .....................00.\n411 Emergency Showers and Eyewash Stations ..... 4-8\n412 Faucets and Fixture Fittings.................. 4-8\n413 Floor and Trench Drains ...............0.005 4-9\n414 Floor Sinks............... 0000.00.00 e eee 4-9\n415 Flushing Devices for\n\nWater Closets and Urinals................. 4-9\n416 Food Waste Disposer Units................. 4-10\n417 Garbage Can Washers ...............00.000- 4-10\n418 Laundry Trays .... 4-10\n419 Lavatories.................0 ccc eee eee eee 4-10\n420 Manual Food and Beverage\n\nDispensing Equipment. . . . 410\n421 Showers .......... 0... 4-10\n422 2\n423 2\n424 2\n425 2\n426 2\n\nxiii\n"
    },
    {
        "page": 15,
        "text": "TABLE OF CONTENTS\n\nCHAPTER5 WATER HEATERS............... 5-1\nSection\n\n501 General....\n\n502 Installation .............. 00... 5-1\n503. Connections .................0. 0c eee eee ee 5-2\n504 Safety Devices ...............0..00000 00 5-2\n505 Insulation ................ 0.00. eee 5-3\n\nCHAPTER 6 WATER SUPPLY\n\nAND DISTRIBUTION...........-- 6-1\n\nSection\n601 General... eee eee 6-1\n602 Water Required.................0.0.000000, 6-1\n603 Water Service......... 0... eee eee eee 6-2\n604 Design of Building Water\n\nDistribution System ..................0008 6-2\n605 Materials, Joints and Connections ............. 6-4\n606 Installation of the Building Water\n\nDistribution System ..................0008 6-9\n607 Hot Water Supply System .................. 6-10\n608 Protection of Potable Water Supply........... 6-11\n609 Health Care Plumbing ..................... 6-17\n610 Disinfection of Potable Water System......... 6-18\n\n611 Drinking Water Treatment Units .. .\n\n612 Solar Systems............00 000.0000 00 eee\n\n613 Temperature Control Devices and Valves...... 6-18\nCHAPTER7 SANITARY DRAINAGE........... 7-1\nSection\n\nTOL General... 0... eee\n702 Materials\n703\n704\n705\n\n706 Connections Between Drainage\nPiping and Fittings............\n\n707 Prohibited Joints and Connections\n708 Cleanouts ............ 0...\n709 Fixture Units... .\n710 Drainage System Sizing\n711 Offsets in Drainage Piping in Buildings\n\nof Five Stories or More ................0.\n\n712 Sumps and Ejectors ..................20008\n713 Computerized Drainage Design. .\n714 Backwater Valves............ 000. e eee eens\n715 Vacuum Drainage Systems ................-\n\nxiv\n\n716 Replacement of Underground Building Sewers\nand Building Drains by Pipe-Bursting\n\nMethods. .........0 00. cece cece ee 7-12\n717 Relining Building Sewers and\n\nBuilding Drains ....................000. 7-13\n718 Rehabilitation of Building Sewers and\n\nBuilding Drains ....................000. 7-13\nCHAPTER 8 INDIRECT/SPECIAL WASTE ..... 8-1\nSection\n801 General... 0.6... eee eee eee 8-1\n802 Indirect Wastes............. 0000 e eee eee eee 8-1\n803 Special Wastes................0..00 000 eee 8-2\nCHAPTER 9 VENTS..........00ceeceeeeeeeees 9-1\nSection\n\n901 General........ 0... eee\n902 Materials ...........0...0 00 eee\n903 Vent Terminals\n\n904 Outdoor Vent Extensions.................0.. 9-2\n905 Vent Connections and Grades................ 9-2\n906 Vent Pipe Sizing .....................0000. 9-2\n907 Vents for Stack Offsets .................000. 9-4\n908 Relief Vents—Stacks of More Than\n\n10 Branch Intervals...............00.0008 9-4\n909 Fixture Vents....................00000000, 9-5\n910 Individual Vent ......................0000. 9-5\n911 Common Vent................0.00. 002 e eee 9-5\n912 Wet Venting...................0... 0222 9-5\n913 Waste Stack Vent.....................0000. 9-6\n914 Circuit Venting.......................00000. 9-6\n915 Combination Waste and Vent System.......... 9-7\n916 Island Fixture Venting...................0.. 9-7\n917  Single-Stack Vent System................... 9-7\n918 Air Admittance Valves ................0.000. 9-8\n919 Engineered Vent Systems ................... 9-9\n920 Computerized Vent Design .................. 9-9\nCHAPTER 10 TRAPS, INTERCEPTORS\n\nAND SEPARATORS............ 10-1\n\nSection\n1001 General ............. 0... 10-1\n1002 Trap Requirements ...................204. 10-1\n1003 Interceptors and Separators................. 10-2\n1004 Materials, Joints andConnections ........... 10-4\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 16,
        "text": "CHAPTER 11 STORM DRAINAGE............ 11-1\nSection\n\n1101\n1102\n1103\n1104\n1105 Roof Drains\n\n1106 Size of Conductors, Leaders\nand Storm Drains.................000005 11-3\n\n1107 Siphonic Roof Drainage Systems .\n\n1108 Secondary (Emergency) Roof Drains......... 11-9\n1109 Combined Sanitary and Storm Public Sewer ... 11-9\n1110 Controlled Flow Roof Drain Systems......... 11-9\n1111 Subsoil Drains\n\n1112 Building Subdrains ...................... 11-10\n1113 Sumps and Pumping Systems.............. 11-10\n\nCHAPTER 12 SPECIAL PIPING AND\n\nSTORAGE SYSTEMS........... 12-1\nSection\n1201 General .............00 00 12-1\n1202 Medical Gases.................000.0.0008 12-1\n1203 Oxygen Systems ....................20008 12-1\n\nCHAPTER 13 NONPOTABLE\n\nWATER SYSTEMS ............- 13-1\nSection\n1301 General 0.0.0.0... cece eee eee eee 13-1\n1302 On-site Nonpotable Water Reuse Systems ..... 13-3\n\n1303 Nonpotable Rainwater Collection and\nDistribution Systems ..................0.\n\n1304 Reclaimed Water Systems\n\nCHAPTER 14 SUBSURFACE\n\nGRAYWATER SOIL\n\nABSORPTION SYSTEMS........ 14-1\nSection\n1401 General ............0.....0 cee 14-1\n1402 System Design and Sizing.................. 14-1\n\n1403 Installation\n\nCHAPTER 15 REFERENCED STANDARDS .... 15-1\n\nAPPENDIX A PLUMBING PERMIT\nFEE SCHEDULE ............... A-l\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nTABLE OF CONTENTS\n\nPermit Issuance............0..00 0c cece eee ee eee\nUnit Fee Schedule ............ 00.0.0... cee eee\nOther Inspections and Fees. .\n\nAPPENDIX B RATES OF RAINFALL\nFOR VARIOUS CITIES .......... B-1\n\nAPPENDIX C STRUCTURAL SAFETY ......... C-1\nSection\n\nC101 Cutting, Notching and Boring in\nWood Members...............00..000008 C-l\n\nAPPENDIX D DEGREE DAY AND\nDESIGN TEMPERATURES. ...... D-1\n\nAPPENDIX E SIZING OF WATER\n\nPIPING SYSTEM.............+5. E-1\nSection\nE101 General ....... 0.0.0. c eee E-l\nE102 Information Required ...................00.. E-1\nE103 Selection of Pipe Size................00000. E-l\nE104 Selection of Pipe Size.................000. E-19\nE105 Determination of Pipe Volumes............. E-19\nAPPENDIX F BOARD OF APPEALS ........... F-1\nSection\nFIO] General ...... 0.0... cece eee eee F-]\n| 1) D) D>, Gp INDEX-1\nRESOURCE A\n\nPLUMBING PROVISIONS EXCERPTED FROM:\nICC A117.1—2017\n\nSTANDARD FOR ACCESSIBLE AND USABLE\nBUILDINGS AND FACILITIES\n\nCHAPTER 1 APPLICATION AND\nADMINISTRATION .. RESOURCE A-1\n\n101) Title... eee RESOURCE A-1\n102. Purpose.................000008 RESOURCE A-1\n103 Human Factor Provisions. . . ... RESOURCE A-1\n104 Compliance Alternatives ......... RESOURCE A-1\n105 Conventions................... RESOURCE A-1\n106 Referenced Documents .......... RESOURCE A-1\n\n107 Definitions RESOURCE A-3\n\nxv\n"
    },
    {
        "page": 17,
        "text": "TABLE OF CONTENTS\n\nCHAPTER 3 BUILDING\n\nBLOCKS ............ RESOURCE A-7\n301 General................000000. RESOURCE A-7\n302 Floor Surfaces.................. RESOURCE A-7\n303 Changesin Level ............... RESOURCE A-7\n304 Turning Space.... . .RESOURCE A-8\n305 Clear Floor Space.............. RESOURCE A-10\n306 Knee and Toe Clearance......... RESOURCE A-11\n307 Protruding Objects............. RESOURCE A-13\n308 Reach Ranges................. RESOURCE A-14\n309 Operable Parts ................ RESOURCE A-15\n\nCHAPTER 6 PLUMBING ELEMENTS AND\n\nFACILITIES ....... RESOURCE A-17\n\n601 General ...............00000. RESOURCE A-17\n602 Drinking Fountains and\n\nBottle Filling Stations......... RESOURCE A-17\n603 Toilet and Bathing Rooms....... RESOURCE A-18\n604 Water Closets and Toilet\n\nCompartments .............. RESOURCE A-19\n605 Urinals .................0000. RESOURCE A-28\n606 Lavatories and Sinks . .. RESOURCE A-29\n607 Bathtubs..................00. RESOURCE A-30\n608 Shower Compartments.......... RESOURCE A-32\n609 Grab Bars..............00000. RESOURCE A-37\n610 Seats...... 0... eee eee RESOURCE A-39\n611 Washing Machines and Clothes\n\nDryers.............0.0.0008 RESOURCE A-40\n612 Saunas and Steam Rooms........ RESOURCE A-42\n\nCHAPTER 8 SPECIAL ROOMS\n\nAND SPACES....... RESOURCE A-43\n801 General..................000. RESOURCE A-43\n804 Kitchens.................000. RESOURCE A-43\n\nCHAPTER 11 DWELLING UNITS AND\nSLEEPING UNITS. .. RESOURCE A-47\n\n1101 General..............0.000008 RESOURCE A-47\n1102 Accessible Units............... RESOURCE A-47\n1103 Type A Units ..............0... RESOURCE A-48\n1104 Type B Units ..............0... RESOURCE A-54\n1105 Type C (Visitable) Units ........ RESOURCE A-63\n1106 Units with Communication\n\nFeatures ............0.0000, RESOURCE A-64\nxvi\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 18,
        "text": "CHAPTER 1\nSCOPE AND ADMINISTRATION\n\nUser note:\n\nAbout this chapter: Chapter 1 establishes the limits of applicability of this code and describes how the code is to be applied and enforced.\nChapter 1 is in two parts: Part 1—Scope and Application (Sections 101 and 102) and Part 2—Administration and Enforcement (Sections\n103-115). Section 101 identifies which buildings and structures come under its purview and references other I-Codes as applicable. Stan-\ndards and codes are scoped to the extent referenced (see Section 102.8).\n\nThis code is intended to be adopted as a legally enforceable document and it cannot be effective without adequate provisions for its admin-\nistration and enforcement. The provisions of Chapter 1 establish the authority and duties of the code official appointed by the authority\nhaving jurisdiction and also establish the rights and privileges of the design professional, contractor and property owner.\n\nPART 1—SCOPE AND APPLICATION\n\nSECTION 101\nSCOPE AND GENERAL REQUIREMENTS\n\n[A] 101.1 Title. These regulations shall be known as the\nPlumbing Code of [NAME OF JURISDICTION] hereinafter\nreferred to as “this code.”\n\n[A] 101.2 Scope. The provisions of this code shall apply to\nthe erection, installation, alteration, repairs, relocation,\nreplacement, addition to, use or maintenance of plumbing\nsystems within this jurisdiction. This code shall regulate\nnonflammable medical gas, inhalation anesthetic, vacuum\npiping, nonmedical oxygen systems and sanitary and\ncondensate vacuum collection systems. The installation of\nfuel gas distribution piping and equipment, fuel-gas-fired\nwater heaters and water heater venting systems shall be regu-\nlated by the /nternational Fuel Gas Code. Provisions in the\nappendices shall not apply unless specifically adopted.\n\nException: Detached one- and two-family dwellings and\ntownhouses not more than three stories above grade plane\nin height with a separate means of egress, and their acces-\nsory structures not more than three stories above grade\nplane in height, shall comply with this code or the /nter-\nnational Residential Code.\n\n[A] 101.3 Purpose. The purpose of this code is to establish\nminimum requirements to provide a reasonable level of\nsafety, health, property protection and general welfare by\nregulating and controlling the design, construction, installa-\ntion, quality of materials, location, operation and\nmaintenance or use of plumbing equipment and systems.\n\n[A] 101.4 Severability. If any section, subsection, sentence,\nclause or phrase of this code is for any reason held to be\nunconstitutional, such decision shall not affect the validity of\nthe remaining portions of this code.\n\nSECTION 102\nAPPLICABILITY\n\n[A] 102.1 General. Where there is a conflict between a\ngeneral requirement and a specific requirement, the specific\nrequirement shall govern. Where, in any specific case,\n\n2021 INTERNATIONAL PLUMBING CODE®\n\ndifferent sections of this code specify different materials,\nmethods of construction or other requirements, the most\nrestrictive shall govern.\n\n[A] 102.2 Existing installations. Plumbing systems lawfully\nin existence at the time of the adoption of this code shall be\npermitted to have their use and maintenance continued if the\nuse, maintenance or repair is in accordance with the original\ndesign and hazard to life, health or property is not created by\nsuch plumbing system.\n\n[A] 102.2.1 Existing buildings. Additions, alterations,\nrenovations or repairs related to building or structural\nissues shall be regulated by the /nternational Existing\nBuilding Code.\n\n[A] 102.3 Maintenance. Plumbing systems, materials and\nappurtenances, both existing and new, and parts thereof,\nshall be maintained in proper operating condition in accor-\ndance with the original design in a safe and sanitary\ncondition. Devices or safeguards required by this code shall\nbe maintained in compliance with the edition of the code\nunder which they were installed.\n\nThe owner or the owner’s authorized agent shall be\nresponsible for maintenance of plumbing systems. To deter-\nmine compliance with this provision, the code official shall\nhave the authority to require any plumbing system to be\nreinspected.\n\n[A] 102.4 Additions, alterations or repairs. Additions,\nalterations, renovations or repairs to any plumbing system\nshall conform to that required for a new plumbing system\nwithout requiring the existing plumbing system to comply\nwith all of the requirements of this code. Additions, alter-\nations or repairs shall not cause an existing system to\nbecome unsafe, unsanitary or overloaded.\n\nMinor additions, alterations, renovations and repairs to\nexisting plumbing systems shall meet the provisions for new\nconstruction, unless such work is done in the same manner\nand arrangement as was in the existing system, is not hazard-\nous and is approved.\n\n[A] 102.5 Change in occupancy. It shall be unlawful to\nmake any change in the occupancy of any structure that will\nsubject the structure to any special provision of this code\napplicable to the new occupancy without approval of the\n\n1-1\n"
    },
    {
        "page": 19,
        "text": "SCOPE AND ADMINISTRATION\n\ncode official. The code official shall certify that such struc-\nture meets the intent of the provisions of law governing\nbuilding construction for the proposed new occupancy and\nthat such change of occupancy does not result in any hazard\nto the public health, safety or welfare.\n\n[A] 102.6 Historic buildings. The provisions of this code\nrelating to the construction, alteration, repair, enlargement,\nrestoration, relocation or moving of buildings or structures\nshall not be mandatory for existing buildings or structures\nidentified and classified by the state or local jurisdiction as\nhistoric buildings where such buildings or structures are\njudged by the code official to be safe and in the public inter-\nest of health, safety and welfare regarding any proposed\nconstruction, alteration, repair, enlargement, restoration,\nrelocation or moving of buildings.\n\n[A] 102.7 Moved buildings. Except as determined by\nSection 102.2, plumbing systems that are a part of buildings\nor structures moved into or within the jurisdiction shall\ncomply with the provisions of this code for new installations.\n\n[A] 102.8 Referenced codes and standards. The codes and\nstandards referenced in this code shall be those that are listed\nin Chapter 15 and such codes and standards shall be consid-\nered as part of the requirements of this code to the prescribed\nextent of each such reference and as further regulated in\nSections 102.8.1 and 102.8.2.\n\n[A] 102.8.1 Conflicts. Where conflicts occur between\nprovisions of this code and the referenced standards, the\nprovisions of this code shall apply.\n\n[A] 102.8.2 Provisions in referenced codes and stan-\ndards. Where the extent of the reference to a referenced\ncode or standard includes subject matter that is within the\nscope of this code, the provisions of this code, as applica-\nble, shall take precedence over the provisions in the\nreferenced code or standard.\n\n[A] 102.9 Requirements not covered by code. Any require-\nments necessary for the strength, stability or proper\noperation of an existing or proposed plumbing system, or for\nthe public safety, health and general welfare, not specifically\ncovered by this code shall be determined by the code\nofficial.\n\n[A] 102.10 Other laws. The provisions of this code shall not\nbe deemed to nullify any provisions of local, state or federal\nlaw.\n\n[A] 102.11 Application of references. Reference to chapter\nsection numbers, or to provisions not specifically identified\nby number, shall be construed to refer to such chapter,\nsection or provision of this code.\n\nPART 2—ADMINISTRATION AND ENFORCEMENT\n\nSECTION 103\nCODE COMPLIANCE AGENCY\n\n[A] 103.1 Creation of agency. The [INSERT NAME OF\nDEPARTMENT] is hereby created and the official in charge\nthereof shall be known as the code official. The function of\n\n1-2\n\nthe agency shall be the implementation, administration and\nenforcement of the provisions of this code.\n\n[A] 103.2 Appointment. The code official shall be\nappointed by the chief appointing authority of the\njurisdiction.\n\n[A] 103.3 Deputies. In accordance with the prescribed\nprocedures of this jurisdiction and with the concurrence of\nthe appointing authority, the code official shall have the\nauthority to appoint a deputy code official, other related\ntechnical officers, inspectors and other employees. Such\nemployees shall have powers as delegated by the code\nofficial.\n\nSECTION 104\nDUTIES AND POWERS OF THE CODE OFFICIAL\n\n[A] 104.1 General. The code official is hereby authorized\nand directed to enforce the provisions of this code. The code\nofficial shall have the authority to render interpretations of\nthis code and to adopt policies and procedures in order to\nclarify the application of its provisions. Such interpretations,\npolicies and procedures shall be in compliance with the\nintent and purpose of this code. Such policies and procedures\nshall not have the effect of waiving requirements specifically\nprovided for in this code.\n\n[A] 104.2 Applications and permits. The code official shall\nreceive applications, review construction documents and\nissue permits for the installation and alteration of plumbing\nsystems, inspect the premises for which such permits have\nbeen issued, and enforce compliance with the provisions of\nthis code.\n\n[A] 104.3 Inspections. The code official shall make all of\nthe required inspections, or shall accept reports of inspec-\ntions by approved agencies or individuals. Reports of such\ninspections shall be in writing and be certified by a responsi-\nble officer of such approved agency or by the responsible\nindividual. The code official is authorized to engage such\nexpert opinion as deemed necessary to report on unusual\ntechnical issues that arise, subject to the approval of the\nappointing authority.\n\n[A] 104.4 Right of entry. Where it is necessary to make an\ninspection to enforce the provisions of this code, or where\nthe code official has reasonable cause to believe that there\nexists in any building or on any premises any conditions or\nviolations of this code that make the building or premises\nunsafe, unsanitary, dangerous or hazardous, the code official\nshall have the authority to enter the building or premises at\nall reasonable times to inspect or to perform the duties\nimposed upon the code official by this code. If such building\nor premises is occupied, the code official shall present\ncredentials to the occupant and request entry. If such build-\ning or premises is unoccupied, the code official shall first\nmake a reasonable effort to locate the owner, the owner’s\nauthorized agent or other person having charge or control of\nthe building or premises and request entry. If entry is\nrefused, the code official shall have recourse to every\nremedy provided by law to secure entry.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 20,
        "text": "2k\n\nWhere the code official shall have first obtained a proper\ninspection warrant or other remedy provided by law to\nsecure entry, the owner, owner’s authorized agent, occupant\nor person having charge, care or control of any building or\npremises shall not fail or neglect, after proper request is\nmade as herein provided, to promptly permit entry therein by\nthe code official for the purpose of inspection and examina-\ntion pursuant to this code.\n\n[A] 104.5 Identification. The code official shall carry\nproper identification when inspecting structures or premises\nin the performance of duties under this code.\n\n[A] 104.6 Notices and orders. The code official shall issue\nall necessary notices or orders to ensure compliance with this\ncode.\n\n[A] 104.7 Department records. The code official shall keep\nofficial records of applications received, permits and certifi-\ncates issued, fees collected, reports of inspections, and\nnotices and orders issued. Such records shall be retained in\nthe official records for the period required for the retention\nof public records.\n\n[A] 104.8 Liability. The code official, member of the board\nof appeals or employee charged with the enforcement of this\ncode, while acting for the jurisdiction in good faith and with-\nout malice in the discharge of the duties required by this\ncode or other pertinent law or ordinance, shall not thereby be\nrendered civilly or criminally liable personally, and is hereby\nrelieved from all personal liability for any damage accruing\nto persons or property as a result of any act or by reason of\nan act or omission in the discharge of official duties.\n\n[A] 104.8.1 Legal defense. Any suit or criminal\ncomplaint instituted against any officer or employee\nbecause of an act performed by that officer or employee\nin the lawful discharge of duties and under the provisions\nof this code shall be defended by the legal representative\nof the jurisdiction until the final termination of the\nproceedings. The code official or any subordinate shall\nnot be liable for costs in any action, suit or proceeding\nthat is instituted in pursuance of the provisions of this\ncode.\n\nSECTION 105\nAPPROVAL\n\n[A] 105.1 Modifications. Where there are practical difficul-\nties involved in carrying out the provisions of this code, the\ncode official shall have the authority to grant modifications\nfor individual cases, upon application of the owner or\nowner’s authorized agent, provided that the code official\nshall first find that special individual reason makes the strict\nletter of this code impractical and the modification conforms\nto the intent and purpose of this code and that such modifica-\ntion does not lessen health, life and fire safety requirements.\nThe details of action granting modifications shall be\nrecorded and entered in the files of the plumbing inspection\ndepartment.\n\n[A] 105.2 Alternative materials, design and methods of\nconstruction and equipment. The provisions of this code\nare not intended to prevent the installation of any material or\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nSCOPE AND ADMINISTRATION\n\nto prohibit any design or method of construction not specifi-\ncally prescribed by this code, provided that any such\nalternative has been approved. An alternative material or\nmethod of construction shall be approved where the code\nofficial finds that the proposed design is satisfactory and\ncomplies with the intent of the provisions of this code, and\nthat the material, method or work offered is, for the purpose\nintended, not less than the equivalent of that prescribed in\nthis code in quality, strength, effectiveness, fire resistance,\ndurability and safety. Where the alternative material, design\nor method of construction is not approved, the code official\nshall respond in writing, stating the reasons why the alterna-\ntive was not approved.\n\n[A] 105.2.1 Research reports. Supporting data, where\nnecessary to assist in the approval of materials or assem-\nblies not specifically provided for in this code, shall\nconsist of valid research reports from approved sources.\n\n[A] 105.3 Required testing. Where there is insufficient\nevidence of compliance with the provisions of this code, or\nevidence that a material or method does not conform to the\nrequirements of this code, or in order to substantiate claims\nfor alternative materials or methods, the code official shall\nhave the authority to require tests as evidence of compliance\nto be made at no expense to the jurisdiction.\n\n[A] 105.3.1 Test methods. Test methods shall be as spec-\nified in this code or by other recognized test standards. In\nthe absence of recognized and accepted test methods, the\ncode official shall approve the testing procedures.\n\n[A] 105.3.2 Testing agency. Tests shall be performed by\nan approved agency.\n\n[A] 105.3.3. Test reports. Reports of tests shall be\nretained by the code official for the period required for\nretention of public records.\n\n[A] 105.4 Approved materials and equipment. Materials,\nequipment and devices approved by the code official shall be\nconstructed and installed in accordance with such approval.\n\n[A] 105.4.1 Material and equipment reuse. Materials,\nequipment and devices shall not be reused unless such\nelements have been reconditioned, tested, placed in good\nand proper working condition and approved.\n\nSECTION 106\nPERMITS\n\n[A] 106.1 Where required. Any owner, owner’s authorized\nagent or contractor who desires to construct, enlarge, alter,\nrepair, move, demolish or change the occupancy of a build-\ning or structure, or to erect, install, enlarge, alter, repair,\nremove, convert or replace any plumbing system, the instal-\nlation of which is regulated by this code, or to cause any\nsuch work to be performed, shall first make application to\nthe code official and obtain the required permit for the work.\n\n[A] 106.1.1 Annual permit. Instead of an individual\nconstruction permit for each alteration to an already\napproved system or equipment or appliance installation,\nthe code official is authorized to issue an annual permit\nupon application therefor to any person, firm or corpora-\n\n1-3\n"
    },
    {
        "page": 21,
        "text": "SCOPE AND ADMINISTRATION\n\ntion regularly employing one or more qualified\ntradespersons in the building, structure or on the premises\nowned or operated by the applicant for the permit.\n\n[A] 106.1.2 Annual permit records. The person to\nwhom an annual permit is issued shall keep a detailed\nrecord of alterations made under such annual permit. The\ncode official shall have access to such records at all times\nor such records shall be filed with the code official as\ndesignated.\n\n[A] 106.2 Exempt work. The following work shall be\nexempt from the requirement for a permit:\n\n1. The stopping of leaks in drains, water, soil, waste or\nvent pipe provided, however, that if any concealed\ntrap, drainpipe, water, soil, waste or vent pipe\nbecomes defective and it becomes necessary to\nremove and replace the same with new material, such\nwork shall be considered as new work and a permit\nshall be obtained and inspection made as provided in\nthis code.\n\n2. The clearing of stoppages or the repairing of leaks in\npipes, valves or fixtures, and the removal and rein-\nstallation of water closets, provided that such repairs\ndo not involve or require the replacement or rear-\nrangement of valves, pipes or fixtures.\n\nExemption from the permit requirements of this code\nshall not be deemed to grant authorization for any work to be\ndone in violation of the provisions of this code or any other\nlaws or ordinances of this jurisdiction.\n\n[A] 106.3 Application for permit. Each application for a\npermit, with the required fee, shall be filed with the code\nofficial on a form furnished for that purpose and shall\ncontain a general description of the proposed work and its\nlocation. The application shall be signed by the owner or\nowner’s authorized agent. The permit application shall indi-\ncate the proposed occupancy of all parts of the building and\nof that portion of the site or lot, if any, not covered by the\nbuilding or structure and shall contain such other informa-\ntion required by the code official.\n\n[A] 106.3.1 Preliminary inspection. Before a permit is\nissued, the code official shall be authorized to inspect and\nevaluate the systems, equipment, buildings, devices,\npremises and spaces or areas to be used.\n\n[A] 106.3.2 Time limitation of application. An applica-\ntion for a permit for any proposed work shall be deemed\nto have been abandoned 180 days after the date of filing,\nunless such application has been pursued in good faith or\na permit has been issued; except that the code official\nshall have the authority to grant one or more extensions of\ntime for additional periods not exceeding 180 days each.\nThe extension shall be requested in writing and justifiable\ncause demonstrated.\n\n[A] 106.4 By whom application is made. Application for a\npermit shall be made by the person or agent to install all or\npart of any plumbing system. The applicant shall meet all\nqualifications established by statute, or by rules promulgated\nby this code, or by ordinance or by resolution. The full name\nand address of the applicant shall be stated in the application.\n\n[A] 106.5 Permit issuance. The application, construction\ndocuments and other data filed by an applicant for permit\nshall be reviewed by the code official. If the code official\nfinds that the proposed work conforms to the requirements of\nthis code and all laws and ordinances applicable thereto, and\nthat the fees specified in Section 109.1 have been paid, a\npermit shall be issued to the applicant.\n\n[A] 106.5.1 Approved construction documents. When\nthe code official issues the permit where construction\ndocuments are required, the construction documents shall\nbe endorsed in writing and stamped “APPROVED.” Such\napproved construction documents shall not be changed,\nmodified or altered without authorization from the code\nofficial. Work shall be done in accordance with the\napproved construction documents.\n\nThe code official shall have the authority to issue a\npermit for the construction of a part of a plumbing system\nbefore the entire construction documents for the whole\nsystem have been submitted or approved, provided that\nadequate information and detailed statements have been\nfiled complying with all pertinent requirements of this\ncode. The holders of such permit shall proceed at their\nown risk without assurance that the permit for the entire\nplumbing system will be granted.\n\n[A] 106.5.2 Validity. The issuance of a permit or\napproval of construction documents shall not be\nconstrued to be a permit for, or an approval of, any viola-\ntion of any of the provisions of this code or any other\nordinance of the jurisdiction. A permit presuming to give\nauthority to violate or cancel the provisions of this code\nshall not be valid.\n\nThe issuance of a permit based on construction docu-\nments and other data shall not prevent the code official\nrom thereafter requiring the correction of errors in said\nconstruction documents and other data or from preventing\nuilding operations being carried on thereunder where in\nviolation of this code or of other ordinances of this\njurisdiction.\n\n[A] 106.5.3 Expiration. Every permit issued by the code\nofficial under the provisions of this code shall expire by\nimitation and become null and void if the work autho-\nrized by such permit is not commenced within 180 days\nrom the date of such permit, or if the work authorized by\nsuch permit is suspended or abandoned at any time after\nthe work is commenced for a period of 180 days. Before\nsuch work can be recommenced, a new permit shall be\nfirst obtained and the fee therefor shall be one-half the\namount required for a new permit for such work, provided\nthat changes have not been made and will not be made in\nthe original construction documents for such work, and\nprovided further that such suspension or abandonment\nhas not exceeded 1 year.\n\n[A] 106.5.4 Extensions. Any permittee holding an unex-\npired permit shall have the right to apply for an extension\nof the time within which the permittee will commence\nwork under that permit when work is unable to be\ncommenced within the time required by this section for\ngood and satisfactory reasons. The code official shall\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 22,
        "text": "2k\n\n2k\n\nextend the time for action by the permittee for a period\nnot exceeding 180 days if there is reasonable cause. A\npermit shall not be extended more than once. The fee for\nan extension shall be one-half the amount required for a\nnew permit for such work.\n\n[A] 106.5.5 Suspension or revocation of permit. The\ncode official shall have the authority to suspend or revoke\na permit issued under the provisions of this code wher-\never the permit is issued in error or on the basis of\nincorrect, inaccurate or incomplete information, or in\nviolation of any ordinance or regulation or any of the\nprovisions of this code.\n\n[A] 106.5.6 Previous approvals. This code shall not\nrequire changes in the construction documents, construc-\ntion or designated occupancy of a structure for which a\nlawful permit has been heretofore issued or otherwise\nlawfully authorized, and the construction of which has\nbeen pursued in good faith within 180 days after the\neffective date of this code and has not been abandoned.\n\n[A] 106.5.7 Posting of permit. The permit or a copy shall\nbe kept on the site of the work until the completion of the\nproject.\n\nSECTION 107\nTEMPORARY EQUIPMENT, SYSTEMS AND USES\n\n[A] 107.1 General. The code official is authorized to issue a\npermit for temporary equipment, systems and uses. Such\npermits shall be limited as to time of service, but shall not be\npermitted for more than 180 days. The code official is autho-\nrized to grant extensions for demonstrated cause.\n\n[A] 107.2 Conformance. Temporary equipment, systems\nand uses shall conform to the structural strength, fire safety,\nmeans of egress, accessibility, light, ventilation and sanitary\nrequirements of this code as necessary to ensure the public\nhealth, safety and general welfare.\n\n[A] 107.3 Temporary utilities. The code official is autho-\nrized to give permission to temporarily supply utilities\nbefore an installation has been fully completed and the final\ncertificate of completion has been issued. The part covered\nby the temporary certificate shall comply with the require-\nments specified for temporary lighting, heat or power in the\ncode.\n\n[A] 107.4 Termination of approval. The code official is\nauthorized to terminate such permit for temporary equip-\nment, systems or uses and to order the temporary equipment,\nsystems or uses to be discontinued.\n\nSECTION 108\nINSPECTIONS AND TESTING\n\n[A] 108.1 General. The code official is authorized to\nconduct such inspections as are deemed necessary to deter-\nmine compliance with the provisions of this code.\nConstruction or work for which a permit is required shall be\nsubject to inspection by the code official, and such construc-\ntion or work shall remain visible and able to be accessed for\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nSCOPE AND ADMINISTRATION\n\ninspection purposes until approved. Approval as a result of\nan inspection shall not be construed to be an approval of a\nviolation of the provisions of this code or of other ordinances\nof the jurisdiction. Inspections presuming to give authority\nto violate or cancel the provisions of this code or of other\nordinances of the jurisdiction shall not be valid. It shall be\nthe duty of the permit applicant to cause the work to remain\nvisible and able to be accessed for inspection purposes.\nNeither the code official nor the jurisdiction shall be liable\nfor expenses entailed in the removal or replacement of any\nmaterial required to allow inspection.\n\n[A] 108.2 Required inspections and testing. The code offi-\ncial, upon notification from the permit holder or the permit\nholder’s agent, shall make the following inspections and\nsuch other inspections as necessary, and shall either release\n\nthat portion of the construction or shall notify the permit\n\nholder or an agent of any violations that must be corrected.\nThe holder of the permit shall be responsible for the schedul-\ning of such inspections.\n\n1. Underground inspection shall be made after trenches\nor ditches are excavated and bedded, piping installed,\nand before any backfill is put in place.\n\n2. Rough-in inspection shall be made after the roof,\nframing, fireblocking, firestopping, draftstopping\nand bracing is in place and all sanitary, storm and\nwater distribution piping is roughed-in, and prior to\nthe installation of wall or ceiling membranes.\n\n3. Final inspection shall be made after the building is\ncomplete, all plumbing fixtures are in place and\nproperly connected, and the structure is ready for\noccupancy.\n\n[A] 108.2.1 Other inspections. In addition to the inspec-\ntions specified in Section 108.2, the code official shall be\nauthorized to make or require other inspections of any\nconstruction work to ascertain compliance with the provi-\nsions of this code and other laws that are enforced.\n\n[A] 108.2.2 Inspection requests. It shall be the duty of\nthe holder of the permit or their duly authorized agent to\nnotify the code official when work is ready for inspection.\nIt shall be the duty of the permit holder to provide access\nto and means for inspections of such work that are\nrequired by this code.\n\n[A] 108.2.3 Approval required. Work shall not be done\nbeyond the point indicated in each successive inspection\nwithout first obtaining the approval of the code official.\nThe code official, upon notification, shall make the\nrequested inspections and shall either indicate the portion\nof the construction that is satisfactory as completed, or\nnotify the permit holder or his or her agent wherein the\nsame fails to comply with this code. Any portions that do\nnot comply shall be corrected and such portion shall not\nbe covered or concealed until authorized by the code\nofficial.\n\n[A] 108.2.4 Approved agencies. The code official is\nauthorized to accept reports of approved inspection agen-\ncies, provided that such agencies satisfy the requirements\nas to qualifications and reliability.\n"
    },
    {
        "page": 23,
        "text": "SCOPE AND ADMINISTRATION\n\n[A] 108.2.5 Evaluation and follow-up inspection\nservices. Prior to the approval of a closed, prefabricated\nplumbing system and the issuance of a plumbing permit,\nthe code official shall require the submittal of an evalua-\ntion report on each prefabricated plumbing system\nindicating the complete details of the plumbing system,\nincluding a description of the system and its components,\nthe basis on which the plumbing system is being evalu-\nated, test results and similar information, and other data\nas necessary for the code official to determine confor-\nmance to this code.\n\n[A] 108.2.5.1 Evaluation service. The code official\nshall designate the evaluation service of an approved\nagency as the evaluation agency, and review such\nagency’s evaluation report for adequacy and confor-\nmance to this code.\n\n[A] 108.2.5.2 Follow-up inspection. Except where\nready access is provided to all plumbing systems,\nservice equipment and accessories for complete\ninspection at the site without disassembly or disman-\ntling, the code official shall conduct the frequency of\nin-plant inspections necessary to ensure conformance\nto the approved evaluation report or shall designate an\nindependent, approved inspection agency to conduct\nsuch inspections. The inspection agency shall furnish\nthe code official with the follow-up inspection manual\nand a report of inspections on request, and the plumb-\ning system shall have an identifying label permanently\naffixed to the system indicating that factory inspec-\ntions have been performed.\n\n[A] 108.2.5.3 Test and inspection records. Required\ntest and inspection records shall be available to the\ncode official at all times during the fabrication of the\nplumbing system and the erection of the building, or\nsuch records as the code official designates shall be\nfiled.\n\n[A] 108.3 Special inspections. Special inspections of alter-\nnative engineered design plumbing systems shall be\nconducted in accordance with Sections 108.3.1 and 108.3.2.\n\n[A] 108.3.1 Periodic inspection. The registered design\nprofessional or designated inspector shall periodically\ninspect and observe the alternative engineered design to\ndetermine that the installation is in accordance with the\napproved construction documents. Discrepancies shall be\nbrought to the immediate attention of the plumbing\ncontractor for correction. Records shall be kept of all\ninspections.\n\n[A] 108.3.2 Written report. The registered design\nprofessional shall submit a final report in writing to the\ncode official upon completion of the installation, certify-\ning that the alternative engineered design conforms to the\napproved construction documents. A notice of approval\nfor the plumbing system shall not be issued until a written\ncertification has been submitted.\n\n[A] 108.4 Testing. Plumbing work and systems shall be\ntested as required in Section 312 and in accordance with\nSections 108.4.1 through 108.4.3. Tests shall be made by the\npermit holder and observed by the code official.\n\n1-6\n\n[A] 108.4.1 New, altered, extended or repaired\nsystems. New plumbing systems and parts of existing\nsystems that have been altered, extended or repaired shall\nbe tested as prescribed herein to disclose leaks and\ndefects, except that testing is not required in the following\ncases:\n\n1. In any case that does not include addition to,\nreplacement, alteration or relocation of any water\nsupply, drainage or vent piping.\n\n2. In any case where plumbing equipment is set up\ntemporarily for exhibition purposes.\n\n[A] 108.4.2 Equipment, material and labor for tests.\nEquipment, material and labor required for testing a\nplumbing system or part thereof shall be furnished by the\npermit holder.\n\n[A] 108.4.3 Reinspection and testing. Where any work\nor installation does not pass any initial test or inspection,\nthe necessary corrections shall be made to comply with\nthis code. The work or installation shall then be resubmit-\nted to the code official for inspection and testing.\n\nSECTION 109\nFEES\n\n[A] 109.1 Payment of fees. A permit shall not be valid until\nthe fees prescribed by law have been paid. An amendment to\na permit shall not be released until the additional fee, if any,\nhas been paid.\n\n[A] 109.2 Schedule of permit fees. Where work requires a\npermit, a fee for each permit shall be paid as required, in\naccordance with the schedule as established by the applica-\nble governing authority.\n\n[A] 109.3 Work commencing before permit issuance. Any\nperson who commences any work on a plumbing system\nbefore obtaining the necessary permits shall be subject to a\nfee established by the code official that shall be in addition to\nthe required permit fees.\n\n[A] 109.4 Related fees. The payment of the fee for the\nconstruction, alteration, removal or demolition for work\ndone in connection to or concurrently with the work autho-\nrized by a permit shall not relieve the applicant or holder of\nthe permit from the payment of other fees that are prescribed\nby law\n\n[A] 109.5 Refunds. The code official is authorized to estab-\nlish a refund policy.\n\nSECTION 110\nCONSTRUCTION DOCUMENTS\n\n[A] 110.1 Construction documents. Construction docu-\nments, engineering calculations, diagrams and other such\ndata shall be submitted in two or more sets, or in a digital\nformat where allowed by the code official, with each appli-\ncation for a permit. The code official shall require\nconstruction documents, computations and specifications to\nbe prepared and designed by a registered design professional\nwhere required by state law. Construction documents shall\n\n2021 INTERNATIONAL PLUMBING CODE®\n\n|\n\n2k\n"
    },
    {
        "page": 24,
        "text": "2k\n\n“|\n\n“|\n\nbe drawn to scale and shall be of sufficient clarity to indicate\nthe location, nature and extent of the work proposed and\nshow in detail that the work conforms to the provisions of\nthis code. Construction documents for buildings more than\ntwo stories in height shall indicate where penetrations will be\nmade for pipes, fittings and components and shall indicate\nthe materials and methods for maintaining required struc-\ntural safety, fire-resistance rating and fireblocking.\n\nException: The code official shall have the authority to\nwaive the submission of construction documents, calcula-\ntions or other data if the nature of the work applied for is\nsuch that the reviewing of construction documents is not\nnecessary to determine compliance with this code.\n\n[A] 110.2 Retention of construction documents. One set of\napproved construction documents shall be retained by the\ncode official for a period of not less than 180 days from date\nof completion of the permitted work, or as required by state\nor local laws.\n\nOne set of approved construction documents shall be\nreturned to the applicant, and said set shall be kept on the site\nof the building or work at all times during which the work\nauthorized thereby is in progress.\n\nSECTION 111\nNOTICE OF APPROVAL\n\n[A] 111.1 Approval. After the prescribed tests and inspec-\ntions indicate that the work complies in all respects with this\ncode, a notice of approval shall be issued by the code\nofficial.\n\n[A] 111.1.1 Revocation. The code official is authorized\nto, in writing, suspend or revoke a notice of approval\nissued under the provisions of this code wherever the\nnotice is issued in error, or on the basis of incorrect infor-\nmation supplied, or where it is determined that the\nbuilding or structure, premise or portion thereof is in\nviolation of any ordinance or regulation or any of the\nprovisions of this code.\n\nSECTION 112\nSERVICE UTILITIES\n\n[A] 112.1 Connection of service utilities. A person shall not\nmake connections from a utility, source of energy, fuel,\npower, water system or sewer system to any building or\nsystem that is regulated by this code for which a permit is\nrequired until authorized by the code official.\n\n[A] 112.2 Temporary connection. The code official shall\nhave the authority to authorize the temporary connection of\nthe building or system to the utility, source of energy, fuel,\npower, water system or sewer system for the purpose of test-\ning plumbing systems or for use under a temporary approval.\n\n[A] 112.3 Authority to disconnect service utilities. The\ncode official shall have the authority to authorize disconnec-\ntion of utility service to the building, structure or system\nregulated by this code and the referenced codes and stan-\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nSCOPE AND ADMINISTRATION\n\ndards in case of emergency where necessary to eliminate an\nimmediate hazard to life or property or where such utility\nconnection has been made without the approval required by\nSection 112.1 or 112.2.\n\nThe code official shall notify the serving utility, and\nwherever possible the owner or the owner’s authorized agent\nand occupant of the building, structure or service system, of\nthe decision to disconnect prior to taking such action. If not\nnotified prior to disconnecting, the owner, the owner’s\nauthorized agent or occupant of the building, structure or\nservice system shall be notified in writing as soon as practi-\ncal thereafter.\n\nSECTION 113\nSTOP WORK ORDER\n\n[A] 113.1 Authority. Where the code official finds any work\nregulated by this code being performed in a manner contrary\nto the provisions of this code or in a dangerous or unsafe\nmanner, the code official is authorized to issue a stop work\norder.\n\n[A] 113.2 Issuance. The stop work order shall be in writing\nand shall be given to the owner of the property, the owner’s\nauthorized agent or the person performing the work. Upon\nissuance of a stop work order, the cited work shall immedi-\nately cease. The stop work order shall state the reason for the\norder and the conditions under which the cited work is\nauthorized to resume.\n\n[A] 113.3 Emergencies. Where an emergency exists, the\ncode official shall not be required to give a written notice\nprior to stopping the work.\n\n[A] 113.4 Failure to comply. Any person who shall\ncontinue any work after having been served with a stop work\norder, except such work as that person is directed to perform\nto remove a violation or unsafe condition, shall be subject to\nfines established by the authority having jurisdiction.\n\nSECTION 114\nMEANS OF APPEALS\n\n[A] 114.1 General. In order to hear and decide appeals of\norders, decisions or determinations made by the code official\nrelative to the application and interpretation of this code,\nthere shall be and is hereby created a board of appeals. The\nboard of appeals shall be appointed by the applicable\ngoverning authority and shall hold office at its pleasure. The\nboard shall adopt rules of procedure for conducting its busi-\nness and shall render all decisions and findings in writing to\nthe appellant with a duplicate copy to the code official.\n\n[A] 114.2 Limitations on authority. An application for\nappeal shall be based on a claim that the true intent of this\ncode or the rules legally adopted thereunder have been incor-\nrectly interpreted, the provisions of this code do not fully\napply, or an equivalent or better form of construction is\nproposed. The board shall not have authority to waive\nrequirements of this code or interpret the administration of\nthis code.\n\n2k\n"
    },
    {
        "page": 25,
        "text": "2k\n\nSCOPE AND ADMINISTRATION\n\n[A] 114.3 Qualifications. The board of appeals shall consist\nof members who are qualified by experience and training\nand are not employees of the jurisdiction.\n\n[A] 114.4 Administration. The code official shall take\nimmediate action in accordance with the decision of the\nboard.\n\nSECTION 115\nVIOLATIONS\n\n[A] 115.1 Unlawful acts. It shall be unlawful for any person,\nfirm or corporation to erect, construct, alter, repair, remove,\ndemolish or utilize any plumbing system, or cause same to\nbe done, in conflict with or in violation of any of the provi-\nsions of this code.\n\n[A] 115.2 Notice of violation. The code official shall serve a\nnotice of violation or order to the person responsible for the\nerection, installation, alteration, extension, repair, removal\nor demolition of plumbing work in violation of the provi-\nsions of this code, or in violation of a detail statement or the\napproved construction documents thereunder, or in violation\nof a permit or certificate issued under the provisions of this\ncode. Such order shall direct the discontinuance of the illegal\naction or condition and the abatement of the violation.\n\n[A] 115.3 Prosecution of violation. If the notice of violation\nis not complied with promptly, the code official shall request\nthe legal counsel of the jurisdiction to institute the appropri-\nate proceeding at law or in equity to restrain, correct or abate\nsuch violation, or to require the removal or termination of\nthe unlawful occupancy of the structure in violation of the\nprovisions of this code or of the order or direction made\npursuant thereto.\n\n[A] 115.4 Violation penalties. Any person who shall violate\na provision of this code or shall fail to comply with any of\nthe requirements thereof or who shall erect, install, alter or\nrepair plumbing work in violation of the approved construc-\ntion documents or directive of the code official, or of a\npermit or certificate issued under the provisions of this code,\nshall be guilty of a [SPECIFY OFFENSE], punishable by a fine\nof not more than [AMOUNT] dollars or by imprisonment not\nexceeding [NUMBER OF DAYS], or both such fine and impris-\nonment. Each day that a violation continues after due notice\nhas been served shall be deemed a separate offense.\n\n[A] 115.5 Abatement of violation. The imposition of the\npenalties herein prescribed shall not preclude the legal offi-\ncer of the jurisdiction from instituting appropriate action to\nprevent unlawful construction or to restrain, correct or abate\na violation, or to prevent illegal occupancy of a building,\nstructure or premises, or to stop an illegal act, conduct, busi-\nness or utilization of the plumbing on or about any premises.\n\n[A] 115.6 Unsafe plumbing. Any plumbing regulated by\nthis code that is unsafe or that constitutes a fire or health\nhazard, insanitary condition, or is otherwise dangerous to\nhuman life is hereby declared unsafe. Any use of plumbing\nregulated by this code constituting a hazard to safety, health\nor public welfare by reason of inadequate maintenance,\ndilapidation, obsolescence, fire hazard, disaster, damage or\nabandonment is hereby declared an unsafe use. Any such\n\n1-8\n\nunsafe equipment is hereby declared to be a public nuisance\nand shall be abated by repair, rehabilitation, demolition or\nremoval.\n\n[A] 115.6.1 Authority to condemn equipment. Where\nthe code official determines that any plumbing, or portion\nthereof, regulated by this code has become hazardous to\nlife, health or property or has become unsanitary, the code\nofficial shall order in writing that such plumbing either be\nremoved or restored to a safe or sanitary condition. A\ntime limit for compliance with such order shall be speci-\nfied in the written notice. A person shall not use or\nmaintain defective plumbing after receiving such notice.\n\nWhere such plumbing is to be disconnected, written\nnotice as prescribed in Section 115.2 shall be given. In\ncases of immediate danger to life or property, such\ndisconnection shall be made immediately without such\nnotice.\n\n[A] 115.6.2 Authority to disconnect service utilities.\nThe code official shall have the authority to authorize\ndisconnection of utility service to the building, structure\nor system regulated by the technical codes in case of an\nemergency, where necessary, to eliminate an immediate\ndanger to life or property. Where possible, the owner or\nthe owner’s authorized agent and occupant of the build-\ning, structure or service system shall be notified of the\ndecision to disconnect utility service prior to taking such\naction. If not notified prior to disconnecting, the owner,\nthe owner’s authorized agent or occupant of the building,\nstructure or service systems shall be notified in writing, as\nsoon as practical thereafter.\n\n[A] 115.6.3 Connection after order to disconnect. A\nperson shall not make connections from any energy, fuel,\npower supply or water distribution system or supply\nenergy, fuel or water to any equipment regulated by this\ncode that has been disconnected or ordered to be discon-\nnected by the code official or the use of which has been\nordered to be discontinued by the code official until the\ncode official authorizes the reconnection and use of such\nequipment.\n\nWhere any plumbing is maintained in violation of this\ncode, and in violation of any notice issued pursuant to the\nprovisions of this section, the code official shall institute\nany appropriate action to prevent, restrain, correct or\nabate the violation.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 26,
        "text": "CHAPTER 2\nDEFINITIONS\n\nUser note:\n\nAbout this chapter: Codes, by their very nature, are technical documents. Every word, term and punctuation mark can add to or change\nthe meaning of a technical requirement. It is necessary to maintain a consensus on the specific meaning of each term contained in the\ncode. Chapter 2 performs this function by stating clearly what specific terms mean for the purpose of the code.\n\nSECTION 201\nGENERAL\n\n201.1 Scope. Unless otherwise expressly stated, the follow-\ning words and terms shall, for the purposes of this code, have\nthe meanings shown in this chapter.\n\n201.2 Interchangeability. Words stated in the present tense\ninclude the future; words stated in the masculine gender\ninclude the feminine and neuter; the singular number\nincludes the plural and the plural the singular.\n\n201.3 Terms defined in other codes. Where terms are not\ndefined in this code and are defined in the Jnternational\nBuilding Code, International Fire Code, International Fuel\nGas Code or the International Mechanical Code, such terms\nshall have the meanings ascribed to them as in those codes.\n\n201.4 Terms not defined. Where terms are not defined\nthrough the methods authorized by this section, such terms\nshall have ordinarily accepted meanings such as the context\nimplies.\n\nSECTION 202\n\nGENERAL DEFINITIONS\nACCEPTED ENGINEERING PRACTICE. That which\nconforms to accepted principles, tests or standards of nation-\nally recognized technical or scientific authorities.\n[M] ACCESS (TO). That which enables a fixture, appliance\nor equipment to be reached by ready access or by a means\nthat first requires the removal or movement of a panel, door\nor similar obstruction (see “Ready access’’).\nACCESS COVER. A removable plate, usually secured by\nbolts or screws, to permit access to a pipe or pipe fitting for\nthe purposes of inspection, repair or cleaning.\n[BE] ACCESSIBLE. A site, building, facility or portion\nthereof that complies with Chapter 11 of the /nternational\nBuilding Code.\nADAPTER FITTING. An approved connecting device that\nsuitably and properly joins or adjusts pipes and fittings that\ndo not otherwise fit together.\nAIR ADMITTANCE VALVE. One-way valve designed to\nallow air to enter the plumbing drainage system when nega-\ntive pressures develop in the piping system. The device shall\nclose by gravity and seal the vent terminal at zero differential\n\n2021 INTERNATIONAL PLUMBING CODE®\n\npressure (no-flow conditions) and under positive internal\npressures. The purpose of an air admittance valve is to\nprovide a method of allowing air to enter the plumbing drain-\nage system without the use of a vent extended to open air and\nto prevent sewer gases from escaping into a building.\n\nAIR BREAK (Drainage System). A piping arrangement in\nwhich a drain from a fixture, appliance or device discharges\nindirectly into another fixture, receptacle or interceptor at a\npoint below the flood level rim and above the trap seal.\n\nAIR GAP (Drainage System). The unobstructed vertical\ndistance through the free atmosphere between the outlet of\nthe waste pipe and the flood level rim of the receptacle into\nwhich the waste pipe is discharging.\n\nAIR GAP (Water Distribution System). The unobstructed\nvertical distance through the free atmosphere between the\nlowest opening from any pipe or faucet supplying water to a\ntank, plumbing fixture or other device and the flood level rim\nof the receptacle.\n\nALTERNATE ON-SITE NONPOTABLE WATER.\nNonpotable water from other than public utilities, on-site\nsurface sources and subsurface natural freshwater sources.\nExamples of such water are graywater, on-site reclaimed\nwater, collected rainwater, captured condensate and rejected\nwater from reverse osmosis systems.\n\nALTERNATIVE ENGINEERED DESIGN. A plumbing\nsystem that performs in accordance with the intent of Chap-\nters 3 through 14 and provides an equivalent level of\nperformance for the protection of public health, safety and\nwelfare. The system design is not specifically regulated by\nChapters 3 through 14.\n\nANCHORS. See “Supports.”\n\nANTISIPHON. A term applied to valves or mechanical\ndevices that eliminate siphonage.\n\n[A] APPROVED. Acceptable to the code official.\n\n[A] APPROVED AGENCY. An established and recognized\nagency that is regularly engaged in conducting tests or\nfurnishing inspection services, or furnishing product certifi-\ncation where such agency has been approved by the code\nofficial.\n\nAREA DRAIN. A receptacle designed to collect surface or\nstorm water from an open area.\n\n2-1\n"
    },
    {
        "page": 27,
        "text": "DEFINITIONS\n\nBACKFLOW. Pressure created by any means in the water\ndistribution system, which by being in excess of the pressure\nin the water supply mains causes a potential backflow\ncondition.\n\nBackpressure, low head. A pressure less than or equal to\n4.33 psi (29.88 kPa) or the pressure exerted by a 10-foot\n(3048 mm) column of water.\n\nBacksiphonage. The backflow of potentially contami-\nnated water into the potable water system as a result of the\npressure in the potable water system falling below atmo-\nspheric pressure of the plumbing fixtures, pools, tanks or\nvats connected to the potable water distribution piping.\n\nWater supply system. The flow of water or other liquids,\nmixtures or substances into the distribution pipes of a\npotable water supply from any source except the intended\nsource.\n\nBACKFLOW, DRAINAGE. A reversal of flow in the\ndrainage system.\n\nBACKFLOW CONNECTION. Any arrangement whereby\nbackflow is possible.\n\nBACKFLOW PREVENTER. A backflow prevention\nassembly, a backflow prevention device or other means or\nmethod to prevent backflow into the potable water supply.\n\nBACKWATER VALVE. A device or valve installed in the\nbuilding drain or sewer pipe where a sewer is subject to back-\nflow, and that prevents drainage or waste from backing up\ninto a lower level or fixtures and causing a flooding\ncondition.\n\n[BS] BASE FLOOD ELEVATION. A reference point,\ndetermined in accordance with the building code, based on\nthe depth or peak elevation of flooding, including wave\nheight, which has a 1-percent (100-year flood) or greater\nchance of occurring in any given year.\n\nBATHROOM GROUP. A group of fixtures consisting of a\nwater closet, lavatory, bathtub or shower, including or\nexcluding a bidet, an emergency floor drain or both. Such\nfixtures are located together on the same floor level.\nBRANCH. Any partof the piping system except a riser, main\nor stack.\n\nBRANCH INTERVAL. A_ vertical measurement of\ndistance, 8 feet (2438 mm) or more in developed length,\nbetween the connections of horizontal branches to a drainage\nstack. Measurements are taken down the stack from the high-\nest horizontal branch connection.\n\nBRANCH VENT. A vent connecting one or more individual\nvents with a vent stack or stack vent.\n\n[A] BUILDING. Any structure utilized or intended for\nsupporting or sheltering any occupancy.\n\nBUILDING DRAIN. That part of the lowest piping of a\ndrainage system that receives the discharge from soil, waste\nand other drainage pipes inside and that extends 30 inches\n\n2-2\n\n(762 mm) in developed length of pipe beyond the exterior\nwalls of the building and conveys the drainage to the building\nsewer.\n\nCombined. A building drain that conveys both sewage\nand storm water or other drainage.\n\nSanitary. A building drain that conveys sewage only.\n\nStorm. A building drain that conveys storm water or other\ndrainage, but not sewage.\nBUILDING SEWER. That part of the drainage system that\nextends from the end of the building drain and conveys the\ndischarge to a public sewer, private sewer, individual sewage\ndisposal system or other point of disposal.\nCombined. A building sewer that conveys both sewage\nand storm water or other drainage.\n\nSanitary. A building sewer that conveys sewage only.\n\nStorm. A building sewer that conveys storm water or\nother drainage, but not sewage.\n\nBUILDING SUBDRAIN. That portion of a drainage system\nthat does not drain by gravity into the building sewer.\n\nBUILDING TRAP. A device, fitting or assembly of fittings\ninstalled in the building drain to prevent circulation of air\nbetween the drainage system of the building and the building\nsewer.\n\nCIRCUIT VENT. A vent that connects to a horizontal drain-\nage branch and vents two traps to not more than eight traps or\ntrapped fixtures connected into a battery.\n\nCIRCULATING HOT WATER SYSTEM. A specifically\ndesigned water distribution system where one or more pumps\nare operated in the service hot water piping to circulate heated\nwater from the water-heating equipment to fixture supply and\nback to the water-heating equipment.\n\nCISTERN. A small covered tank for storing water for a\nhome or farm. Generally, this tank stores rainwater to be\nutilized for purposes other than in the potable water supply,\nand such tank is placed underground in most cases.\n\nCLEANOUT. An access opening in the drainage system\nutilized for the removal of obstructions. Types of cleanouts\ninclude a removable plug or cap, and a removable fixture or\nfixture trap.\n\n[A] CODE. These regulations, subsequent amendments\nthereto or any emergency rule or regulation that the adminis-\ntrative authority having jurisdiction has lawfully adopted.\n\n[A] CODE OFFICIAL. The officer or other designated\nauthority charged with the administration and enforcement of\nthis code, or a duly authorized representative.\nCOLLECTION PIPE. Unpressurized pipe used within the\ncollection system that drains on-site nonpotable water or rain-\nwater to a storage tank by gravity.\n\nCOMBINATION FIXTURE. A fixture combining one sink\n\nand laundry tray or a two- or three-compartment sink or laun-\ndry tray in one unit.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 28,
        "text": "COMBINATION WASTE AND VENT SYSTEM. A\nspecially designed system of waste piping embodying the\nhorizontal wet venting of one or more sinks, lavatories, drink-\ning fountains or floor drains by means of a common waste\nand vent pipe adequately sized to provide free movement of\nair above the flow line of the drain.\n\nCOMBINED BUILDING DRAIN. See “Building drain,\ncombined.”\n\nCOMBINED BUILDING SEWER. See “Building sewer,\ncombined.”\n\nCOMMON VENT. A vent connecting at the junction of two\nfixture drains or to a fixture branch and serving as a vent for\nboth fixtures.\n\nCONCEALED FOULING SURFACE. Any surface of a\nplumbing fixture that is not readily visible and is not scoured\nor cleansed with each fixture operation.\n\nCONDUCTOR. A pipe inside the building that conveys\nstorm water from the roof to a storm or combined building\ndrain.\n\n[A] CONSTRUCTION DOCUMENT. All of the written,\ngraphic and pictorial documents prepared or assembled for\ndescribing the design, location and physical characteristics of\nthe elements of the project necessary for obtaining a building\npermit. The construction drawings shall be drawn to an\nappropriate scale.\n\nCONTAMINATION. An impairment of the quality of the\npotable water that creates an actual hazard to the public health\nthrough poisoning or the spread of disease by sewage, indus-\ntrial fluids or waste.\n\nCOPPER ALLOY. A metal alloy where the principle\ncomponent is copper.\n\nCRITICAL LEVEL (C-L). An elevation (height) reference\npoint that determines the minimum height at which a back-\nflow preventer or vacuum breaker is installed above the flood\nlevel rim of the fixture or receptor served by the device. The\ncritical level is the elevation level below which there is a\npotential for backflow to occur. If the critical level marking is\nnot indicated on the device, the bottom of the device shall\nconstitute the critical level.\n\nCROSS CONNECTION. Any physical connection or\narrangement between two otherwise separate piping systems,\none of which contains potable water andthe other either water\nof unknown or questionable safety or steam, gas or chemical,\nwhereby there exists the possibility for flow from one system\nto the other, with the direction of flow depending on the pres-\nsure differential between the two systems (see “Backflow”).\nDEMAND RECIRCULATION WATER SYSTEM. A\nwater distribution system where one or more pumps prime the\nservice hot water piping with heated water upon a demand for\nhot water.\n\nDEPTH OF TRAP SEAL. The depth of liquid that would\nhave to be removed from a full trap before air could pass\nthrough the trap.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nDEFINITIONS\n\n[BS] DESIGN FLOOD ELEVATION. The elevation of the\n“design flood,” including wave height, relative to the datum\nspecified on the community’s legally designated flood hazard\nmap. In areas designated as Zone AO, the design flood eleva-\ntion shall be the elevation of the highest existing grade of the\nbuilding’s perimeter plus the depth number (in feet) (mm)\nspecified on the flood hazard map. In areas designated as Zone\nAO where a depth number is not specified on the map, the\ndepth number shall be taken as being equal to 2 feet (610 mm).\n\nDEVELOPED LENGTH. The length of a pipeline\nmeasured along the centerline of the pipe and fittings.\n\nDISCHARGE PIPE. A pipe that conveys the discharge from\nplumbing fixtures or appliances.\n\nDRAIN. Any pipe that carries wastewater or waterborne\nwastes in a building drainage system.\n\nDRAINAGE FITTING. The type of fitting or fittings\nutilized in the drainage system. Drainage fittings are similar\nto cast-iron fittings, except that instead of having a bell and\nspigot, drainage fittings are recessed and tapped to eliminate\nridges on the inside of the installed pipe.\n\nDRAINAGE FIXTURE UNIT.\n\nDrainage (dfu). A measure of the probable discharge into\nthe drainage system by various types of plumbing fixtures.\nThe drainage fixture-unit value for a particular fixture\ndepends on its volume rate of drainage discharge, on the\ntime duration of a single drainage operation and on the\naverage time between successive operations.\n\nDRAINAGE SYSTEM. Piping within a public or private\npremise that conveys sewage, rainwater or other liquid waste\nto a point of disposal. A drainage system does not include the\nmains of a public sewer system or a private or public sewage\ntreatment or disposal plant.\n\nBuilding gravity. A drainage system that drains by grav-\nity into the building sewer.\n\nSanitary. A drainage system that carries sewage and\nexcludes storm, surface and ground water.\n\nStorm. A drainage system that carries rainwater, surface\nwater, subsurface water and similar liquid waste.\n\nDRINKING FOUNTAIN. A plumbing fixture that is\nconnected to the potable water distribution system and the\ndrainage system. The fixture allows the user to obtain a drink\ndirectly from a stream of flowing water without the use of any\naccessories.\n\nDUAL FLUSHING DEVICE. A feature that allows the user\nto flush a water closet with either a reduced or full volume of\nwater, depending on bowl contents.\n\nEFFECTIVE OPENING. The minimum cross-sectional\narea at the point of water supply discharge, measured or\nexpressed in terms of the diameter of a circle or, if the open-\ning is not circular, the diameter of a circle of equivalent cross-\nsectional area. For faucets and similar fittings, the effective\nopening shall be measured at the smallest orifice in the fitting\nbody or in the supply piping to the fitting.\n\n2-3\n"
    },
    {
        "page": 29,
        "text": "DEFINITIONS\n\nEMERGENCY FLOOR DRAIN. A floor drain that does\nnot receive the discharge of any drain or indirect waste pipe,\nand that protects against damage from accidental spills,\nfixture overflows and leakage.\n\nESSENTIALLY NONTOXIC TRANSFER FLUID.\nFluids having a Gosselin rating of 1, including propylene\nglycol; mineral oil; polydimethylsiloxane; hydrochlorofluo-\nrocarbon, chlorofluorocarbon and carbon refrigerants; and\nFDA-approved boiler water additives for steam boilers.\n\nESSENTIALLY TOXIC TRANSFER FLUID. Soil, waste\nor graywater and fluids having a Gosselin rating of 2 or more,\nincluding ethylene glycol, hydrocarbon oils, ammonia refrig-\nerants and hydrazine.\n\nEXISTING INSTALLATION. Any plumbing system regu-\nlated by this code that was legally installed prior to the\neffective date of this code, or for which a permit to install has\nbeen issued.\n\nFAUCET. A valve end of a water pipe through which water\nis drawn from or held within the pipe.\n\nFILL VALVE. A water supply valve, opened or closed by\nmeans of a float or similar device, utilized to supply water to\natank. An antisiphon fill valve contains an antisiphon device\nin the form of an approved air gap or vacuum breaker that is\nan integral part of the fill valve unit and that is positioned on\nthe discharge side of the water supply control valve.\n\nFIXTURE. See “Plumbing fixture.”\n\nFIXTURE BRANCH. A drain serving two or more fixtures\nthat discharges to another drain or to a stack.\n\nFIXTURE DRAIN. The drain from the trap of a fixture to a\n\njunction with any other drain pipe.\n\nFIXTURE FITTING.\nSupply fitting. A fitting that controls the volume, direc-\ntion of flow or both of water, and is either attached to or\n\naccessed from a fixture, or is used with an open or atmo-\nspheric discharge.\n\nWaste fitting. A combination of components that conveys\nthe sanitary waste from the outlet of a fixture to the\nconnection to the sanitary drainage system.\nFIXTURE SUPPLY. The water supply pipe connecting a\nfixture to a branch water supply pipe or directly to a main\nwater supply pipe.\n[BS] FLOOD HAZARD AREA. The greater of the follow-\ning two areas:\n1. The area within a flood plain subject to a 1-percent or\ngreater chance of flooding in any given year.\n2. The area designated as a flood hazard area on a\ncommunity’s flood hazard map or as otherwise\nlegally designated.\n\nFLOOD LEVEL RIM. The edge of the receptacle from\nwhich water overflows.\n\n2-4\n\nFLOW CONTROL (Vented). A device installed upstream\nfrom the interceptor having an orifice that controls the rate of\nflow through the interceptor and an air intake (vent) down-\nstream from the orifice that allows air to be drawn into the\nflow stream.\n\nFLOW PRESSURE. The pressure in the water supply pipe\nnear the faucet or water outlet while the faucet or water outlet\nis wide open and flowing.\n\nFLUSH TANK. A tank designed with a fill valve and flush\nvalve to flush the contents of the bowl or usable portion of the\nfixture.\n\nFLUSHOMETER TANK. A device integrated within an air\naccumulator vessel that is designed to discharge a predeter-\nmined quantity of water to fixtures for flushing purposes.\n\nFLUSHOMETER VALVE. A valve attached to a pressur-\nized water supply pipe and designed so that when activated,\nthe valve opens the line for direct flow into the fixture at a rate\nand quantity to operate the fixture properly, and then gradu-\nally closes to reseal fixture traps and avoid water hammer.\n\nFULL-OPEN VALVE. A water control or shutoff compo-\nnent in the water supply system piping that, where adjusted\nfor maximum flow, the flow path through the component’s\nclosure member is not a restriction in the component’s\nthrough-flow area.\n\nGRAYWATER. Waste discharged from lavatories, bath-\ntubs, showers, clothes washers and laundry trays.\n\nGREASE INTERCEPTOR.\n\nFats, oils and greases (FOG) disposal system. A plumb-\ning appurtenance that reduces nonpetroleum fats, oils and\ngreases in effluent by separation or mass and volume\nreduction.\n\nGravity. Plumbing appurtenances of not less than 500\ngallons (1893 L) capacity that are installed in the sanitary\ndrainage system to intercept free-floating fats, oils and\ngrease from wastewater discharge. Separation is accom-\nplished by gravity during a retention time of not less than\n30 minutes.\n\nHydromechanical. Plumbing appurtenances that are\ninstalled in the sanitary drainage system to intercept free-\nfloating fats, oils and grease from wastewater discharge.\nContinuous separation is accomplished by air entrainment,\nbuoyancy and interior baffling.\n\nGREASE REMOVAL DEVICE, AUTOMATIC (GRD).\nA plumbing appurtenance that is installed in the sanitary\ndrainage system to intercept free-floating fats, oils and grease\nfrom wastewater discharge. Such a device operates on a time-\nor event-controlled basis and has the ability to remove free-\nfloating fats, oils and grease automatically without interven-\ntion from the user except for maintenance.\n\nGREASE-LADEN WASTE. Effluent discharge that is\nproduced from food processing, food preparation or other\nsources where grease, fats and oils enter automatic dishwater\nprerinse stations, sinks or other appurtenances.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 30,
        "text": "GRIDDED WATER DISTRIBUTION SYSTEM. A water\ndistribution system where every water distribution pipe is\ninterconnected so as to provide two or more paths to each\nfixture supply pipe.\n\nGROUP WASH FIXTURE. A type of lavatory that allows\nmore than one person to utilize the fixture at the same time.\nThe fixture has one or more drains and one or more faucets.\n\nHANGERS. See “Supports.”\n\nHORIZONTAL BRANCH DRAIN. A drainage branch\npipe extending laterally from a soil or waste stack or building\ndrain, with or without vertical sections or branches, that\nreceives the discharge from two or more fixture drains or\nbranches and conducts the discharge to the soil or waste stack\nor to the building drain.\n\nHORIZONTAL PIPE. Any pipe or fitting that makes an\nangle of less than 45 degrees (0.79 rad) with a horizontal\nplane.\n\nHOT WATER. Water at a temperature greater than or equal\nto 110°F (43°C).\n\nHOUSE TRAP. See “Building trap.”\n\nINDIRECT WASTE PIPE. A waste pipe that does not\nconnect directly with the drainage system, but that discharges\ninto the drainage system through an air break or air gap into\na trap, fixture, receptor or interceptor.\n\nINDIVIDUAL SEWAGE DISPOSAL SYSTEM. A\nsystem for disposal of domestic sewage by means of a septic\ntank, cesspool or mechanical treatment, designed for utiliza-\ntion apart from a public sewer to serve a single establishment\nor building.\n\nINDIVIDUAL VENT. A pipe installed to vent a fixture trap\nand that connects with the vent system above the fixture\nserved or terminates in the open air.\n\nINDIVIDUAL WATER SUPPLY. A water supply that\nserves one or more families, and that is not an approved\npublic water supply.\n\nINTERCEPTOR. A device designed and installed to sepa-\nrate and retain for removal, by automatic or manual means,\ndeleterious, hazardous or undesirable matter from normal\nwastes, while permitting normal sewage or wastes to\ndischarge into the drainage system by gravity.\n\nJOINT.\n\nExpansion. A loop, return bend or return offset that\nprovides for the expansion and contraction in a piping\nsystem and is utilized in tall buildings or where there is a\nrapid change of temperature, as in power plants, steam\nrooms and similar occupancies.\n\nFlexible. Any joint between two pipes that permits one\npipe to be deflected or moved without movement or\ndeflection of the other pipe.\n\nMechanical. See “Mechanical joint.”\n\nSlip. A type of joint made by means of a washer or a\nspecial type of packing compound in which one pipe is\nslipped into the end of an adjacent pipe.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nDEFINITIONS\n\nLEADER. An exterior drainage pipe for conveying storm\nwater from roof or gutter drains to an approved means of\ndisposal.\n\nLEAD-FREE SOLDER AND FLUX. Containing not more\nthan 0.2-percent lead.\n\nMACERATING TOILET SYSTEM. An assembly consist-\ning of a water closet and sump with a macerating pump that\nis designed to collect, grind and pump wastes from the water\ncloset and up to two other fixtures connected to the sump.\n\nMAIN. The principal pipe artery to which branches are\nconnected.\n\nMANIFOLD. See “Plumbing appurtenance.”\n\n[M] MECHANICAL JOINT. A connection between pipes,\nfittings, or pipes and fittings that is not screwed, caulked,\nthreaded, soldered, solvent cemented, brazed, welded or heat\nfused. A joint in which compression is applied along the\ncenterline of the pieces being joined. In some applications,\nthe joint is part of a coupling, fitting or adapter.\n\nMEDICAL GAS SYSTEM. The complete system to convey\nmedical gases for direct patient application from central\nsupply systems (bulk tanks, manifolds and medical air\ncompressors), with pressure and operating controls, alarm\nwarning systems, related components and piping networks\nextending to station outlet valves at patient use points.\n\nMEDICAL VACUUM SYSTEM. A system consisting of\ncentral-vacuum-producing equipment with pressure and\noperating controls, shutoff valves, alarm-warning systems,\ngauges and a network of piping extending to and terminating\nwith suitable station inlets at locations where patient suction\nmay be required.\n\nMETER. A measuring device used to collect data and indi-\ncate water usage.\n\nNONPOTABLE WATER. Water not safe for drinking,\npersonal or culinary utilization.\n\nNUISANCE. Public nuisance as known in common law or in\nequity jurisprudence; whatever is dangerous to human life or\ndetrimental to health; whatever structure or premises is not\nsufficiently ventilated, sewered, drained, cleaned or lighted,\nwith respect to its intended occupancy; and whatever renders\nthe air, or human food, drink or water supply unwholesome.\n\n[A] OCCUPANCY. The purpose for which a building or\nportion thereof is utilized or occupied.\n\nOFFSET. A combination of approved bends that makes two\nchanges in direction bringing one section of the pipe out of\nline but into a line parallel with the other section.\n\nON-SITE NONPOTABLE WATER REUSE SYSTEM. A\nwater system for the collection, treatment, storage, distribu-\ntion and reuse of nonpotable water generated on site,\nincluding but not limited to a graywater system. This defini-\ntion does not include a rainwater harvesting system.\n\nOPEN AIR. Outside the structure.\n\nPLUMBING. The practice, materials and fixtures utilized in\nthe installation, maintenance, extension and alteration of all\npiping, fixtures, plumbing appliances and plumbing appurte-\n\n2-5\n"
    },
    {
        "page": 31,
        "text": "DEFINITIONS\n\nnances, within or adjacent to any structure, in connection with\nsanitary drainage or storm drainage facilities; venting\nsystems; and public or private water supply systems.\n\nPLUMBING APPLIANCE. Water or drain-connected\ndevices intended to perform a special function. These devices\nhave their operation or control dependent on one or more\nenergized components, such as motors, controls or heating\nelements. Such devices are manually adjusted or controlled\nby the owner or operator, or are operated automatically\nthrough one or more of the following actions: a time cycle, a\ntemperature range, a pressure range, a measured volume or\nweight.\n\nPLUMBING APPURTENANCE. A manufactured device,\nprefabricated assembly or on-the-job assembly of component\nparts that is an adjunct to the basic piping system and plumb-\ning fixtures. An appurtenance does not demand additional\nwater supply and does not add any discharge load to a fixture\nor to the drainage system.\n\nPLUMBING FIXTURE. A receptacle or device that is\nconnected to a water supply system or discharges to a drain-\nage system or both. Such receptacles or devices require a\nsupply of water; or discharge liquid waste or liquid-borne\nsolid waste; or require a supply of water and discharge waste\nto a drainage system.\n\nPLUMBING SYSTEM. A system that includes the water\ndistribution pipes; plumbing fixtures and traps; water-treating\nor water-using equipment; soil, waste and vent pipes; and\nbuilding drains; in addition to their respective connections,\ndevices and appurtenances within a structure or premises; and\nthe water service, building sewer and building storm sewer\nserving such structure or premises.\n\nPOLLUTION. An impairment of the quality of the potable\nwater to a degree that does not create a hazard to public health\nbut that does adversely and unreasonably affect the aesthetic\nqualities of such potable water for domestic use.\n\nPOTABLE WATER. Water free from impurities present in\namounts sufficient to cause disease or harmful physiological\neffects and conforming to the bacteriological and chemical\nquality requirements of the Public Health Service Drinking\nWater Standards or the regulations of the public health\nauthority having jurisdiction.\n\n[M] PRESS-CONNECT JOINT. A permanent mechanical\njoint incorporating an elastomeric seal or an elastomeric seal\nand corrosion-resistant grip ring. The joint is made with a\npressing tool and jaw or ring approved by the fitting\nmanufacturer.\n\nPRIVATE. In the classification of plumbing fixtures,\n“private” applies to fixtures that are not public.\n\nPUBLIC OR PUBLIC UTILIZATION. In the classifica-\ntion of plumbing fixtures, “public” applies to fixtures with\nunrestricted exposure to walk-in traffic.\nPUBLICSWIMMING POOL. A pool, other than a residen-\ntial pool, that is intended to be used for swimming or bathing\nand is operated by an owner, lessee, operator, licensee or\nconcessionaire, regardless of whether a fee is charged for use.\n\n2-6\n\nPUBLIC WATER MAIN. A water supply pipe for public\nutilization controlled by public authority.\n\nPUSH-FIT FITTING. A mechanical fitting that joins pipes\nor tubes and achieves a seal by mating the pipe or tube into\nthe fitting.\n\nQUICK-CLOSING VALVE. A valve or faucet that closes\nautomatically when released manually or that is controlled by\na mechanical means for fast-action closing.\n\nRAINWATER. Water from natural precipitation.\n\n[M] READY ACCESS. That which enables a fixture, appli-\nance or equipment to be directly reached without requiring\nthe removal or movement of any panel, door or similar\nobstruction and without the use of a portable ladder, step stool\nor similar device.\n\nRECLAIMED WATER. Nonpotable water that has been\nderived from the treatment of wastewater by a facility or\nsystem licensed or permitted to produce water meeting the\njurisdiction’s water requirements for its intended uses. Also\nknown as “recycled water.”\n\nREDUCED PRESSURE PRINCIPLE BACKFLOW\nPREVENTION ASSEMBLY. A backflow prevention\ndevice consisting of two independently acting check valves,\ninternally force-loaded to a normally closed position and\nseparated by an intermediate chamber (or zone) in which\nthere is an automatic relief means of venting to the atmo-\nsphere, internally loaded to a normally open position between\ntwo tightly closing shutoff valves and with a means for test-\ning for tightness of the checks and opening of the relief\nmeans.\n\n[A] REGISTERED DESIGN PROFESSIONAL. An indi-\nvidual who is registered or licensed to practice their\nrespective design profession, as defined by the statutory\nrequirements of the professional registration laws of the state\nor jurisdiction in which the project is to be constructed.\n\nRELIEF VALVE.\nPressure relief valve. A pressure-actuated valve held\nclosed by a spring or other means and designed to relieve\n\npressure automatically at the pressure at which such valve\nis set.\n\nTemperature and pressure relief (T&P) valve. A\ncombination relief valve designed to function as both a\ntemperature relief and a pressure relief valve.\n\nTemperature relief valve. A temperature-actuated valve\ndesigned to discharge automatically at the temperature at\nwhich such valve is set.\n\nRELIEF VENT. A vent whose primary function is to\nprovide circulation of air between drainage and vent systems.\n\nRIM. An unobstructed open edge of a fixture.\nRISER. See “Water pipe, riser.”\n\nROOF DRAIN. A drain installed to receive water collecting\non the surface of a roof and to discharge such water into a\nleader or a conductor.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 32,
        "text": "ROUGH-IN. Parts of the plumbing system that are installed\nprior to the installation of fixtures. This includes drainage,\nwater supply, vent piping and the necessary fixture supports\nand any fixtures that are built into the structure.\nSELF-CLOSING FAUCET. A faucet containing a valve\nthat automatically closes upon deactivation of the opening\nmeans.\n\nSEPARATOR. See “/nterceptor.”\n\nSEWAGE. Any liquid waste containing animal or vegetable\nmatter in suspension or solution, including liquids containing\nchemicals in solution.\n\nSEWAGE EJECTOR. A device for lifting sewage by\nentraining the sewage in a high-velocity jet of steam, air or\nwater.\nSEWER.\nBuilding sewer. See “Building sewer.”\nPublic sewer. That part of the drainage system of pipes,\ninstalled and maintained by a city, township, county,\npublic utility company or other public entity, and located\non public property, in the street or in an approved dedi-\ncated easement of public or community use.\nSanitary sewer. A sewer that carries sewage and excludes\nstorm, surface and ground water.\nStorm sewer. A sewer that conveys rainwater, surface\nwater, subsurface water and similar liquid wastes.\nSLOPE. The fall (pitch) of a line of pipe in reference to a\nhorizontal plane. In drainage, the slope is expressed as the fall\nin units vertical per units horizontal (percent) for a length of\npipe.\nSOIL PIPE. A pipe that conveys sewage containing fecal\nmatter to the building drain or building sewer.\nSPILLPROOF VACUUM BREAKER. An assembly\nconsisting of one check valve force-loaded closed and an air-\ninlet vent valve force-loaded open to atmosphere, positioned\ndownstream of the check valve, and located between and\nincluding two tightly closing shutoff valves and a test cock.\nSTACK. A general term for any vertical line of soil, waste,\nvent or inside conductor piping that extends through not\nfewer than one story with or without offsets.\nSTACK VENT. The extension of a soil or waste stack above\nthe highest horizontal drain connected to the stack.\nSTACK VENTING. A method of venting a fixture or\nfixtures through the soil or waste stack.\n\nSTORM DRAIN. See “Drainage system, storm.”\n\nSTORM WATER. Natural precipitation, including snow-\nmelt, that has contacted a surface at or below grade.\n\n[A] STRUCTURE. That which is built or constructed.\n\nSUBSOIL DRAIN. A drain that collects subsurface water or\nseepage water and conveys such water to a place of disposal.\n\nSUMP. A tank or pit that receives sewage or liquid waste,\nlocated below the normal grade of the gravity system and that\nmust be emptied by mechanical means.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nDEFINITIONS\n\nSUMP PUMP. An automatic water pump powered by an\nelectric motor for the removal of drainage, except raw\nsewage, from a sump, pit or low point.\n\nSUMP VENT. A vent from pneumatic sewage ejectors, or\nsimilar equipment, that terminates separately to the open air.\n\nSUPPORTS. Devices for supporting and securing pipe,\nfixtures and equipment.\n\nSWIMMING POOL. A permanent or temporary structure\nthat is intended to be used for swimming, bathing or wading\nand that is designed and manufactured or built to be\nconnected to a circulation system. A swimming pool can be\nopen to the public regardless of whether a fee is charged for\nits use or can be accessory to a residential setting where the\npool is available only to the household and guests of the\nhousehold.\n\nTEMPERED WATER. Water having a temperature range\nbetween 85°F (29°C) and 110°F (43°C).\n\nTHIRD-PARTY CERTIFICATION AGENCY. An\napproved agency operating a product or material certification\nsystem that incorporates initial product testing, assessment\nand surveillance of a manufacturer’s quality control system.\nTHIRD-PARTY CERTIFIED. Certification obtained by\nthe manufacturer indicating that the function and perfor-\nmance characteristics of a product or material have been\ndetermined by testing and ongoing surveillance by an\napproved third-party certification agency. Assertion of certi-\nfication is in the form of identification in accordance with the\nrequirements of the third-party certification agency.\nTOILET FACILITY. A room or space that contains not less\nthan one water closet and one lavatory.\n\nTRAP. A fitting or device that provides a liquid seal to\nprevent the emission of sewer gases without materially\naffecting the flow of sewage or wastewater through the trap.\nTRAP SEAL. The vertical distance between the weir and the\ntop of the dip of the trap.\n\nUNSTABLE GROUND. Earth that does not provide a\nuniform bearing for the barrel of the sewer pipe between the\njoints at the bottom of the pipe trench.\n\nVACUUM. Any pressure less than that exerted by the\natmosphere.\n\nVACUUM BREAKER. A type of backflow preventer\ninstalled on openings subject to normal atmospheric pressure\nthat prevents backflow by admitting atmospheric pressure\nthrough ports to the discharge side of the device.\n\nVENT PIPE. See “Vent system.”\n\nVENT STACK. A vertical vent pipe installed primarily for\nthe purpose of providing circulation of air to and from any\npart of the drainage system.\n\nVENT SYSTEM. A pipe or pipes installed to provide a flow\nof air to or from a drainage system, or to provide a circulation\nof air within such system to protect trap seals from siphonage\nand backpressure.\n\nVERTICAL PIPE. Any pipe or fitting that makes an angle\nof 45 degrees (0.79 rad) or more with the horizontal.\n\n2-7\n"
    },
    {
        "page": 33,
        "text": "DEFINITIONS\n\nWALL-HUNG WATER CLOSET. A wall-mounted water\ncloset installed in such a way that the fixture does not touch\nthe floor.\n\nWASTE. The discharge from any fixture, appliance, area or\nappurtenance that does not contain fecal matter.\n\nWASTE PIPE. A pipe that conveys only waste.\n\nWASTE RECEPTOR. A floor sink, standpipe, hub drain or\nfloor drain that receives the discharge of one or more indirect\nwaste pipes.\n\nWATER COOLER. A drinking fountain that incorporates a\nmeans of reducing the temperature of the water supplied to it\nfrom the potable water distribution system.\n\nWATER DISPENSER. A plumbing fixture that is manually\ncontrolled by the user for the purpose of dispensing potable\ndrinking water into a receptacle such as a cup, glass or bottle.\nSuch fixture is connected to the potable water distribution\nsystem of the premises.\n\n[M] WATER HEATER. Any heating appliance or equip-\nment that heats potable water and supplies such water to the\npotable hot water distribution system.\n\nWATER MAIN. A water supply pipe or system of pipes,\ninstalled and maintained by a city, township, county, public\nutility company or other public entity, on public property, in\nthe street or in an approved dedicated easement of public or\ncommunity use.\n\nWATER OUTLET. A discharge opening through which\nwater is supplied to a fixture, into the atmosphere (except into\nan open tank that is part of the water supply system), to a\nboiler or heating system, or to any devices or equipment that\nrequire water to operate but are not part of the plumbing\nsystem.\n\nWATER PIPE.\n\nRiser. A water supply pipe that extends one full story or\nmore to convey water to branches or to a group of fixtures.\n\nWater distribution pipe. A pipe within the structure or on\nthe premises that conveys water from the water service\npipe, or from the meter when the meter is at the structure,\nto the points of utilization.\nWater service pipe. The pipe from the water main or\nother source of potable water supply, or from the meter\nwhen the meter is at the public right of way, to the water\ndistribution system of the building served.\nWATER SUPPLY SYSTEM. The water service pipe, water\ndistribution pipes, and the necessary connecting pipes,\nfittings, control valves and all appurtenances in or adjacent to\nthe structure or premises.\nWATER-HAMMER ARRESTOR. A device utilized to\nabsorb the pressure surge (water hammer) that occurs when\nwater flow is suddenly stopped in a water supply system.\nWELL.\n\nBored. A well constructed by boring a hole in the ground\nwith an auger and installing a casing.\n\n2-8\n\nDrilled. A well constructed by making a hole in the\nground with a drilling machine of any type and installing\na casing and screen.\n\nDriven. A well constructed by driving a pipe in the\nground. The drive pipe is usually fitted with a well point\nand screen.\n\nDug. A well constructed by excavating a large-diameter\nshaft and installing a casing.\n\nWHIRLPOOL BATHTUB. A plumbing appliance consist-\ning of a bathtub fixture that is equipped and fitted with a\ncirculating piping system designed to accept, circulate and\ndischarge bathtub water upon each use.\n\nYOKE VENT. A pipe connecting upward from a soil or\nwaste stack to a vent stack for the purpose of preventing pres-\nsure changes in the stacks.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 34,
        "text": "CHAPTER 3\nGENERAL REGULATIONS\n\nUser note:\n\nAbout this chapter: Chapter 3 covers general regulations for plumbing installations. As many of these requirements would need to be\nrepeated in Chapters 3 through 14, placing such requirements in only one location eliminates code development coordination issues asso-\nciated with the same requirement in multiple locations. These general requirements can be superseded by more specific requirements for\n\ncertain applications in Chapters 3 through 14.\n\nSECTION 301\nGENERAL\n\n301.1 Scope. The provisions of this chapter shall govern the\ngeneral regulations regarding the installation of plumbing\nnot specific to other chapters.\n\n301.2 System installation. Plumbing shall be installed with\ndue regard to preservation of the strength of structural\nmembers and prevention of damage to walls and other\nsurfaces through fixture usage.\n\n301.3 Connections to drainage system. Plumbing fixtures,\ndrains, appurtenances and appliances used to receive or\ndischarge liquid waste or sewage shall be directly connected\nto the sanitary drainage system of the building or premises,\nin accordance with the requirements of this code. This\nsection shall not be construed to prevent indirect waste\nsystems required by Chapter 8.\n\nException: Bathtubs, showers, lavatories, clothes wash-\ners and laundry trays shall not be required to discharge to\nthe sanitary drainage system where such fixtures\ndischarge to an approved system in accordance with\nChapters 13 and 14.\n\n301.4 Connections to water supply. Every plumbing\nfixture, device or appliance requiring or using water for its\nproper operation shall be directly or indirectly connected to\nthe water supply system in accordance with the provisions of\nthis code.\n\n301.5 Pipe, tube and fitting sizes. Unless otherwise indi-\ncated, the pipe, tube and fitting sizes specified in this code\nare expressed in nominal or standard sizes as designated in\nthe referenced material standards.\n\n301.6 Prohibited locations. Plumbing systems shall not be\nlocated in an elevator shaft or in an elevator equipment\nroom.\n\nException: Floor drains, sumps and sump pumps shall be\npermitted at the base of the shaft, provided that they are\nindirectly connected to the plumbing system and comply\nwith Section 1003.4.\n\n301.7 Conflicts. In instances where conflicts occur between\nthis code and the manufacturer’s installation instructions, the\nmore restrictive provisions shall apply.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nSECTION 302\nEXCLUSION OF MATERIALS\nDETRIMENTAL TO THE SEWER SYSTEM\n\n302.1 Detrimental or dangerous materials. Ashes, cinders\nor rags; flammable, poisonous or explosive liquids or gases;\noil, grease or any other insoluble material capable of\nobstructing, damaging or overloading the building drainage\nor sewer system, or capable of interfering with the normal\noperation of the sewage treatment processes, shall not be\ndeposited, by any means, into such systems.\n\n302.2 Industrial wastes. Waste products from manufactur-\ning or industrial operations shall not be introduced into the\npublic sewer until it has been determined by the code official\nor other authority having jurisdiction that the introduction\nthereof will not damage the public sewer system or interfere\nwith the functioning of the sewage treatment plant.\n\nSECTION 303\nMATERIALS\n\n303.1 Identification. Each length of pipe and each pipe\nfitting, trap, fixture, material and device utilized in a plumb-\ning system shall bear the identification of the manufacturer\nand any markings required by the applicable referenced\nstandards.\n\n303.2 Installation of materials. Materials used shall be\ninstalled in strict accordance with the standards under which\nthe materials are accepted and approved. In the absence of\nsuch installation procedures, the manufacturer’s instructions\nshall be followed. Where the requirements of referenced\nstandards or manufacturer’s installation instructions do not\nconform to minimum provisions of this code, the provisions\nof this code shall apply.\n\n303.3 Plastic pipe, fittings and components. Plastic pipe,\nfittings and components shall be third-party certified as\nconforming to NSF 14.\n\n303.4 Third-party certification. Plumbing products and\nmaterials required by the code to be in compliance with a\nreferenced standard shall be listed by a third-party certifica-\ntion agency as complying with the referenced standards.\nProducts and materials shall be identified in accordance with\nSection 303.1.\n\n3-1\n"
    },
    {
        "page": 35,
        "text": "GENERAL REGULATIONS\n\n303.5 Cast-iron soil pipe, fittings and components. Cast-\niron soil pipes and fittings, and the couplings used to join\nthese products together, shall be third-party listed and\nlabeled. Third-party certifiers or inspectors shall comply\nwith the minimum inspection requirements of Annex A or\nAnnex A1 of the ASTM and CISPI product standards indi-\ncated in the code for such products.\n\nSECTION 304\nRODENTPROOFING\n\n304.1 General. Plumbing systems shall be designed and\ninstalled in accordance with Sections 304.2 through 304.4 to\nprevent rodents from entering structures.\n\n304.2 Strainer plates. Strainer plates on drain inlets shall be\ndesigned and installed so that all openings are not greater\nthan '/, inch (12.7 mm) in least dimension.\n\n304.3 Meter boxes. Meter boxes shall be constructed in such\na manner that rodents are prevented from entering a structure\nby way of the water service pipes connecting the meter box\nand the structure.\n\n304.4 Openings for pipes. In or on structures where open-\nings have been made in walls, floors or ceilings for the\npassage of pipes, the annular space between the pipe and the\nsides of the opening shall be sealed with caulking materials\nor closed with gasketing systems compatible with the piping\nmaterials and locations.\n\nSECTION 305\nPROTECTION OF PIPES AND\nPLUMBING SYSTEM COMPONENTS\n\n305.1 Protection against contact. Metallic piping, except\nfor cast iron, ductile iron and galvanized steel, shall not be\nplaced in direct contact with steel framing members,\nconcrete or cinder walls and floors or other masonry. Metal-\nlic piping shall not be placed in direct contact with corrosive\nsoil. Where sheathing is used to prevent direct contact, the\nsheathing shall have a thickness of not less than 0.008 inch\n(8 mil) (0.203 mm) and the sheathing shall be made of plas-\ntic. Where sheathing protects piping that penetrates concrete\nor masonry walls or floors, the sheathing shall be installed in\na manner that allows movement of the piping within the\nsheathing.\n\n305.2 Stress and strain. Piping in a plumbing system shall\nbe installed so as to prevent strains and stresses that exceed\nthe structural strength of the pipe. Where necessary, provi-\nsions shall be made to protect piping from damage resulting\nfrom expansion, contraction and structural settlement.\n\n305.3 Pipes through foundation walls. Any pipe that\npasses through a foundation wall shall be provided with a\nrelieving arch, or a pipe sleeve pipe shall be built into the\nfoundation wall. The sleeve shall be two pipe sizes greater\nthan the pipe passing through the wall.\n\n305.4 Freezing. Water, soil and waste pipes shall not be\ninstalled outside of a building, in attics or crawl spaces,\nconcealed in outside walls, or in any other place subjected to\n\n3-2\n\nfreezing temperatures unless adequate provision is made to\nprotect such pipes from freezing by insulation or heat or\nboth. Exterior water supply system piping shall be installed\nnot less than 6 inches (152 mm) below the frost line and not\nless than 12 inches (305 mm) below grade.\n\n305.4.1 Sewer depth. Building sewers that connect to\nprivate sewage disposal systems shall be installed not less\nthan [NUMBER] inches (mm) below finished grade at the\npoint of septic tank connection. Building sewers shall be\ninstalled not less than [NUMBER] inches (mm) below\ngrade.\n\n305.5 Waterproofing of openings. Joints at the roof and\naround vent pipes shall be made watertight by the use of\nlead, copper, galvanized steel, aluminum, plastic or other\napproved flashings or flashing material. Exterior wall open-\nings shall be made watertight.\n\n305.6 Protection against physical damage. In concealed\nlocations where piping, other than cast iron or galvanized\nsteel, is installed through holes or notches in studs, joists,\nrafters or similar members less than 1'/, inches (32 mm)\nfrom the nearest edge of the member, the pipe shall be\nprotected by steel shield plates. Such shield plates shall have\na thickness of not less than 0.0575 inch (1.463 mm) (No. 16\ngage). Such plates shall cover the area of the pipe where the\nmember is notched or bored, and shall extend not less than 2\ninches (51 mm) above sole plates and below top plates.\n\n305.7 Protection of components of plumbing system.\nComponents of a plumbing system installed along alley-\nways, driveways, parking garages or other locations exposed\nto damage shall be recessed into the wall or otherwise\nprotected in an approved manner.\n\nSECTION 306\nTRENCHING, EXCAVATION AND BACKFILL\n\n306.1 Support of piping. Buried piping shall be supported\nthroughout its entire length.\n\n306.2 Trenching and bedding. Where trenches are exca-\nvated such that the bottom of the trench forms the bed for the\npipe, solid and continuous load-bearing support shall be\nprovided between joints. Bell holes, hub holes and coupling\nholes shall be provided at points where the pipe is joined.\nSuch pipe shall not be supported on blocks to grade. In\ninstances where the material manufacturer’s installation\ninstructions are more restrictive than those prescribed by the\ncode, the material shall be installed in accordance with the\nmore restrictive requirement.\n\n306.2.1 Overexcavation. Where trenches are excavated\nbelow the installation level of the pipe such that the\nbottom of the trench does not form the bed for the pipe,\nthe trench shall be backfilled to the installation level of\nthe bottom of the pipe with sand or fine gravel placed in\nlayers not greater than 6 inches (152 mm) in depth and\nsuch backfill shall be compacted after each placement.\n\n306.2.2 Rock removal. Where rock is encountered in\ntrenching, the rock shall be removed to not less than 3\ninches (76 mm) below the installation level of the bottom\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 36,
        "text": "of the pipe, and the trench shall be backfilled to the instal-\nlation level of the bottom of the pipe with sand tamped in\nplace so as to provide uniform load-bearing support for\nthe pipe between joints. The pipe, including the joints,\nshall not rest on rock at any point.\n\n306.2.3 Soft load-bearing materials. If soft materials of\npoor load-bearing quality are found at the bottom of the\ntrench, stabilization shall be achieved by overexcavating\nnot less than two pipe diameters and backfilling to the\ninstallation level of the bottom of the pipe with fine\ngravel, crushed stone or a concrete foundation. The\nconcrete foundation shall be bedded with sand tamped\ninto place so as to provide uniform load-bearing support\nfor the pipe between joints.\n\n306.3 Backfilling. Backfill shall be free from discarded\nconstruction material and debris. Loose earth free from\nrocks, broken concrete and frozen chunks shall be placed in\nthe trench in 6-inch (152 mm) layers and tamped in place\nuntil the crown of the pipe is covered by 12 inches (305 mm)\nof tamped earth. The backfill under and beside the pipe shall\nbe compacted for pipe support. Backfill shall be brought up\nevenly on both sides of the pipe so that the pipe remains\naligned. In instances where the manufacturer’s instructions\nfor materials are more restrictive than those prescribed by\nthe code, the material shall be installed in accordance with\nthe more restrictive requirement.\n\n306.4 Tunneling. Where pipe is to be installed by tunneling,\njacking or a combination of both, the pipe shall be protected\nfrom damage during installation and from subsequent\nuneven loading. Where earth tunnels are used, adequate\nsupporting structures shall be provided to prevent future\nsettling or caving.\n\nSECTION 307\nSTRUCTURAL SAFETY\n\n307.1 General. In the process of installing or repairing any\npart of a plumbing and drainage installation, the finished\nfloors, walls, ceilings, tile work or any other part of the\nbuilding or premises that must be changed or replaced shall\nbe left in a safe structural condition in accordance with the\nrequirements of the /nternational Building Code.\n\n307.2 Cutting, notching or bored holes. A framing\nmember shall not be cut, notched or bored in excess of\nlimitations specified in the /nternational Building Code.\n\n307.3 Penetrations of floor/ceiling assemblies and fire-\nresistance-rated assemblies. Penetrations of floor/ceiling\nassemblies and assemblies required to have a fire-resistance\nrating shall be protected in accordance with the /nternational\nBuilding Code.\n\n[BS] 307.4 Alterations to trusses. Truss members and\ncomponents shall not be cut, drilled, notched, spliced or\notherwise altered in any way without written concurrence\nand approval of a registered design professional. Alterations\nresulting in the addition of loads to any member (such as\nHVAC equipment and water heaters) shall not be permitted\nwithout verification that the truss is capable of supporting\nsuch additional loading.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nGENERAL REGULATIONS\n\n307.5 Protection of footings. Trenching installed parallel to\nfootings and walls shall not extend into the bearing plane of\na footing or wall. The upper boundary of the bearing plane is\na line that extends downward, atan angle of 45 degrees (0.79\nrad) from horizontal, from the outside bottom edge of the\nfooting or wall.\n\n307.6 Piping materials exposed within plenums. Piping\nmaterials exposed within plenums shall comply with the\nprovisions of the /nternational Mechanical Code.\n\nSECTION 308\nPIPING SUPPORT\n\n308.1 General. Plumbing piping shall be supported in accor-\ndance with this section.\n\n308.2 Piping seismic supports. Where earthquake loads are\napplicable in accordance with the Jnternational Building\nCode, plumbing piping supports, anchorage, and bracing\nshall be designed and installed for seismic forces in accor-\ndance with Chapter 16 of the /nternational Building Code.\n\n308.3 Materials. Hangers, anchors and supports shall\nsupport the piping and the contents of the piping. Hangers\nand strapping material shall be of approved material that will\nnot promote galvanic action.\n\n308.4 Structural attachment. Hangers and anchors shall be\nattached to the building construction in an approved manner.\n\n308.5 Interval of support. Pipe shall be supported in accor-\ndance with Table 308.5.\n\nException: The interval of support for piping systems\ndesigned to provide for expansion/contraction shall\nconform to the engineered design in accordance with\nSection 316.1.\n\n308.6 Sway bracing. Where horizontal pipes 4 inches (102\nmm) and larger convey drainage or waste, and where a pipe\nfitting in that piping changes the flow direction greater than\n45 degrees (0.79 rad), rigid bracing or other rigid support\narrangements shall be installed to resist movement of the\nupstream pipe in the direction of pipe flow. A change of flow\ndirection into a vertical pipe shall not require the upstream\npipe to be braced.\n\n308.7 Anchorage. Anchorage shall be provided to restrain\ndrainage piping from axial movement.\n\n308.7.1 Location. For pipe sizes greater than 4 inches\n(102 mm), restraints shall be provided for drain pipes at\nall changes in direction and at all changes in diameter\ngreater than two pipe sizes. Braces, blocks, rodding and\nother suitable methods as specified by the coupling manu-\nfacturer shall be utilized.\n\n308.8 Expansion joint fittings. Expansion joint fittings\nshall be used only where necessary to provide for expansion\nand contraction of the pipes. Expansion joint fittings shall be\nof the typical material suitable for use with the type of piping\nin which such fittings are installed.\n\n308.9 Parallel water distribution systems. Piping bundles\nfor manifold systems shall be supported in accordance with\nTable 308.5. Support at changes in direction shall be in\n\n3-3\n"
    },
    {
        "page": 37,
        "text": "GENERAL REGULATIONS\n\naccordance with the manufacturer’s instructions. Where hot\nwater piping is bundled with cold water piping, hot water\npiping shall be insulated in accordance with Section 607.5.\n\n308.10 Thermal expansion tanks. A thermal expansion\ntank shall be supported in accordance with the manufac-\nturer’s instructions. Thermal expansion tanks shall not be\nsupported by the piping that connects to such tanks.\n\nSECTION 309\nFLOOD HAZARD RESISTANCE\n\n309.1 General. Plumbing systems and equipment in struc-\ntures erected in flood hazard areas shall be constructed in\naccordance with the requirements of this section and the\nInternational Building Code.\n\n[BS] 309.2 Flood hazard. For structures located in flood\nhazard areas, the following systems and equipment shall be\nlocated and installed as required by Section 1612 of the\nInternational Building Code.\n\n1. Water service pipes.\n\n2. Pump seals in individual water supply systems where\nthe pump is located below the design flood elevation.\n\n3. Covers on potable water wells shall be sealed, except\nwhere the top of the casing well or pipe sleeve is\nelevated to not less than 1 foot (305 mm) above the\ndesign flood elevation.\n\nSanitary drainage piping.\n\nStorm drainage piping.\n\nManhole covers shall be sealed, except where\nelevated to or above the design flood elevation.\n\nDawe\n\n7. Other plumbing fixtures, faucets, fixture fittings,\npiping systems and equipment.\n\n8. Water heaters.\n\n9. Vents and vent systems.\n\nException: The systems listed in this section are permit-\nted to be located below the elevation required by Section\n1612 of the International Building Code for utilities and\nattendant equipment, provided that the systems are\ndesigned and installed to prevent water from entering or\naccumulating within their components and the systems\nare constructed to resist hydrostatic and hydrodynamic\nloads and stresses, including the effects of buoyancy,\nduring the occurrence of flooding up to such elevation.\n\nTABLE 308.5\n\nPIPING MATERIAL\n\nHANGER SPACING\n\nMAXIMUM HORIZONTAL SPACING MAXIMUM VERTICAL SPACING\n\nwAcolonitrile butadiene styrene (ABS) pipe\n“ATaminum toon\nBrass pipe\n\nate .\nChlorinated polyvinyl chloride (CPVC) pipe and tubing, 1 inch and\n+ smaller\n\nChlorinated polyvinyl! chloride (CPVC) pipe and tubing, 1'/, inches and\n\nlarger\n\nCopper or copper-alloy pipe\n\nCopper or copper-alloy tubing, 1'/,-inch diameter and smaller\nCopper or copper-alloy tubing, 1'/,-inch diameter and larger\nCross-linked polyethylene (PEX) pipe, | inch and smaller\nCross-linked polyethylene (PEX) pipe, 1'/, inches and larger\n\nCross-linked polyethylene/aluminum/cross-linked polyethylene\n(PEX-AL-PEX) pipe\n\nLead pipe\nPolyethylene/aluminum/polyethylene (PE-AL-PE) pipe\n\nPolyethylene of raised temperature (PE-RT) pipe, | inch and smaller\nPolyethylene of raised temperature (PE-RT) pipe, 1'/, inches and larger\n\nPolypropylene (PP) pipe or tubing, | inch and smaller\nPolypropylene (PP) pipe or tubing, 1'/, inches and larger\n\nPolyvinyl chloride (PVC) pipe\nStainless steel drainage systems\n\nSteel pipe\n\nFor SI: 1 inch = 25.4 mm, | foot = 304.8 mm.\n\n(feet)_ __(feet)\n\nFF 10°\n\n= _—_— 15\n\n10 +0\n\nSe ss) 15\n\n, 3 o\na (i\n12 10\n\n6 10\n\n10 10\n\n2.67 (32 inches) 10°\n4 10°\n\n2.67 (32 inches) 4\n\nContinuous 4\n\n2.67 (32 inches) 4\n2.67 (32 inches) 10°\n4 10°\n\n2.67 (32 inches) 10°\n4 10°\n\n4 10°\n\n10 10°\n\n12 15\n\na. The maximum horizontal spacing of cast-iron pipe hangers shall be increased to 10 feet where 10-foot lengths of pipe are installed.\nb. For sizes 2 inches and smaller, a guide shall be installed midway between required vertical supports. Such guides shall prevent pipe movement in a direc-\n\ntion perpendicular to the axis of the pipe.\n\n3-4\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 38,
        "text": "[BS] 309.3 Coastal high-hazard areas and coastal A\nzones. Structures located in coastal high-hazard areas and\ncoastal A zones shall meet the requirements of Section\n309.2. The plumbing systems, pipes and fixtures shall not be\nmounted on or penetrate through walls intended to break\naway under flood loads.\n\nSECTION 310\nWASHROOM AND TOILET ROOM REQUIREMENTS\n\n310.1 Light and ventilation. Washrooms and toilet rooms\nshall be illuminated and ventilated in accordance with the\nInternational Building Code and International Mechanical\nCode.\n\n310.2 Location of fixtures and compartments. The loca-\ntion of plumbing fixtures and the requirements for\ncompartments and partitions shall be in accordance with\nSection 405.3.\n\n310.3 Interior finish. Interior finish surfaces of toilet rooms\nshall comply with the /nternational Building Code.\n\nSECTION 311\nTOILET FACILITIES FOR WORKERS\n\n311.1 General. Toilet facilities shall be provided for\nconstruction workers and such facilities shall be maintained\nin a sanitary condition. Construction worker toilet facilities\nof the nonsewer type shall conform to PSAI Z4.3.\n\nSECTION 312\nTESTS AND INSPECTIONS\n\n312.1 Required tests. The permit holder shall make the\napplicable tests prescribed in Sections 312.2 through 312.10\nto determine compliance with the provisions of this code.\nThe permit holder shall give reasonable advance notice to\nthe code official when the plumbing work is ready for tests.\nThe equipment, material, power and labor necessary for the\ninspection and test shall be furnished by the permit holder\nand he or she shall be responsible for determining that the\nwork will withstand the test pressure prescribed in the\nfollowing tests. Plumbing system piping shall be tested with\neither water or, for piping systems other than plastic, by air.\nAfter the plumbing fixtures have been set and their traps\nfilled with water, the entire drainage system shall be submit-\nted to final tests. The code official shall require the removal\nof any cleanouts if necessary to ascertain whether the pres-\nsure has reached all parts of the system.\n\n312.1.1 Test gauges. Gauges used for testing shall be as\nfollows:\n\n1. Tests requiring a pressure of 10 pounds per square\ninch (psi) (69 kPa) or less shall utilize a testing\ngauge having increments of 0.10 psi (0.69 kPa) or\nless.\n\n2. Tests requiring a pressure of greater than 10 psi\n(69 kPa) but less than or equal to 100 psi (689 kPa)\nshall utilize a testing gauge having increments of 1\npsi (6.9 kPa) or less.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nGENERAL REGULATIONS\n\n3. Tests requiring a pressure of greater than 100 psi\n(689 kPa) shall utilize a testing gauge having\nincrements of 2 psi (14 kPa) or less.\n\n312.2 Drainage and vent water test. A water test shall be\napplied to the drainage system either in its entirety or in\nsections. If applied to the entire system, all openings in the\npiping shall be tightly closed, except the highest opening,\nand the system shall be filled with water to the point of over-\nflow. If the system is tested in sections, each opening shall\nbe tightly plugged except the highest openings of the section\nunder test, and each section shall be filled with water, but\nsections shall not be tested with less than a 10-foot (3048\nmm) head of water. In testing successive sections, not less\nthan the upper 10 feet (3048 mm) of the next preceding\nsection shall be tested so that no joint or pipe in the building,\nexcept the uppermost 10 feet (3048 mm) of the system, shall\nhave been submitted to a test of less than a 10-foot (3048\nmm) head of water. This pressure shall be held for not less\nthan 15 minutes. The system shall then be tight at all points.\n\n312.3 Drainage and vent air test. Plastic piping shall not be\ntested using air. An air test shall be made by forcing air into\nthe system until there is a uniform gauge pressure of 5 psi\n(34.5 kPa) or sufficient to balance a 10-inch (254 mm)\ncolumn of mercury. This pressure shall be held for a test\nperiod of not less than 15 minutes. Any adjustments to the\ntest pressure required because of changes in ambient\ntemperatures or the seating of gaskets shall be made prior to\nthe beginning of the test period.\n\n312.4 Drainage and vent final test. The final test of the\ncompleted drainage and vent systems shall be visual and in\nsufficient detail to determine compliance with the provisions\nof this code. Where a smoke test is utilized, it shall be made\nby filling all traps with water and then introducing into the\nentire system a pungent, thick smoke produced by one or\nmore smoke machines. When the smoke appears at stack\nopenings on the roof, the stack openings shall be closed and\na pressure equivalent to a l-inch water column (248.8 Pa)\nshall be held for a test period of not less than 15 minutes.\n\n312.5 Water supply system test. Upon completion of a\nsection of or the entire water supply system, the system, or\nportion completed, shall be tested and proved tight under a\nwater pressure not less than the working pressure of the\nsystem; or, for piping systems other than plastic, by an air\ntest of not less than 50 psi (344 kPa). This pressure shall be\nheld for not less than 15 minutes. The water utilized for tests\nshall be obtained from a potable source of supply. The\nrequired tests shall be performed in accordance with this\nsection and Section 108.\n\n312.6 Gravity sewer test. Gravity sewer tests shall consist\nof plugging the end of the building sewer at the point of\nconnection with the public sewer, filling the building sewer\nwith water, testing with not less than a 10-foot (3048 mm)\nhead of water and maintaining such pressure for 15 minutes.\n\n312.7 Forced sewer test. Forced sewer tests shall consist of\nplugging the end of the building sewer at the point of\nconnection with the public sewer and applying a pressure of\n5 psi (34.5 kPa) greater than the pump rating, and maintain-\ning such pressure for 15 minutes.\n"
    },
    {
        "page": 39,
        "text": "GENERAL REGULATIONS\n\n312.8 Storm drainage system test. Storm drain systems\nwithin a building shall be tested by water or air in accor-\ndance with Section 312.2 or 312.3.\n\n312.9 Shower liner test. Where shower floors and receptors\nare made water tight by the application of materials required\nby Section 421.5.2, the completed liner installation shall be\ntested. The pipe from the shower drain shall be plugged\nwater tight for the test. The floor and receptor area shall be\nfilled with potable water to a depth of not less than 2 inches\n(51 mm) measured at the threshold. Where a threshold of 2\ninches (51 mm) high or greater does not exist, a temporary\nthreshold shall be constructed to retain the test water in the\nlined floor or receptor area to a level not less than 2 inches\n(51 mm) deep measured at the threshold. The water shall be\nretained for a test period of not less than 15 minutes, and\nthere shall not be evidence of leakage.\n\n312.10 Inspection and testing of backflow prevention\nassemblies. Inspection and testing shall comply with\nSections 312.10.1 and 312.10.2.\n\n312.10.1 Inspections. Annual inspections shall be made\nof all backflow prevention assemblies and air gaps to\ndetermine whether the assemblies are operable and air\ngaps exist.\n\n312.10.2 Testing. Reduced pressure principle, double\ncheck, pressure vacuum breaker, reduced pressure detec-\ntor fire protection, double check detector fire protection,\nand spill-resistant vacuum breaker backflow preventer\nassemblies and hose connection backflow preventers\nshall be tested at the time of installation, immediately\nafter repairs or relocation and at least annually. The test-\ning procedure shall be performed in accordance with one\nof the following standards: ASSE 5013, ASSE 5015,\nASSE 5020, ASSE 5047, ASSE 5048, ASSE 5052, ASSE\n5056, CSA B64.10 or CSA B64.10.1. Test gauges shall\ncomply with ASSE 1064.\n\nSECTION 313\nEQUIPMENT EFFICIENCIES\n\n313.1 General. Equipment efficiencies shall be in accor-\ndance with the /nternational Energy Conservation Code.\n\nSECTION 314\nCONDENSATE DISPOSAL\n\n[M] 314.1 Fuel-burning appliances. Liquid combustion\nbyproducts of condensing appliances shall be collected and\ndischarged to an approved plumbing fixture or disposal area\nin accordance with the manufacturer’s instructions. Conden-\nsate piping shall be of approved corrosion-resistant material\nand shall not be smaller than the drain connection on the\nappliance. Such piping shall maintain a horizontal slope in\nthe direction of discharge of not less than one-eighth unit\nvertical in 12 units horizontal (1-percent slope).\n\n[M] 314.1.1 Identification. The termination of concealed\ncondensate piping shall be marked to indicate whether the\npiping is connected to the primary or secondary drain.\n\n3-6\n\n[M] 314.2 Evaporators and cooling coils. Condensate drain\nsystems shall be provided for equipment and appliances\ncontaining evaporators or cooling coils. Condensate drain\nsystems shall be designed, constructed and installed in\naccordance with Sections 314.2.1 through 314.2.5.\n\n[M] 314.2.1 Condensate disposal. Condensate from all\ncooling coils and evaporators shall be conveyed from the\ndrain pan outlet to an approved place of disposal. Such\npiping shall maintain a horizontal slope in the direction of\ndischarge of not less than one-eighth unit vertical in 12\nunits horizontal (1-percent slope). Condensate shall not\ndischarge into a street, alley or other areas so as to cause a\nnuisance.\n\n[M] 314.2.1.1 Condesate discharge. Condensate\ndrains shall not directly connect to any plumbing\ndrain, waste or vent pipe. Condensate drains shall not\ndischarge into a plumbing fixture other than a floor\nsink, floor drain, trench drain, mop sink, hub drain,\nstandpipe, utility sink or laundry sink. Condensate\ndrain connections to a lavatory wye branch tailpiece or\nto a bathtub overflow pipe shall not be considered as\ndischarging to a plumbing fixture. Except where\ndischarging to grade outdoors, the point of discharge\nof condensate drains shall be located within the same\noccupancy, tenant space or dwelling unit as the source\nof the condensate.\n\n[M] 314.2.2 Drain pipe materials and sizes. Compo-\nnents of the condensate disposal system shall be ABS,\ncast-iron, copper and copper-alloy, CPVC, cross-linked\npolyethylene, galvanized steel, PE-RT, polyethylene,\npolypropylene, PVC, or PVDF pipe or tubing. Compo-\nnents shall be selected for the pressure and temperature\nrating of the installation. Joints and connections shall be\nmade in accordance with the applicable provisions of\nChapter 7 relative to the material type. Condensate waste\nand drain line size shall be not less than */,-inch (19.1\nmm) pipe size and shall not decrease in size from the\ndrain pan connection to the place of condensate disposal.\nWhere the drain pipes from more than one unit are mani-\nfolded together for condensate drainage, the pipe or\ntubing shall be sized in accordance with Table 314.2.2.\n\n[M] TABLE 314.2.2\nCONDENSATE DRAIN SIZING\n\n| equipmenticapaciry MINIMUM CONDENSATE\ninc!\nUp to 20 tons of refrigeration 37 inch\n\nOver 20 tons to 40 tons of refrigeration 1 inch\nOver 40 tons to 90 tons of refrigeration 1'/, inches\nOver 90 tons to 125 tons of refrigeration 1'/, inches\nOver 125 tons to 250 tons of refrigeration 2 inches\n\nFor SI: 1 inch = 25.4 mm, | ton of capacity = 3.517 kW.\n\n[M] 314.2.3 Auxiliary and secondary drain systems. In\naddition to the requirements of Section 314.2.1, where\ndamage to any building components could occur as a\nresult of overflow from the equipment primary conden-\nsate removal system, one of the following auxiliary\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 40,
        "text": "protection methods shall be provided for each cooling\ncoil or fuel-fired appliance that produces condensate:\n\n1. An auxiliary drain pan with a separate drain shall\nbe provided under the coils on which condensation\nwill occur. The auxiliary pan drain shall discharge\nto a conspicuous point of disposal to alert occu-\npants in the event of a stoppage of the primary\ndrain. The pan shall have a depth of not less than\n1'/, inches (38 mm), shall be not less than 3 inches\n(76 mm) larger than the unit or the coil dimensions\nin width and length, and shall be constructed of\ncorrosion-resistant material. Galvanized sheet\nmetal pans shall have a thickness of not less than\n0.0236-inch (0.6010 mm) (No. 24 gage) galva-\nnized sheet metal. Nonmetallic pans shall have a\nthickness of not less than 0.0625 inch (1.6 mm).\n\n2. A separate overflow drain line shall be connected\nto the drain pan provided with the equipment.\nSuch overflow drain shall discharge to a conspicu-\nous point of disposal to alert occupants in the\nevent of a stoppage of the primary drain. The over-\nflow drain line shall connect to the drain pan at a\nhigher level than the primary drain connection.\n\n3. An auxiliary drain pan without a separate drain\nline shall be provided under the coils on which\ncondensate will occur. Such pan shall be equipped\nwith a water-level detection device conforming to\nUL 508 that will shut off the equipment served\nprior to overflow of the pan. The auxiliary drain\npan shall be constructed in accordance with Item 1\nof this section.\n\n4. A water-level detection device conforming to UL\n508 shall be provided that will shut off the equip-\nment served in the event that the primary drain is\nblocked. The device shall be installed in the\nprimary drain line, the overflow drain line or in the\nequipment-supplied drain pan, located at a point\nhigher than the primary drain line connection and\nbelow the overflow rim of such pan.\n\nException: Fuel-fired appliances that automatically\nshut down operation in the event of a stoppage in the\ncondensate drainage system.\n\n[M] 314.2.3.1 Water-level monitoring devices. On\ndown-flow units and all other coils that do not have a\nsecondary drain or provisions to install a secondary or\nauxiliary drain pan, a water-level monitoring device\nshall be installed inside the primary drain pan. This\ndevice shall shut off the equipment served in the event\nthat the primary drain becomes restricted. Devices\ninstalled in the drain line shall not be permitted.\n\n[M] 314.2.3.2 Appliance, equipment and insulation\nin pans. Where appliances, equipment or insulation\nare subject to water damage when auxiliary drain pans\nfill such portions of the appliances, equipment and\ninsulation shall be installed above the flood level rim\nof the pan. Supports located inside of the pan to\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nGENERAL REGULATIONS\n\nsupport the appliance or equipment shall be water\nresistant and approved.\n\n[M] 314.2.3.3 Identification. The termination of\nconcealed condensate piping shall be marked to indi-\ncate whether the piping is connected to the primary or\nsecondary drain.\n\n[M] 314.2.4 Traps. Condensate drains shall be trapped as\nrequired by the equipment or appliance manufacturer.\n\n[M] 314.2.4.1 Ductless mini-split system traps.\nDuctless mini-split equipment that produces condensa-\ntion shall be provided with an in-line check valve\nlocated in the drain line or a trap.\n\n[M] 314.2.5 Drain line maintenance. Condensate drain\nlines shall be configured to permit the clearing of block-\nages and performance of maintenance without requiring\nthe drain line to be cut.\n\nSECTION 315\nPENETRATIONS\n\n315.1 Sealing of annular spaces. The annular space\nbetween the outside of a pipe and the inside of a pipe sleeve\nor between the outside of a pipe and an opening in a building\nenvelope wall, floor, or ceiling assembly penetrated by a\npipe shall be sealed in an approved manner with caulking\nmaterial, foam sealant or closed with a gasketing system.\nThe caulking material, foam sealant or gasketing system\nshall be designed for the conditions at the penetration loca-\ntion and shall be compatible with the pipe, sleeve and\nbuilding materials in contact with the sealing materials.\nAnnular spaces created by pipes penetrating fire-resistance-\nrated assemblies or membranes of such assemblies shall be\nsealed or closed in accordance with Section 714 of the /nter-\nnational Building Code.\n\nSECTION 316\nALTERNATIVE ENGINEERED DESIGN\n\n316.1 Alternative engineered design. The design, docu-\nmentation, inspection, testing and approval of an alternative\nengineered design plumbing system shall comply with\nSections 316.1.1 through 316.1.6.\n\n316.1.1 Design criteria. An alternative engineered\ndesign shall conform to the intent of the provisions of this\ncode and shall provide an equivalent level of quality,\nstrength, effectiveness, fire resistance, durability and\nsafety. Material, equipment or components shall be\ndesigned and installed in accordance with the manufac-\nturer’s instructions.\n\n316.1.2 Submittal. The registered design professional\nshall indicate on the permit application that the plumbing\nsystem is an alternative engineered design. The permit\nand permanent permit records shall indicate that an alter-\nnative engineered design was part of the approved\ninstallation.\n"
    },
    {
        "page": 41,
        "text": "GENERAL REGULATIONS\n\n316.1.3 Technical data. The registered design profes-\nsional shall submit sufficient technical data to\nsubstantiate the proposed alternative engineered design\nand to prove that the performance meets the intent of this\ncode.\n\n316.1.4 Construction documents. The registered design\nprofessional shall submit to the code official two\ncomplete sets of signed and sealed construction docu-\nments for the alternative engineered design. The\nconstruction documents shall include floor plans and a\nriser diagram of the work. Where appropriate, the\nconstruction documents shall indicate the direction of\nflow, all pipe sizes, grade of horizontal piping, loading\nand location of fixtures and appliances.\n\n316.1.5 Design approval. Where the code official deter-\nmines that the alternative engineered design conforms to\nthe intent of this code, the plumbing system shall be\napproved. If the alternative engineered design is not\napproved, the code official shall notify the registered\ndesign professional in writing, stating the reasons thereof.\n\n316.1.6 Inspection and testing. The alternative engi-\nneered design shall be tested and inspected in accordance\nwith the requirements of Sections 108 and 312.\n\n3-8\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 42,
        "text": "CHAPTER 4\nFIXTURES, FAUCETS AND FIXTURE FITTINGS\n\nUser note:\n\nAbout this chapter: Plumbing fixtures are required to be installed for nearly every building as toilet facilities (water closets and lavatories)\nare needed by the occupants of a building. Additional fixtures for washing, bathing and culinary purposes are also necessary where occu-\npants dwell in buildings. Chapter 4 specifies the minimum number and type of plumbing fixtures for buildings based on the description of\nuse of the building. Because fixture design and quality are paramount to ensure that plumbing fixtures operate properly, this chapter also\nspecifies numerous product and material standards for plumbing fixtures.\n\nSECTION 401\nGENERAL\n\n401.1 Scope. This chapter shall govern the materials, design\nand installation of plumbing fixtures, faucets and fixture\nfittings in accordance with the type of occupancy, and shall\nprovide for the minimum number of fixtures for various\ntypes of occupancies.\n\n401.2 Prohibited fixtures and connections. Water closets\nhaving a concealed trap seal or an unventilated space or\nhaving walls that are not thoroughly washed at each\ndischarge in accordance with ASME A112.19.2/CSA B45.1\nshall be prohibited. Any water closet that permits siphonage\nof the contents of the bowl back into the tank shall be prohib-\nited. Trough urinals shall be prohibited.\n\n401.3 Water conservation. The maximum water flow rates\nand flush volume for plumbing fixtures and fixture fittings\nshall comply with Section 604.4.\n\nSECTION 402\nFIXTURE MATERIALS\n\n402.1 Quality of fixtures. Plumbing fixtures shall be\nconstructed of approved materials, with smooth, impervious\nsurfaces, free from defects and concealed fouling surfaces,\nand shall conform to standards cited in this code. Porcelain\n\nenameled surfaces on plumbing fixtures shall be acid\nresistant.\n\n402.2 Materials for specialty fixtures. Materials for\nspecialty fixtures not otherwise covered in this code shall be\nof stainless steel, soapstone, chemical stoneware or plastic,\nor shall be lined with lead, copper-base alloy, nickel-copper\nalloy, corrosion-resistant steel or other material especially\nsuited to the application for which the fixture is intended.\n\n402.3 Sheet copper. Sheet copper for general applications\nshall conform to ASTM B152 and shall not weigh less than\n12 ounces per square foot (3.7 kg/m’).\n\n402.4 Sheet lead. Sheet lead for pans shall not weigh less\nthan 4 pounds per square foot (19.5 kg/m?) and shall be\ncoated with an asphalt paint or other approved coating.\n\nSECTION 403\nMINIMUM PLUMBING FACILITIES\n\n403.1 Minimum number of fixtures. Plumbing fixtures\nshall be provided in the minimum number as shown in Table\n403.1, based on the actual use of the building or space. Uses\nnot shown in Table 403.1 shall be considered individually by\nthe code official. The number of occupants shall be deter-\nmined by the /nternational Building Code.\n\nTABLE 403.1\nMINIMUM NUMBER OF REQUIRED PLUMBING FIXTURES? (See Sections 403.1.1 and 403.2)\n\n=—— - oy TER-CLOSETS —| DRINKING Ff = =\n= [ f SEE Seonon «24 MoM _ POUNTAN\nNECLASSIFICATION| ' DESCRIPTION ne = SHOWERS (SEE \"OTHER\n' EE LF (al SECTION =\n1 ; , ee - 410) om\nTheaters and other buildings 1\nfor the performing arts and 1 per 125 1 per 65 1 per 200 _— 1 per 500 service\nmotion pictures* sink\nNightclubs, bars, taverns, 1\n1 Assembly dance halls and buildings for 1 per 40 1 per 40 1 per 75 _— 1 per 500 service\nsimilar purposes* sink\n1\nRestaurants, banquet halls and . _ .\nfood courts! 1 per 75 1 per 75 1 per 200 1 per 500 service\nsink\n(continued)\n2021 INTERNATIONAL PLUMBING CODE® 4-1\n"
    },
    {
        "page": 43,
        "text": "FIXTURES, FAUCETS AND FIXTURE FITTINGS\n\nNO.\n\n| CLASSIFICATION,\n\nMINIMUM NUMBER OF REQUIRED PLUMBING FIXTURES? (See Sections 403.1.1 and 403.2)\n\noe |\n“\" poate SEE SECTION CC La.\n\nDESCRIPTION\n\noe oadielitelials\n\n(cont.)\n\n42\n\nee ee ee\n\nAssembly\n\nBusiness\n\nEducational\n\nFactory and\nindustrial\n\nInstitutional\n\n™ Casino gaming areas\n\nE. aim mee\nAuditoriums without\n\nTABLE 403.1—continued\n\n1 per 100 for the\nfirst 400 and 1 per\n250 for the 150 for the\nremainder remainder\nexceeding 400 = exceeding 400\n\n— oe —_—-\n\nTht TOT TT po\n=\n\nDRINKING I\nHl ms ee BATHTUBS! © FOUNTAIN:\nSHOWERS ! section -\n410)\n— —\n2: rt\n5 = =\n5 ‘i = & 1 per 1,000 ®\ni I\n\npermanent seating, art\nsteric, exhibition halls, | 1 per 125 | 1 per 65 | 1 per 200\n\n= museums, lecture halls,\n™ libraries, areades and\n\nELeymnasiu ms*\n\na\n\n™ Passenger verminak and\n\n‘ansportation facilities\n\n~ a\nPlaces of worship and other\n\n™ religious services’\n\nColiseums, arenas, skating\nrinks, pools and tennis\ncourts for indoor sporting\nevents and activities\n\nStadiums, amusement\nparks, bleachers and grand-\nstands for outdoor sporting\nevents and activities’\n\nBuildings for the\ntransaction of business,\nprofessional services, other\nservices involving\nmerchandise, of fice build-\nings, banks, ambulatory\ncare, light industrial and\nsimilar uses\n\nEducational facilities\n\nStructures in which occu-\npants are engaged in work\nfabricating, assembly or\nprocessing of products or\nmaterials\n\nCustodial care facilities\n\nMedical care recipients in\nhospitals and nursing\nhomes\n\nEmployees in hospitals and\nnursing homes?\n\nVisitors in hospitals and\nnursing homes\n\nPrisons?\n\nReformitories, detention\ncenters, and correctional\ncenters”\n\n1 500 1 500\ner er 5\np a p\n\n1 per 150 - 1 per 75\n-\n1 per 75 for the 1 per 40 for the\nfirst 1,500 and first 1,520 and\nl per 120forthe 1 per 60 for the\n\nremainder remainder\nexceeding 1,500 —_ exceeding 1,520\n1 per 75 for the 1 per 40 for the\n\nfirst 1,500 and first 1,520 and\n\nl per 120forthe 1 per 60 for the\nremainder remainder\nexceeding 1,500 exceeding 1,520\n\n1 per 25 for the first 50 and 1 per 50\nfor the remainder exceeding 50\n\n1 per 50\n\n1 per 100\n\n1 per 10\n\n1 per room’\n\n1 per 25\n\n1 per 75\n\n1 per cell\n\n1 per 15\n\n(continued)\n\n1 per 750\n\n[7\n\n1 per 200\n1 per 1 per\n200 150\n1 per 1 per\n200 150\n\n1 per 40 for the\nfirst 80 and\n\n1 per 80 forthe\nremainder\nexceeding 80\n\n1 per 50\n\n1 per 100\n\n1 per 10\n\n1 per room*\n\n1 per 35\n\n1 per 100\n\n1 per cell\n\n1 per 15\n\na a a Se i\n\n1 per 8\n\n1 per 15\n\n1 per 15\n\n1 per 15\n\n_ | 1 per 500 |\n—\n\nlm =\n\nm1 per 1,000\ner 1,\na!\n\nm | per 1,000 «\n- .\n\n1 per 1,000\n\n1 per 1,000\n\n1 per 100\n\n1 per 100\n\n1 per 400\n\n1 per 100\n\n1 per 100\n\n1 per 100\n\n1 per 500\n\n1 per 100\n\n1 per 100\n\n(SEE JoTHER |\n\n1\nservice\nsink\n\nae\n\n1\nservice\nsink\n\n1\nservice\nsink\n1\nservice\nsink\n\n1\nservice\nsink\n\n1\nservice\nsink\n\n1\nservice\nsink®\n\n1\nservice\nsink\n\n1\nservice\nsink\n\n1\nservice\nsink\n1\nservice\nsink per\nfloor\n\n1\nservice\nsink\n1\nservice\nsink\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 44,
        "text": "FIXTURES, FAUCETS AND FIXTURE FITTINGS\n\nTABLE 403.1—continued\nMINIMUM NUMBER OF REQUIRED PLUMBING FIXTURES? (See Sections 403.1.1 and 403.2)\n\n— =a = TER CLOSETS Milo DRINKING a\nr \"Hh ee SEE SECTION naz m a = - FOUNTAIN — 4\n\n| NO. [CLASSIFICATION! DscRPIN = — SII AMM stowers * (SEE ™ OTHER\nFEMALE. MALE—FEM, SECTION\nLe _ 1 40) fo\nEmployees in reformato- zal\n5 J ™ ries, detention centers and 1 per 25 a 1 per 35 — lI perl00 = 4\nr ) | Institutional | correctional centers? J\ncont.\nTL nnn\n_——— eee a\n| | Retail stores, service\nF stations, shops, sales- ] . | 1\n6 Mercantile rooms, markets and 1 per 500 _ 1 per 750 — 1 per 1,000 service sink®\n! shopping centers 7 =\nee ee\n~~ houses (transient) —~ sleeping unit sleeping unit sleeping unit service sink\nDormitories, fraternities, 1\nsororities and boarding 1 per 10 1 per 10 1 per8 1 per 100 .\n. service sink\nhouses (not transient)\n1 kitchen sink\nper dwelling\nunit; 1 auto-\nApartment house 1 per dwelling unit 1 per 1 per — matic clothes\nP P 8 dwelling unit dwelling unit washer\nconnection per\n20 dwelling\nit\n7 Residential oo anus\nCongregate living facili-\nties with 16 or fewer 1 per 10 1 per 10 1 per8 lper100 1 service sink\npersons\n1 kitchen sink\nOne- and two-family per dwelling\ndwellings and lodging 1 per dwelling unit 1 per 1 per — mati¢ clothes\nhouses with five or fewer Pe 8 dwelling unit — dwelling unit washer\nguestrooms -\nconnection per\ndwelling unit\nCongregate living facili- 1\nties with 16 or fewer 1 per 10 1 per 10 1 per8 1 per 100 service sink\npersons\nStructures for the storage\nof goods, warehouses, 1\n8 Storage storehouse and freight 1 per 100 1 per 100 _ 1 per 1,000 service sink\ndepots. Low and Moderate\nHazard.\n\na. The fixtures shown are based on one fixture being the minimum required for the number of persons indicated or any fraction of the number of persons indi-\ncated. The number of occupants shall be determined by the /nternational Building Code.\n\nb. Toilet facilities for employees shall be separate from facilities for inmates or care recipients.\n\nc. A single-occupant toilet room with one water closet and one lavatory serving not more than two adjacent patient sleeping units shall be permitted provided\nthat each patient sleeping unit has direct access to the toilet room and provision for privacy for the toilet room user is provided.\n\nd. The occupant load for seasonal outdoor seating and entertainment areas shall be included when determining the minimum number of facilities required.\n\n. For business and mercantile classifications with an occupant load of 15 or fewer, service sinks shall not be required.\n\nf. The required number and type of plumbing fixtures for outdoor public swimming pools shall be in accordance with Section 609 of the International Swim-\nming Pool and Spa Code.\n\n9\n\n2021 INTERNATIONAL PLUMBING CODE® 4-3\n"
    },
    {
        "page": 45,
        "text": "FIXTURES, FAUCETS AND FIXTURE FITTINGS\n\n403.1.1 Fixture calculations. To determine the occupant\nload of each sex, the total occupant load shall be divided\nin half. To determine the required number of fixtures, the\nfixture ratio or ratios for each fixture type shall be applied\nto the occupant load of each sex in accordance with Table\n403.1. Fractional numbers resulting from applying the\nfixture ratios of Table 403.1 shall be rounded up to the\nnext whole number. For calculations involving multiple\noccupancies, such fractional numbers for each occupancy\nshall first be summed and then rounded up to the next\nwhole number.\n\nExceptions:\n\n1. The total occupant load shall not be required to\nbe divided in half where approved statistical\ndata indicate a distribution of the sexes of other\nthan 50 percent of each sex.\n\n2. Where multiple-user facilities are designed to\nserve all genders, the minimum fixture count\nshall be calculated 100 percent, based on total\noccupant load. In such multiple-user facilities,\neach fixture type shall be in accordance with\nICC A117.1 and each urinal that is provided\nshall be located in a stall.\n\n3. Distribution of the sexes is not required where\nsingle-user water closets and bathing room\nfixtures are provided in accordance with\nSection 403.1.2.\n\n403.1.2 Single-user toilet and bathing room fixtures.\nThe plumbing fixtures located in single-user toilet and\nbathing rooms, including family or assisted-use toilet and\nbathing rooms that are required by Section 1109.2.1 of\nthe International Building Code, shall contribute toward\nthe total number of required plumbing fixtures for a\nbuilding or tenant space. Single-user toilet and bathing\nrooms, and family or assisted-use toilet rooms and bath-\ning rooms shall be identified as being available for use by\nall persons regardless of their sex.\n\nThe total number of fixtures shall be permitted to be\nbased on the required number of separate facilities or\nbased on the aggregate of any combination of single-user\nor separate facilities.\n\n403.1.3 Lavatory distribution. Where two or more toilet\nrooms are provided for each sex, the required number of\nlavatories shall be distributed proportionately to the\nrequired number of water closets.\n\n403.2 Separate facilities. Where plumbing fixtures are\nrequired, separate facilities shall be provided for each sex.\n\nExceptions:\n\n1. Separate facilities shall not be required for dwell-\ning units and sleeping units.\n\n2. Separate facilities shall not be required in struc-\ntures or tenant spaces with a total occupant load,\nincluding both employees and customers, of 15 or\nfewer.\n\n4-4\n\n3. Separate facilities shall not be required in mercan-\ntile occupancies in which the maximum occupant\nload is 100 or fewer.\n\n4. Separate facilities shall not be required in business\noccupancies in which the maximum occupant load\nis 25 or fewer.\n\n5. Separate facilities shall not be required to be\ndesignated by sex where single-user toilet rooms\nare provided in accordance with Section 403.1.2.\n\n6. Separate facilities shall not be required where\nrooms having both water closets and lavatory\nfixtures are designed for use by both sexes and\nprivacy for water closets is provided in accordance\nwith Section 405.3.4. Urinals shall be located in an\narea visually separated from the remainder of the\nfacility or each urinal that is provided shall be\nlocated in a stall.\n\n403.2.1 Family or assisted-use toilet facilities serving\nas separate facilities. Where a building or tenant space\nrequires a separate toilet facility for each sex and each\ntoilet facility is required to have only one water closet,\ntwo family or assisted-use toilet facilities shall be permit-\nted to serve as the required separate facilities. Family or\nassisted-use toilet facilities shall not be required to be\nidentified for exclusive use by either sex as required by\nSection 403.4.\n\n403.3 Employee and public toilet facilities. For structures\nand tenant spaces intended for public utilization, customers,\npatrons and visitors shall be provided with public toilet facil-\nities. Employees associated with structures and tenant spaces\nshall be provided with toilet facilities. The number of plumb-\ning fixtures located within the required toilet facilities shall\nbe provided in accordance with Section 403 for all users.\nEmployee toilet facilities shall be either separate or\ncombined employee and public toilet facilities.\n\nException: Public toilet facilities shall not be required\nfor:\n\n1. Parking garages without\n\nattendants.\n\noperated parking\n\n2. Structures and tenant spaces intended for quick\ntransactions, including takeout, pickup and drop-\noff, having a public access area less than or equal\nto 300 square feet (28 m*).\n\n403.3.1 Access. The route to the public toilet facilities\nrequired by Section 403.3 shall not pass through kitchens,\nstorage rooms or closets. Access to the required facilities\nshall be from within the building or from the exterior of\nthe building. The public shall have access to the required\ntoilet facilities at all times that the building is occupied.\n\n403.3.2 Prohibited toilet room location. Toilet rooms\nshall not open directly into a room used for the prepara-\ntion of food for service to the public.\n\n403.3.3 Location of toilet facilities in occupancies\nother than malls. In occupancies other than covered and\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 46,
        "text": "open mall buildings, the required public and employee\ntoilet facilities shall be located not more than one story\nabove or below the space required to be provided with\ntoilet facilities, and the path of travel to such facilities\nshall not exceed a distance of 500 feet (152 m).\n\nExceptions:\n\n1. The location and maximum distances of travel\nto required employee facilities in factory and\nindustrial occupancies shall be permitted to\nexceed that required by this section, provided\nthat the location and maximum distances of\ntravel are approved.\n\n2. The location and maximum distances of travel\nto required public and employee facilities in\nGroup S occupancies shall be permitted to\nexceed that required by this section, provided\nthat the location and maximum distances of\ntravel are approved.\n\n403.3.4 Location of toilet facilities in malls. In covered\nand open mall buildings, the required public and\nemployee toilet facilities shall be located not more than\none story above or below the space required to be\nprovided with toilet facilities, and the path of travel to\nsuch facilities shall not exceed a distance of 300 feet (91\nm). In mall buildings, the required facilities shall be based\non total square footage within a covered mall building or\nwithin the perimeter line of an open mall building, and\nfacilities shall be installed in each individual store or in a\ncentral toilet area located in accordance with this section.\nThe maximum distance of travel to central toilet facilities\nin mall buildings shall be measured from the main\nentrance of any store or tenant space. In mall buildings,\nwhere employees’ toilet facilities are not provided in the\nindividual store, the maximum distance of travel shall be\nmeasured from the employees’ work area of the store or\ntenant space.\n\n403.3.5 Pay facilities. Where pay facilities are installed,\nsuch facilities shall be in excess of the required minimum\nfacilities. Required facilities shall be free of charge.\n\n403.3.6 Door locking. Where a toilet room is provided\nfor the use of multiple occupants, the egress door for the\nroom shall not be lockable from the inside of the room.\nThis section does not apply to family or assisted-use toilet\nrooms.\n\n403.4 Signage. Required public facilities shall be provided\nwith signs that designate the sex, as required by Section\n403.2. Signs shall be readily visible and located near the\nentrance to each toilet facility. Signs for accessible toilet\nfacilities shall comply with Section 1111 of the /nternational\nBuilding Code.\n\n403.4.1 Directional signage. Directional signage indicat-\ning the route to the required public toilet facilities shall be\nposted in a lobby, corridor, aisle or similar space, such\nthat the sign can be readily seen from the main entrance to\nthe building or tenant space.\n\n403.5 Drinking fountain location. Drinking fountains shall\nnot be required to be located in individual tenant spaces\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nFIXTURES, FAUCETS AND FIXTURE FITTINGS\n\nprovided that public drinking fountains are located within a\ndistance of travel of 500 feet (152 m) of the most remote\nlocation in the tenant space and not more than one story\nabove or below the tenant space. Where the tenant space is in\na covered or open mall, such distance shall not exceed 300\nfeet (91 m).\n\n403.6 Service sink location. Service sinks shall not be\nrequired to be located in individual tenant spaces in a\ncovered mall provided that service sinks are located within a\ndistance of travel of 300 feet (91 m) of the most remote loca-\ntion in the tenant space and not more than one story above or\nbelow the tenant space. Service sinks shall be located on an\naccessible route.\n\nSECTION 404\nACCESSIBLE PLUMBING FACILITIES\n\n404.1 Where required. Accessible plumbing facilities and\nfixtures shall be provided in accordance with Chapter 11 of Jj\nthe International Building Code.\n\n404.2 Accessible fixture requirements. Accessible plumb-\ning fixtures shall be installed in accordance with ICC\nAl117.1.\n\nSECTION 405\nINSTALLATION OF FIXTURES\n\n405.1 Water supply protection. The supply lines and\nfittings for every plumbing fixture shall be installed so as to\nprevent backflow.\n\n405.2 Access for cleaning. Plumbing fixtures shall be\ninstalled so as to afford easy access for cleaning both the\nfixture and the area around the fixture.\n\n405.3 Setting. Fixtures shall be set level and in proper align-\nment with reference to adjacent walls.\n\n405.3.1 Water closets, urinals, lavatories and bidets. A\nwater closet, urinal, lavatory or bidet shall not be set\ncloser than 15 inches (381 mm) from its center to any side\nwall, partition, vanity or other obstruction. Where parti-\ntions or other obstructions do not separate adjacent water\nclosets, urinals, or bidets, the fixtures shall not be set\ncloser than 30 inches (762 mm) center to center between\nadjacent fixtures or adjacent water closets, urinals, or\nbidets. There shall be not less than a 21-inch (533 mm)\nclearance in front of a water closet, urinal, lavatory or\nbidet to any wall, fixture or door. Water closet compart-\nments shall be not less than 30 inches (762 mm) in width\nand not less than 60 inches (1524 mm) in depth for floor-\nmounted water closets and not less than 30 inches (762\nmm) in width and 56 inches (1422 mm) in depth for wall-\nhung water closets.\n\nException: An accessible children’s water closet shall\nbe set not closer than 12 inches (305 mm) from its\ncenter to the required partition or to the wall on one side.\n\n405.3.2 Public lavatories. In employee and public toilet\nrooms, the required lavatory shall be located in the same\nroom as the required water closet.\n\n4-5\n"
    },
    {
        "page": 47,
        "text": "FIXTURES, FAUCETS AND FIXTURE FITTINGS\n\n405.3.3 Location of fixtures and piping. Piping, fixtures\nor equipment shall not be located in such a manner as to\ninterfere with the normal operation of windows, doors or\nother means of egress openings.\n\n405.3.4 Water closet compartment. Each water closet\nutilized by the public or employees shall occupy a sepa-\nrate compartment with walls or partitions and a door\nenclosing the fixtures to ensure privacy.\n\nExceptions:\n\n1. Water closet compartments shall not be\nrequired in a single-occupant toilet room with a\nockable door.\n\n2. Toilet rooms located in child day care facilities\nand containing two or more water closets shall\n@ permitted to have one water closet without\nan enclosing compartment.\n\n3. This provision is not applicable to toilet areas\nocated within Group I-3 housing areas.\n\n405.3.5 Urinal partitions. Each urinal utilized by the\npublic or employees shall occupy a separate area with\nwalls or partitions to provide privacy. The horizontal\ndimension between walls or partitions at each urinal shall\nbe not less than 30 inches (762 mm). The walls or parti-\ntions shall begin at a height not greater than 12 inches\n(305 mm) from and extend not less than 60 inches (1524\nmm) above the finished floor surface. The walls or parti-\ntions shall extend from the wall surface at each side of the\nurinal not less than 18 inches (457 mm) or to a point not\nless than 6 inches (152 mm) beyond the outermost front\nlip of the urinal measured from the finished backwall\nsurface, whichever is greater.\n\nExceptions:\n\n1. Urinal partitions shall not be required in a\nsingle occupant or family/assisted-use toilet\nroom with a lockable door.\n\n2. Toilet rooms located in child day care facilities\nand containing two or more urinals shall be\npermitted to have one urinal without partitions.\n\n405.4 Floor and wall drainage connections. Connections\nbetween the drain and floor outlet plumbing fixtures shall be\nmade with a floor flange or a waste connector and sealing\ngasket. The waste connector and sealing gasket joint shall\ncomply with the joint tightness test of ASME A112.4.3 and\nshall be installed in accordance with the manufacturer’s\ninstructions. The flange shall be attached to the drain and\nanchored to the structure. Connections between the drain and\nwall-hung water closets shall be made with an approved\nextension nipple or horn adaptor. The water closet shall be\nbolted to the hanger with corrosion-resistant bolts or screws.\nJoints shall be sealed with an approved elastomeric gasket,\nflange-to-fixture connection complying with ASME\nA112.4.3 or an approved setting compound.\n\n405.4.1 Floor flanges. Floor flanges for water closets or\nsimilar fixtures shall be not less than 0.125 inch (3.2 mm)\n\n4-6\n\nthick for copper alloy, 0.25 inch (6.4 mm) thick for plastic\nand 0.25 inch (6.4 mm) thick and not less than a 2-inch\n(51 mm) caulking depth for cast iron or galvanized\nmalleable iron.\n\nFloor flanges of hard lead shall weigh not less than 1\npound, 9 ounces (0.7 kg) and shall be composed of lead\nalloy with not less than 7.75-percent antimony by weight.\nCloset screws and bolts shall be of copper alloy. Flanges\nshall be secured to the building structure with corrosion-\nresistant screws or bolts.\n\n405.4.2 Securing floor outlet fixtures. Floor outlet\nfixtures shall be secured to the floor or floor flanges by\nscrews or bolts of corrosion-resistant material.\n\n405.4.3 Securing wall-hung water closet bowls. Wall-\nhung water closet bowls shall be supported by a\nconcealed metal carrier that is attached to the building\nstructural members so that strain is not transmitted to the\nfixture connector or any other part of the plumbing\nsystem. The carrier shall conform to ASME A112.6.1M\nor ASME A112.6.2.\n\n405.5 Plumbing fixtures with a pumped waste. Plumbing\nfixtures with a pumped waste shall comply with ASME\nA112.3.4/CSA B45.9. The plumbing fixture with a pumped\nwaste shall be installed in accordance with the manufac-\nturer’s instructions.\n\n405.6 Watertight joints. Joints formed where fixtures come\nin contact with walls or floors shall be sealed.\n\n405.7 Plumbing in mental health centers. In mental health\ncenters, pipes or traps shall not be exposed, and fixtures shall\nbe bolted through walls.\n\n405.8 Design of overflows. Where any fixture is provided\nwith an overflow, the waste shall be designed and installed\nso that standing water in the fixture will not rise in the over-\nflow when the stopper is closed, and water will not remain in\nthe overflow when the fixture is empty.\n\n405.8.1 Connection of overflows. The overflow from\nany fixture shall discharge into the drainage system on the\ninlet or fixture side of the trap.\n\nException: The overflow from a flush tank serving a\nwater closet or urinal shall discharge into the fixture\nserved.\n\n405.9 Slip-joint connections. Slip joints shall be made with\nan approved elastomeric gasket and shall only be installed\non the trap outlet, trap inlet and within the trap seal. Fixtures\nwith concealed slip-joint connections shall be provided with\nan access panel or utility space not less than 12 inches (305\nmm) in its smallest dimension or other approved arrange-\nment so as to provide access to the slip-joint connections for\ninspection and repair.\n\n405.10 Design and installation of plumbing fixtures. Inte-\ngral fixture fitting mounting surfaces on manufactured\nplumbing fixtures or plumbing fixtures constructed on site\nshall meet the design requirements of ASME\nA112.19.2/CSA B45.1 or ASME A112.19.3/CSA B45.4.\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 48,
        "text": "SECTION 406\nAUTOMATIC CLOTHES WASHERS\n\n406.1 Water connection. The water supply to an automatic\nclothes washer shall be protected against backflow by an air\ngap that is integral with the machine or a backflow preventer\nshall be installed in accordance with Section 608. Air gaps\nshall comply with ASME A112.1.2 or A112.1.3.\n\n406.2 Waste connection. The waste from an automatic\nclothes washer shall discharge through an air break into a\nstandpipe in accordance with Section 802.3.3 or into a laun-\ndry sink. The trap and fixture drain for an automatic clothes\nwasher standpipe shall be not less than 2 inches (51 mm) in\ndiameter. The fixture drain for the standpipe serving an auto-\nmatic clothes washer shall connect to a 3-inch (76 mm) or\nlarger diameter fixture branch or stack. Automatic clothes\nwashers that discharge by gravity shall be permitted to drain\nto a waste receptor or an approved trench drain.\n\nSECTION 407\nBATHTUBS\n\n407.1 Approval. Bathtubs shall conform to ASME\nA112.19.1/CSA B45.2, ASME A112.19.2/CSA_ B45.1,\nASME A112.19.3/CSA B45.4 or CSA B45.5/IAPMO Z124.\n\n407.2 Bathtub waste outlets and overflows. Bathtubs shall\nbe equipped with a waste outlet that is not less than 1'/,\ninches (38 mm) in diameter. The waste outlet shall be\nequipped with a watertight stopper. Where an overflow is\ninstalled, the overflow shall be not less than 1'/, inches (38\nmm) in diameter.\n\n407.3 Glazing. Windows and doors within a bathtub enclo-\nsure shall conform to the safety glazing requirements of the\nInternational Building Code.\n\n407.4 Bathtub enclosure. Doors in a bathtub enclosure shall\nconform to ASME A112.19.15.\n\nSECTION 408\nBIDETS\n408.1 Approval. Bidets shall conform to ASME\n\nA112.19.2/CSA B45.1 or ASME A112.19.3/CSA B45.4.\n\n408.2 Water connection. The water supply to a bidet shall\nbe protected against backflow by an air gap or backflow\npreventer in accordance with Section 608.14.1, 608.14.2,\n608.14.3, 608.14.5, 608.14.6 or 608.14.8.\n\n408.3 Bidet water temperature. The discharge water\ntemperature from a bidet fitting shall be limited to not\ngreater than 110°F (43°C) by a water-temperature-limiting\ndevice conforming to ASSE 1070/ASME A112.1070/CSA\nB125.70.\n\nSECTION 409\nDISHWASHING MACHINES\n\n409.1 Approval. Commercial dishwashing machines shall\nconform to ASSE 1004 and NSF 3. Residential dishwashers\nshall conform to NSF 184.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nFIXTURES, FAUCETS AND FIXTURE FITTINGS\n\n409.2 Water connection. The water supply to a dishwashing\nmachine shall be protected against backflow by an air gap\nthat is integral with the machine or a backflow preventer\nshall be installed in accordance with Section 608. Air gaps\nshall comply with ASME A112.1.2 or A112.1.3.\n\n409.3. Waste connection. The waste connection of a\ncommercial dishwashing machine shall comply with Section\n802.1.6.\n\n409.4 Residential dishwasher waste connection. The waste\nconnection of a residential dishwasher shall connect directly\nto a wye branch fitting on the tailpiece of the kitchen sink,\ndirectly to the dishwasher connection of a food waste\ndisposer, or through an air break to a standpipe. The waste\nline of a residential dishwasher shall rise and be securely\nfastened to the underside of the sink rim or countertop.\n\nSECTION 410\nDRINKING FOUNTAINS\n\n410.1 Approval. Drinking fountains shall conform to ASME\nA112.19.1/CSA B45.2, ASME A112.19.2/CSA B45.1 or\nASME A112.19.3/CSA B45.4, and water coolers shall\nconform to ASHRAE 18. Drinking fountains, water coolers\nand water dispensers shall conform to NSF 61, Section 9.\nElectrically operated, refrigerated drinking water coolers\nand water dispensers shall be listed and labeled in accor-\ndance with UL 399.\n\n410.2 Small occupancies. Drinking fountains shall not be\nrequired for an occupant load of 15 or fewer.\n\n410.3 High and low drinking fountains. Where drinking\nfountains are provided on an exterior site, on a floor or\nwithin a secured area, the drinking fountains shall be\nprovided in accordance with Sections 410.3.1 and 410.3.2.\n\n[BE] 410.3.1 Minimum number. Not fewer than two\ndrinking fountains shall be provided. One drinking foun-\ntain shall comply with the requirements for people who\nuse a wheelchair and one drinking fountain shall comply\nwith the requirements for standing persons.\n\nExceptions:\n\n1. A single drinking fountain with two separate\nspouts that complies with the requirements for\npeople who use a wheelchair and standing\npersons shall be permitted to be substituted for\ntwo separate drinking fountains.\n\n2. Where drinking fountains are primarily for\nchildren’s use, the drinking fountains for\npeople using wheelchairs shall be permitted to\ncomply with the children’s provisions in ICC\nA117.1 and drinking fountains for standing\nchildren shall be permitted to provide the spout\nat 30 inches (762 mm) minimum above the\nfloor.\n\n[BE] 410.3.2 More than the minimum number. Where\nmore than the minimum number of drinking fountains\nspecified in Section 410.3.1 is provided, 50 percent of the\ntotal number of drinking fountains provided shall comply\nwith the requirements for persons who use a wheelchair\n\n4-7\n"
    },
    {
        "page": 49,
        "text": "FIXTURES, FAUCETS AND FIXTURE FITTINGS\n\nand 50 percent of the total number of drinking fountains\nprovided shall comply with the requirements for standing\npersons.\n\nExceptions:\n\n1. Where 50 percent of the drinking fountains\nyields a fraction, 50 percent shall be permitted\nto be rounded up or down, provided that the\ntotal number of drinking fountains complying\nwith this section equals 100 percent of the\ndrinking fountains.\n\n2. Where drinking fountains are primarily for\nchildren’s use, drinking fountains for people\nusing wheelchairs shall be permitted to comply\nwith the children’s provisions in ICC A117.1\nand drinking fountains for standing children\nshall be permitted to provide the spout at 30\ninches (762 mm) minimum above the floor.\n\n410.4 Substitution. Where restaurants provide drinking\nwater in a container free of charge, drinking fountains shall\nnot be required in those restaurants. In other occupancies\nwhere three or more drinking fountains are required, water\ndispensers shall be permitted to be substituted for not more\nthan 50 percent of the required number of drinking\nfountains.\n\n410.5 Prohibited location. Drinking fountains, water cool-\ners and water dispensers shall not be installed in public\nrestrooms.\n\nSECTION 411\nEMERGENCY SHOWERS\nAND EYEWASH STATIONS\n\n411.1 Approval. Emergency showers and eyewash stations\nshall conform to ISEA Z358.1.\n\n411.2 Waste connection. Waste connections shall not be\nrequired for emergency showers and eyewash stations.\n\n411.3 Water supply. Where hot and cold water is supplied\nto an emergency shower or eyewash station, the temperature\nof the water supply shall only be controlled by a tempera-\nture-actuated mixing valve complying with ASSE 1071.\nWhere water is supplied directly to an emergency shower or\neyewash station from a water heater, the water heater shall\ncomply with ASSE 1085.\n\nSECTION 412\nFAUCETS AND FIXTURE FITTINGS\n\n412.1 Approval. Faucets and fixture fittings shall conform\nto ASME A112.18.1/CSA B125.1. Faucets and fixture\nfittings that supply drinking water for human ingestion shall\nconform to the requirements of NSF 61, Section 9. Flexible\nwater connectors exposed to continuous pressure shall\nconform to the requirements of Section 605.6.\n\n412.1.1 Faucets and supply fittings. Faucets and supply\nfittings shall conform to the water consumption require-\nments of Section 604.4.\n\n412.1.2 Waste fittings. Waste fittings shall conform to\nASME A112.18.2/CSA B125.2, ASTM F409 or to one of\nthe standards listed in Tables 702.1 and 702.4 for\naboveground drainage and vent pipe and fittings.\n\n412.2 Hand showers. Hand-held showers shall conform to\nASME A112.18.1/CSA B125.1. Hand-held showers shall\nprovide backflow protection in accordance with ASME\nA112.18.1/CSA B125.1 or shall be protected against back-\nflow by a device complying with ASME A112.18.3.\n\n412.3 Individual shower valves. Individual shower and tub-\nshower combination valves shall be balanced-pressure, ther-\nmostatic or combination balanced-pressure/thermostatic\nvalves that conform to the requirements of ASSE\n1016/ASME_A112.1016/CSA_—-B125.16 or ASME\nA112.18.1/CSA B125.1. Such valves shall be installed at the\npoint of use. Shower control valves shall be rated for the\nflow rate of the installed shower head. Shower and tub-\nshower combination valves required by this section shall be\nequipped with a means to limit the maximum setting of the\nvalve to 120°F (49°C), which shall be field adjusted in\naccordance with the manufacturer’s instructions to provide\nwater at a temperature not to exceed 120°F (49°C). In-line\nthermostatic valves shall not be utilized for compliance with\nthis section.\n\n412.4 Multiple (gang) showers. Multiple (gang) showers\nsupplied with a single, tempered water supply pipe shall\nhave the water supply for such showers controlled by an\napproved automatic temperature control mixing valve that\nconforms to ASSE 1069 or CSA B125.3, or each shower\nhead shall be individually controlled by a balanced-pressure,\nthermostatic or combination balanced-pressure/thermostatic\nvalve that conforms to ASSE 1016/ASME A112.1016/CSA\nB125.16 or ASME A112.18.1/CSA B125.1 and that is\ninstalled at the point of use. Where a shower head is individ-\nually controlled, shower control valves shall be rated for the\nflow rate of the installed shower head. Such valves shall be\nequipped with a means to limit the maximum setting of the\nvalve to 120°F (49°C), which shall be field adjusted in\naccordance with the manufacturer’s instructions to provide\nwater at a temperature not to exceed 120°F (49°C). Access\nshall be provided to an ASSE 1069 or CSA B125.3 valve.\n\n412.5 Bathtub and whirlpool bathtub valves. Bathtubs and\nwhirlpool bathtub valves shall have or be supplied by a\nwater-temperature-limiting device that conforms to ASSE\n1070/ASME A112.1070/CSA B125.70 or by a water heater\ncomplying with ASSE 1082 or ASSE 1084, except where\nsuch valves are combination tub/shower valves in accor-\ndance with Section 412.3. The water-temperature-limiting\ndevice required by this section shall be equipped with a\nmeans to limit the maximum setting of the device to 120°F\n(49°C), and, where adjustable, shall be field adjusted in\naccordance with the manufacturer’s instructions to provide\nhot water at a temperature not to exceed 120°F (49°C).\nAccess shall be provided to water-temperature-limiting\ndevices that conform to ASSE 1070/ASME A112.1070/CSA\nB125.70.\n\nException: Access shall not be required for nonadjustable\nwater-temperature-limiting devices that conform to ASSE\n\n2021 INTERNATIONAL PLUMBING CODE®\n"
    },
    {
        "page": 50,
        "text": "1070/ASME A112.1070/CSA B125.70 and are integral\nwith a fixture fitting, provided that the fixture fitting itself\ncan be accessed for replacement.\n\n412.6 Hose-connected outlets. Faucets and fixture fittings\nwith hose-connected outlets shall conform to ASME\nA112.18.3 or ASME A112.18.1/CSA B125.1.\n\n412.7 Temperature-actuated, flow-reduction devices for\nindividual fixture fittings. Temperature-actuated, flow-\nreduction devices, where installed for individual fixture\nfittings, shall conform to ASSE 1062. A temperature-actu-\nated, flow-reduction device shall be an approved method for\nlimiting the water temperature to not greater than 120° F\n(49° C) at the outlet of a faucet or fixture fitting. Such\ndevices shall not be used alone as a substitute for the\nbalanced-pressure, thermostatic or combination shower\nvalves required in Section 412.3 or as a substitute for bathtub\nor whirlpool tub water-temperature-limiting valves required\nin Section 412.5.\n\n412.8 Transfer valves. Deck-mounted bath/shower transfer\nvalves containing an integral atmospheric vacuum breaker\nshall conform to the requirements of ASME A112.18.1/CSA\nB125.1.\n\n412.9 Water closet personal hygiene devices. Personal\nhygiene devices integral to water closets or water closet seats\nshall conform to the requirements of ASME A112.4.2/CSA\nB45.16.\n\n412.10 Head shampoo sink faucets. Head shampoo sink\nfaucets shall be supplied with hot water that is limited to not\nmore than 120°F (49°C). Each faucet shall have integral\ncheck valves to prevent crossover flow between the hot and\ncold water supply connections. The means for regulating the\nmaximum temperature shall be one of the following:\n\n1. A limiting device conforming to ASSE 1070/ASME\nA112.1070/CSA B125.70.\n\nA water heater conforming to ASSE 1082.\n\n3. A temperature-actuated, flow-reduction device conform-\ning to ASSE 1062.\n\n412.11 Prerinse spray valve. Prerinse spray valves for\n\ncommercial food service shall conform to ASME\nA112.18.1/CSA B125.1.\nSECTION 413\n\nFLOOR AND TRENCH DRAINS\n\n413.1 Approval. Floor drains shall conform to ASME\nA112.3.1, ASME A112.6.3 or CSA B79. Trench drains shall\ncomply with ASME A112.6.3.\n\n413.2 Floor drains. Floor drains shall have removable\nstrainers. The floor drain shall be constructed so that the\ndrain is capable of being cleaned. Access shall be provided to\nthe drain inlet. Ready access shall be provided to floor\ndrains.\n\nException: Floor drains serving refrigerated display\ncases shall be provided with access.\n\n413.3 Size of floor drains. Floor drains shall have a drain\noutlet not less than 2 inches (51 mm) in diameter.\n\n2021 INTERNATIONAL PLUMBING CODE®\n\nFIXTURES, FAUCETS AND FIXTURE FITTINGS\n\n413.4 Public laundries and central washing facilities. In\npublic coin-operated laundries and in the central washing\nfacilities of multiple-family dwellings, the rooms containing\nautomatic clothes washers shall be provided with floor\ndrains located to readily drain the entire floor area. Such\ndrains shall have an outlet of not less than 3 inches (76 mm)\nin diameter.\n\nSECTION 414\nFLOOR SINKS\n\n414.1 Approval. Sanitary floor sinks shall conform to the\nrequirements of ASME A112.6.7.\n\nSECTION 415\nFLUSHING DEVICES FOR\nWATER CLOSETS AND URINALS\n\n415.1 Flushing devices required. Each water closet, urinal,\nclinical sink and any plumbing fixture that depends on trap\nsiphonage to discharge the fixture contents to the drainage\nsystem shall be provided with a flushometer valve, flushom-\neter tank or a flush tank designed and installed to supply\nwater in quantity and rate of flow to flush the contents of the\nfixture, cleanse the fixture and refill the fixture trap.\n\n415.1.1 Separate for each fixture. A flushing device\nshall not serve more than one fixture.\n\n415.2 Flushometer valves and tanks. Flushometer valves\nand tanks shall comply with ASSE 1037/ASME\nA112.1037/CSA B125.37 or CSA B125.3. Vacuum breakers\non flushometer valves shall conform to the performance\nrequirements of ASSE 1001 or CSA B64.1.1. Access shall be\nprovided to vacuum breakers. Flushometer valves shall be of\nthe water-conservation type and shall not be used where the\nwater pressure is lower than the minimum required for\nnormal operation. When operated, the valve shall automati-\ncally complete the cycle of operation, opening fully and\nclosing positively under the water supply pressure. Each\nflushometer valve shall be provided with a means for regu-\nlating the flow through the valve. The trap seal to the fixture\nshall be automatically refilled after each flushing cycle.\n\n415.3 Flush tanks. Flush tanks equipped for manual flush-\ning shall be controlled by a device designed to refill the tank\nafter each discharge and to shut off completely the water\nflow to the tank when the tank is filled to operational capac-\nity. The trap seal to the fixture shall be automatically refilled\nafter each flushing. The water supply to flush tanks equipped\nfor automatic flushing shall be controlled with a timing\ndevice or sensor control devices.\n\n415.3.1 Fill valves. Flush tanks shall be equipped with an\nantisiphon fill valve conforming to ASSE 1002/ASME\nA112.1002/CSA B125.12 or CSA B125.3. The fill valve\nbackflow preventer shall be located not less than 1 inch\n(25 mm) above the full opening of the overflow pipe.\n\n415.3.2 Overflows in flush tanks. Flush tanks shall be\nprovided with overflows discharging to the water closet\nor urinal connected thereto and shall be sized to prevent\nflooding the tank at the maximum rate at which the tanks\n\n"
    }
]